<?php
ob_start();
define("API_KEY",'5755635631:AAEeA4hMZEP76FdVCSvEQnl1yC7rtEDZm2o');
$admin = "5318294539";
$bot = "ShahidBobo_bot";
function bot($method,$datas=[]){
$url = "https://api.telegram.org/bot".API_KEY."/$method";
$ch = curl_init();
curl_setopt($ch,CURLOPT_URL,$url);
curl_setopt($ch,CURLOPT_RETURNTRANSFER,true);
curl_setopt($ch,CURLOPT_POSTFIELDS,$datas); 
$res = curl_exec($ch);
if(curl_error($ch)){
var_dump(curl_error($ch));
}else{
return json_decode($res);
}
}



$update = json_decode(file_get_contents('php://input'));
$message = $update->message;
$mid = $message->message_id;
$data = $update->callback_query->data;
$type = $message->chat->type;
$text = $message->text;
$cid = $message->chat->id;
$uid= $message->from->id;
$message = $update->message;
$cid = $message->chat->id;
$cidtyp = $message->chat->type;
$miid = $message->message_id;
$name = $message->chat->first_name;
$user1 = $message->from->username;
$tx = $message->text;
$callback = $update->callback_query;
$mmid = $callback->inline_message_id;
$mes = $callback->message;
$mid = $mes->message_id;
$cmtx = $mes->text;
$mmid = $callback->inline_message_id;
$idd = $callback->message->chat->id;
$cbid = $callback->from->id;
$cbuser = $callback->from->username;
$data = $callback->data;
$ida = $callback->id;
$cqid = $update->callback_query->id;
$cbins = $callback->chat_instance;
$cbchtyp = $callback->message->chat->type;
$step = file_get_contents("step/$cid.step");
$update = json_decode(file_get_contents('php://input'));
$message = $update->message;
$mid = $message->message_id;
$msgs = json_decode(file_get_contents('msgs.json'),true);
$data = $update->callback_query->data;
$type = $message->chat->type;
$text = $message->text;
$cid = $message->chat->id;
$uid= $message->from->id;
$gname = $message->chat->title;
$left = $message->left_chat_member;
$new = $message->new_chat_member;
$name = $message->from->first_name;
$bio = $messenge->from->about;
$repid = $message->reply_to_message->from->id;
$repname = $message->reply_to_message->from->first_name;
$newid = $message->new_chat_member->id;
$leftid = $message->left_chat_member->id;
$newname = $message->new_chat_member->first_name;
$leftname = $message->left_chat_member->first_name;
$username = $message->from->username;
$cmid = $update->callback_query->message->message_id;
$cusername = $message->chat->username;
$repmid = $message->reply_to_message->message_id; 
$ccid = $update->callback_query->message->chat->id;
$cuid = $update->callback_query->message->from->id;
$message_id = $update->callback_query->message->message_id;
$firstname = $message->from->first_name;
$id = $update->callback_query->id;
$fromid = $message->from->id;
$from_id = $update->callback_query->from->id;
$nazad = "↩Orqaga↩";
$orqa = "🔝ORQAGA🔚";
$Orqa ="🔚ORQAGA🔝";

$menu = json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>"Asosiy Bo'lim 🕌"]],
[['text'=>"Manbalar 📚"],['text'=>"Haqida 🌙"]],
]
]);
$panel = json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>"📄Xabar Jo'natish"],],
[['text'=>"📊Statistika"],['text'=>"🗳Bot Kodi🗳"],],
[['text'=>"🚫Ban🚫"],['text'=>"🚫Bandan Olish✅"],],
[['text'=>"❇Userga Xabar❇"],],
]
]);
$key1 = json_encode([
'resize_keyboard'=>true,
'keyboard'=>[

[['text'=>"🎧Ҳикматли дунё» (1-қисм)"],['text'=>"🎧Ҳикматли дунё» (2-қисм)"]],
[['text'=>"🎧Ҳикматли дунё» (3-қисм)"],['text'=>"🎧Ҳикматли дунё» (4-қисм)"]],
[['text'=>"🎧Ҳикматли дунё» (5-қисм)"],['text'=>"🎧Ҳикматли дунё» (6-қисм)"]],
[['text'=>"$orqa"],],
]
]);
$keyseis = json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>"⭕Taklifim Bor"],],
[['text'=>"❓Savolim Bor"],],
[['text'=>"Bosh menyu"],],
]
]);
$roza = json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>"Рўза китоби - Кириш"],['text'=>"Рамазон рўзасининг фарзлиги ҳақида"]],
[['text'=>"Рўзанинг фазилатлари ҳақида"],['text'=>"Рўзанинг асли ва вақти баёни"]],
[['text'=>"Фажри содиқнинг аломати"],['text'=>"Рўза тутишни бошлаш ҳилолни кўриш билан бўлади"]],
[['text'=>"Ҳилолни кўришлик бир одил киши гувоҳлиги билан ҳам"],['text'=>"Ҳар ўлка ўзи ҳилол кўради"]],
[['text'=>"Ният ва рўзадорга мустаҳаб нарсалар ҳақида"],['text'=>"Ифтор пайтидаги дуо"]],
[['text'=>"Тилни тийиш"],['text'=>"Мисвок"]],
[['text'=>"Рамазонда Қуръон тиловати ва карамли бўлиш"],['text'=>"Таровеҳ"]],
[['text'=>"Таровеҳ намози адади"],['text'=>"Маън қилинган ишлар жинсий яқинлик"]],
[['text'=>"Қасддан еб ичмоқ ва қаъй қилмоқ"],['text'=>"Улаб тутиш"]],
[['text'=>"Қучоқлаш ва ўпиш"],['text'=>"Муболаға ила оғиз-бурун чайқаш"]],
[['text'=>"Рўзадорга жунублик халал бермайди"],['text'=>"Қон олдириш, сурма қўйиш, ғусл қилиш"]],
[['text'=>"Рўза очишга сабаб нарсалар"],['text'=>"Қари, ҳомиладор, беморлар"]],
[['text'=>"Ҳайзли, нифосли аёллар"],['text'=>"Маййит зиммасидаги қазони ўташ"]],
[['text'=>"Лайлатул қард ҳақида"],['text'=>"У рамазоннинг охирги ўн кечасида"]],
[['text'=>"У 27-кечада экани машҳур"],['text'=>"Рўза тутиш маън қилинган кунлар"]],
[['text'=>"Шаъбоннинг сўнгги ярми"],['text'=>"Шак куни"]],
[['text'=>"Ёлғиз жума ёки шанба рўзаси"],['text'=>"Нафл рўзаси ҳақида"]],
[['text'=>"Муҳаррам ойи рўзаси"],['text'=>"Ошуро куни"]],
[['text'=>"Ошуро куни рўзасининг фазли"],['text'=>"Ражаб рўзаси"]],
[['text'=>"Шаъбон рўзаси"],['text'=>"Шаъбон ярми рўзаси"]],
[['text'=>"Шавволдан кун рўза тутиш"],['text'=>"Зул-хижжанинг куни"]],
[['text'=>"Хожидан бошқасига арафа куни рўзаси"],['text'=>"Ҳар ойдан кун рўза тутиш"]],
[['text'=>"Оқ кунлар рўзаси"],['text'=>"Душанба ва пайшанба кунлари рўзаси"]],
[['text'=>"Бир кун тутиб, бир кун очиш"],['text'=>"Доимий рўза тутиш"]],
[['text'=>"Нафл рўза тутувчи ўзига ўзи амир"],['text'=>"Эътикоф ҳақида"]],
[['text'=>"Эътикоф ўтирувчи ҳожат учун масжиддан чиқади"],['text'=>"Эътикоф учун рўза шартми"]],
[['text'=>"Рўза китоби - Хулоса"],['text'=>"$orqa"]],
]
]);
$Vasat = json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>"Кириш"],['text'=>"Васатияни қандай тушунамиз?"]],
[['text'=>"Васатиянинг маъноси ва таърифи"],['text'=>"Қуръонда васатийлик"]],
[['text'=>"Cуннатда васатийлик"],['text'=>"Васатия ва салафи солиҳлар"]],
[['text'=>"Уламолар ва васатийлик"],['text'=>"Имом Ғаззолий ва васатия"]],
[['text'=>"Мусулмонлар васат уммат"],['text'=>"Ақийдада васатийлик"]],
[['text'=>"Илоҳ ҳақидаги ақийда"],['text'=>"Фаришталар ҳақидаги ақийда"]],
[['text'=>"Пайғамбарлар ҳақидаги ақийда"],['text'=>"Жинлар ҳақидаги ақийда"]],
[['text'=>"Ақийдадаги васатийлик намунаси"],['text'=>"Шариатдаги васатийлик"]],
[['text'=>"Ислом таклифлари ва аҳкомларидаги васатийлик"],['text'=>"Фарз ибодатидаги васатийлик"]],
[['text'=>"Намоздаги  васатийлик"],['text'=>"Закотдаги  васатийлик"]],
[['text'=>"Ҳаждаги  васатийлик"],['text'=>"Нафл ибодатлардаги  васатийлик"]],
[['text'=>"Нафл намозидаги  васатийлик"],['text'=>"Нафл рўзадаги  васатийлик"]],
[['text'=>"Нафл садақада васатийлик"],['text'=>"Қуръон тиловатидаги васатийлик"]],
[['text'=>"Тасаввуфдаги васатийлик"],['text'=>"Иқтисоддаги васатийлик"]],
[['text'=>"Дунё ва охиратдаги васатийлик"],['text'=>"Халқаро алоқалардаги васатийлик"]],
[['text'=>"Васатийликнинг фойдалари"],['text'=>"Васатийликдан оғишнинг оқибатлари"]],
[['text'=>"Динга жафочи бўлиш сабаблари"],['text'=>"Динда ҳаддан ошиш"]],
[['text'=>"Қуръон ва суннат ғулув ҳақида"],['text'=>"Cалафи солиҳлар  ғулув ҳақида"]],
[['text'=>"Қадимги уламолар  ғулув ҳақида"],['text'=>"Ҳозирги уламолар  ғулув ҳақида"]],
[['text'=>"Абу Ҳанифанинг бағрикенглиги"],['text'=>"Ибн Ханбалнинг бағрикенглиги"]],
[['text'=>"Ибн Хазмнинг бағрикенглиги"],['text'=>"Лайс ибн Саъднинг бағрикенглиги"]],
[['text'=>"Ғулувнинг зарарларидан"],['text'=>"Ғулувнинг турлари"]],
[['text'=>"Амалий ғулув"],['text'=>"Эътиқодий  ғулув"]],
[['text'=>"Хаворижлар ва диндан отилиб чиқувчилар ҳақида"],['text'=>"Ғулувнинг сабаблари"]],
[['text'=>"Замонавий ғулувнинг сабаблари"],['text'=>"Ғулувнинг  оқибатлари"]],
[['text'=>"Кофирлик ҳақида фатво бериш"],['text'=>"Куфрнинг маъноси ва таърифи"]],
[['text'=>"Иймон ва куфр шўъбалари аралашуви"],['text'=>"Бировни кофир дейишнинг хатари"]],
[['text'=>"Ғулувчилар кимларни кофир дейдилар"],['text'=>"Жамоатдан четланганни кофирга чиқариш"]],
[['text'=>"Маъсият туфайли кофирга чиқариш"],['text'=>"Ҳижрат қилмаганни кофирга чиқариш"]],
[['text'=>"Тақлидга қарши ғулув"],['text'=>"Замонавий раддия"]],
[['text'=>"Амал ва ўзини тутишдаги ғулув — террорчилик"],['text'=>"Таълимни харом деб бесаводликка чақириш"]],
[['text'=>"Макка босқичи бидъати"],['text'=>"Ҳукумат ишида ишламаслик"]],
[['text'=>"Васатийлик — ҳаёт йўли"],['text'=>"$orqa"]],
]
]);
$Haj = json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>"Ҳаж китоби"],['text'=>"Тарихи"]],
[['text'=>"Умумий қоидалар, хажнинг таърифи"],['text'=>"Ҳажга тайёргарлик"]],
[['text'=>"Ҳажнинг турлари"],['text'=>"Ҳаж аҳкомлари"]],
[['text'=>"Арафотда туриш"],['text'=>"Тавофи ифоза"]],
[['text'=>"Ҳажнинг вожиблари"],['text'=>"Ҳажнинг суннатлари"]],
[['text'=>"Ҳаж сафари олдидан қилинадиган ишлар"],['text'=>"Амаллар баёни - Эҳром"]],
[['text'=>"Ҳарами Шарифга кириш"],['text'=>"Тавоф"]],
[['text'=>"Минода"],['text'=>"Арофатда"]],
[['text'=>"Муздалифада"],['text'=>"Тош отиш"]],
[['text'=>"Тавофи ифоза"],['text'=>"Ҳайитнинг иккинчи куни"]],
[['text'=>"Тавофи видо"],['text'=>"Қўшимча изоҳ"]],
[['text'=>"Аёл кишининг хажи"],['text'=>"Таматту ҳаж"]],
[['text'=>"Қирон ҳажи"],['text'=>"Умра"]],
[['text'=>"Ҳаж ва Умрани бузадиган нарсалар"],['text'=>"Бадал ҳаж"]],
[['text'=>"Жиноятлар"],['text'=>"Мадинаи Мунаввара зиёрати"]],
[['text'=>"Сўнг сўз"],['text'=>"$orqa"]],

]
]);
$Tabobat = json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>"«Кириш» қисми"],['text'=>"«Кириш» қисми 2-кисм"]],
[['text'=>"Тозаликка риоя қилиш"],['text'=>"СОҒЛИҚҚА ЗАРАР EТКАЗУВЧИ ВА АТРОФНИ ИФЛОС ҚИЛУВЧИ НАРСАЛАР"]],
[['text'=>"БАДАНТАРБИЯ"],['text'=>"СОҒЛИҚҚА ЗАРАРЛИ НАРСАЛАРНИНГ ҲАРОМ ҚИЛИНИШИ"]],
[['text'=>"Исроф ва Кизганиш"],['text'=>"ЖИСМНИ ТОЛИҚТИРИШДАН ҚАЙТАРИШ"]],
[['text'=>"СОҒЛИҚНИ САҚЛАШ МАҚСАДИДА EНГИЛЛИК ВА РУХСАТЛАР БЕРИЛГАНИ"],['text'=>"ХУЛOСА"]],
[['text'=>"ВАБОДА САБР ҚИЛИШНИНГ АЖРИ"],['text'=>"CЕҲР"]],
[['text'=>"ЗАҲАР"],['text'=>"БЕМОР КЎРИШ СУННАТДИР"]],
[['text'=>"МУСИБАТДА АЙТИЛАДИГАН НАРСА"],['text'=>"ДАВОЛАНИШ ЖОИЗЛИГИ ҲАҚИДА"]],
[['text'=>"ПАРҲЕЗ ДАВОНИНГ БОШИДИР"],['text'=>"НАБАВИЙ ТИБ ҲАҚИДА"]],
[['text'=>"АСАЛ, ҚИЗИГАН НАРСА БОСИШ ВА ҚОН ОЛИШ"],['text'=>"ҚОН ОЛИШ ЖОЙИ ВА ЗАМОНИ"]],
[['text'=>"ҚОРА ДОНА"],['text'=>"УВДУ ҲИНДИ"]],
[['text'=>"ОҒИЗДАН ИЧИЛАДИГАН, БУРУНДАН ТОМИЗИЛАДИГАН ВА ИЧНИ ЮРГИЗАДИГАН ДОРИЛАР"],['text'=>"АЖВА ВА КАМЪА"]],
[['text'=>"ИСИТМА ВА КЎЗ ТЕККАНГА СУВ"],['text'=>"ТАЛБИЙНА ВА СУРМА"]],
[['text'=>"ЗАЙТУН МОЙИ ВА САНО"],['text'=>"ТУЯНИНГ СУТИ ВА ПЕШОБИ"]],
[['text'=>"ЖАРОҲАТГА КУЛ БОСИШ"],['text'=>"СЕМИРИШ УЧУН ТАРРА ВА ҲЎЛ ХУРМО"]],
[['text'=>"ҲАРОМ ИЛА ДАВОЛАНИШ ЖОИЗ ЭМАС"],['text'=>"ДАМ СОЛИШ ҲАҚИДА"]],
[['text'=>"ДАМ СОЛИШ КАЛИМАЛАРИ"],['text'=>"ҚУРЪОН ИЛА ДАМ СОЛИШ ВА УНГА АЖР ОЛИШНИНГ ЖОИЗЛИГИ"]],
[['text'=>"ФАЛАҚ СУРАСИ"],['text'=>"НАС СУРАСИ"]],
[['text'=>"КАСАЛЛИК ЮҚИШИ ВА ШУМЛАНИШ ЙЎҚ, ЭҲТИЁТ БЎЛИШ ЯХШИ"],['text'=>"ЯХШИ ФОЛ ҚАНДОҚ ЯХШИ"]],
[['text'=>"КОҲИНЛИК, ЧИЗИҚ ЧИЗИШ ВА ТОШ ТАШЛАШ"],['text'=>"АЛЛОҲ ТАОЛОГА ТАВАККУЛ АФЗАЛ"]],
[['text'=>"ТИБ СОҲАСИДАГИ ИСЛОМ МЎЪЖИЗАСИ"],['text'=>"ИСЛОМИЙ ТИБГА ЎХШАШ ТИБ БОРМИ?"]],
[['text'=>"ТАБИБЛАРНИ ИМТИҲОНДАН ЎТКАЗИШ"],['text'=>"МУСУЛМОНЛАРНИНГ ТИББИЙ КАШФИЁТЛАРИ"]],
[['text'=>"МУСУЛМОНЛАРНИНГ ТИББИЙ КИТОБЛАРИ"],['text'=>"ДОРИШУНОСЛИК"]],
[['text'=>"$orqa"],],
]
]);
$sunniy = json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>"Сунний_ақийдалар 1. Муқаддима"],['text'=>"Ақийда нима?"]],
[['text'=>"Ақоид илмининг таърифи"],['text'=>"Ақоид илмининг мақсади"]],
[['text'=>"Ақоид илмининг мавзуси"],['text'=>"Aқоид илмининг номлари"]],
[['text'=>"Aқоид илмининг тарихи"],['text'=>"Имом Абулҳасан ал-Ашъарий"]],
[['text'=>"Имом Абу Мансур ал-Мотуридий"],['text'=>"Илм нима?"]],
[['text'=>"Ҳис қилиш доираларидан ташқари илм"],['text'=>"Хабарлар ва нақлларни текшириш"]],
[['text'=>"Оғзаки маълумотни текшириш"],['text'=>"Ёзма маълумотни текшириш"]],
[['text'=>"Даъво ёки фаразни аниқлаш"],['text'=>"Мусулмонлардан бошқаларда"]],
[['text'=>"Мусулмонларда"],['text'=>"Ислом илм дини"]],
[['text'=>"Бошқаларда дин ва илм"],['text'=>"Илм ислом тарафидаа"]],
[['text'=>"Ақийда далиллари"],['text'=>"Қатъий ва қатъий эмас хабарлар"]],
[['text'=>"Ақийда ҳужжатлари бўйича хулосалар"],['text'=>"Ақоиднинг бош мавзулари"]],
[['text'=>"Илоҳият Аллоҳнинг борлиги"],['text'=>"Аллоҳнинг исмлари ва сифатлари"]],
[['text'=>"Аллоҳнинг сифатлари ва салафлар"],['text'=>"Аллоҳнинг сифатлари ва халафлар"]],
[['text'=>"Сифатларнинг тақсими"],['text'=>"Сифатларнинг шарҳи"]],
[['text'=>"Аллоҳнинг каломи масаласи ҳадис ва суннат имомлари наздида"],['text'=>"Маънавий сифатлар"]],
[['text'=>"Аллоҳнинг исм ва сифатларига боғлиқ масалалар"],['text'=>"Аллоҳ таолони нуқсонлардан поклаш"]],
[['text'=>"Қазо ва қадар"],['text'=>"Сунний_ақийдаларXотима"]],
[['text'=>"Инсон амали масаласи"],['text'=>"Иститоат ва унинг турлари"]],
[['text'=>"Савоб ва иқоб"],['text'=>"Жаннатга кирмай қолиш амал туфайлидир"]],
[['text'=>"Дўзахга кирмай қолиш амал туфайли"],['text'=>"Ибодат ва дуо"]],
[['text'=>"Дуо ҳақида"],['text'=>"Дуонинг ижобат бўлиши ва ҳожатнинг раво бўлиши"]],
[['text'=>"Бошқаларга дуо ва савобни бағишлаш"],['text'=>"Ўлганларга дуо қилиш ва уларга савоб аташ"]],
[['text'=>"Садақанинг савоби етишига далил"],['text'=>"Савобни бағишлаш ҳақида аҳли бидъатнинг мазҳаби"]],
[['text'=>"Эслатма"],['text'=>"Касб ва таваккул"]],
[['text'=>"Ризқ масаласи"],['text'=>"Аллоҳни кўриш масаласи"]],
[['text'=>"Нубувват"],['text'=>"Ваҳий нима"]],
[['text'=>"Нубувват ва рисолатнинг маъноси"],['text'=>"Нубувват ва рисолатнинг маъноси"]],
[['text'=>"Набий ва Расул орасидаги фарқ"],['text'=>"Пайғамбарликни Аллоҳ беради"]],
[['text'=>"Анбиёлар ва Расулларга иймон"],['text'=>"Улул азм пайғамбарлар"]],
[['text'=>"Пайғамбар башардир"],['text'=>"Пайғамбарлар оддий башардир"]],
[['text'=>"Пайғамбарлар маъсумдирлар"],['text'=>"Пайғамбар омонатли бўлади"]],
[['text'=>"Пайғамбар эр кишидан бўлади"],['text'=>"Пайғамбарлар ўз қавми тилида юборилади"]],
[['text'=>"Пайғамбарларнинг бир-бирларидан фазли ҳақида"],['text'=>"Пайғамбарларнинг вазифалари"]],
[['text'=>"Пайғамбарларнинг мўъжизалари"],['text'=>"Пайғамбар алайҳиссаломнинг мўъжизалари"]],
[['text'=>"У зотнинг панжалари орасидан сув чиқиши"],['text'=>"У зотнинг баракалари ила оз сувнинг кўпайиши"]],
[['text'=>"Таомнинг қавмга етиб ортиб қолгунча кўпайтирилиши"],['text'=>"У зотнинг ҳузурларида таомнинг тасбеҳ айтиши"]],
[['text'=>"Оз хурмони кўпайтириб ҳақдорларга етказиш"],['text'=>"Хурмо шохининг у зотга зорланиши"]],
[['text'=>"Дарахтнинг у зотга бўйсуниши"],['text'=>"Муҳаммад алайҳиссалом хотамул анбиёдирлар"]],
[['text'=>"Муҳаммад алайҳиссаломнинг бошқа набийлардан фарқлари"],['text'=>"Илоҳий китобларга иймон"]],
[['text'=>"Кавниёт"],['text'=>"Инсон"]],
[['text'=>"Фаришталар"],['text'=>"Фаришталарнинг сифатлари"]],
[['text'=>"Фаришталарнинг вазифалари"],['text'=>"Жиинлар"]],
[['text'=>"Борлиқдаги сабабият қонуни"],['text'=>"Ғаийбиёт"]],
[['text'=>"Ўлим ва унга боғлиқ нарсалар"],['text'=>"Қабр саволи"]],
[['text'=>"Қиёмат аломатлари"],['text'=>"ДОББАТУЛ АРЗ"]],
[['text'=>"ЯЪЖУЖ ВА МАЪЖУЖ"],['text'=>" ҚУЁШНИНГ МАҒРИБДАН ЧИҚИШИ"]],
[['text'=>"ДАЖЖОЛНИНГ ЧИҚИШИ"],['text'=>"ИЙСО АЛАЙҲИССАЛОМНИНГ ТУШИШЛАРИ"]],
[['text'=>"ИМОМ МАҲДИЙ РОЗИЯЛЛОҲУ АНҲУ ҲАҚЛАРИДА"],['text'=>"Қиёматнинг кичик аломатлари"]],
[['text'=>"Қииёмат"],['text'=>"Қиёмат қойим бўлишига далиллар"]],
[['text'=>"Қиёмат қандай қоим бўлади?"],['text'=>"Қайта тирилиш ва ҳашр"]],
[['text'=>"Ҳолатнинг оғирлиги"],['text'=>"Ҳисоб"]],
[['text'=>"Тарозу ва амалларни тортиш"],['text'=>"Сирот ва ундан ўтиш"]],
[['text'=>"Шафоат"],['text'=>"ҲАВЗ"]],
[['text'=>"Жаннат ва дўзаҳ"],['text'=>"Жаннат"]],
[['text'=>"Дўзах"],['text'=>"АРШ"]],
[['text'=>"АРШ ВА КУРСИ ҲАҚИДА"],['text'=>"КУРСИ ҲАҚДИР"]],
[['text'=>"ЛАВҲУЛ - МАҲФУЗ ВА ҚАЛАМ"],['text'=>"ИЙМОННИНГ ТАЪРИФИ"]],
[['text'=>"ИЙМОН БИЛАН ИСЛОМ ОРАСИДАГИ ФАРҚ"],['text'=>"ИЙМОННИНГ ЗИЁДА ВА НОҚИС БЎЛИШИ"]],
[['text'=>"ДУНЁВИЙ ИШЛАРДА ЗОҲИРИГА ҚАРАБ ҲУКМ ЧИҚАРИЛАДИ"],['text'=>"МУСУЛМОННИНГ КОФИР ДЕЙИШ ҲУКМИ"]],
[['text'=>"$orqa"],],
]
]);

$ODob= json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>"СЎЗ БОШИ"],['text'=>"ОДОБНИНГ ТАЪРИФИ"]],
[['text'=>"ОДОБНИНГ АҲАМИЯТИ"],['text'=>"ОДОБНИНГ МАНБАИ"]],
[['text'=>"ОДОБНИНГ ҒОЯСИ"],['text'=>"ИСЛОМИЙ ОДОБЛАРНИНГ ХУСУСИЯТЛАРИ"]],
[['text'=>"ОДОБНИНГ ВАТАНИМИЗДАГИ ҲОЛАТИ"],['text'=>"ИЖТИМОИЙ ОДОБЛАР ШИОРИ"]],
[['text'=>"КАЛОМ ОДОБИ"],['text'=>"ЁЛҒОН"]],
[['text'=>"ҒИЙБАТ"],['text'=>"ЧАҚИМЧИЛИК"]],
[['text'=>"БОТИЛ СЎЗГА КИРИШИШ"],['text'=>"УЯТСИЗ СЎЗЛАРНИ СЎЗЛАШ"]],
[['text'=>"СЎКИШ ВА АЧЧИҚ-ТИЗИҚ ГАПИРИШ"],['text'=>"МАСХАРА ВА ИСТЕҲЗО"]],
[['text'=>"МАДДОҲЛИК"],['text'=>"СЎЗГА ЭЪТИБОРСИЗЛИК"]],
[['text'=>"ИЛМСИЗ КИШИЛАРНИНГ ИЛМИЙ СУҲБАТГА АРАЛАШИШИ"],['text'=>"БЕҲУДА СЎЗ"]],
[['text'=>"КАЛОМГА ОИД ОДОБЛАР"],['text'=>"САЛОМЛАШИШ ОДОБЛАРИ"]],
[['text'=>"МАСКАН ОДОБЛАРИ"],['text'=>"МАСКАНДА МЎЪТАДИЛ БЎЛИШ ВА ШАРОИТНИ ЯХШИЛАШ"]],
[['text'=>"МАСКАНДАГИ МОДДИЙ ОДОБЛАР"],['text'=>"МАСКАНДАГИ МАЪНАВИЙ ОДОБЛАР"]],
[['text'=>"МАСКАН ЭГАЛАРИНИНГ ЎЗАРО ОДОБЛАРИ"],['text'=>"ЭР-ХОТИН ОДОБЛАРИ"]],
[['text'=>"ЭРНИНГ БУРЧЛАРИ"],['text'=>"ХОТИННИНГ БУРЧЛАРИ"]],
[['text'=>"ОВҚАТЛАНИШ ОДОБЛАРИ"],['text'=>"ТАОМЛАНИШ ҲАҚИДА ҲУКМЛАР"]],
[['text'=>"ТАОМ ЕЙИШ ОДОБЛАРИ"],['text'=>"ИЧИМЛИК ИЧИШ ҲУКМЛАРИ ВА ОДОБЛАРИ"]],
[['text'=>"МЕҲМОНДОРЧИЛИК ОДОБЛАРИ"],['text'=>"ТЎЙ ВА МАРОСИМ ОДОБЛАРИ"]],
[['text'=>"ЙИҒИН ВА МАЖЛИСЛАР ОДОБИ"],['text'=>" БАЙРАМЛАР ВА ТУРЛИ ТАНТАНАЛАР ОДОБИ"]],
[['text'=>"ДИНИЙ БАЙРАМЛАРНИ НИШОНЛАШ СУННАТЛАРИ ВА РЎЗА БАЙРАМИГА ХОС ИШЛАР"],['text'=>"ҚУРБОН БАЙРАМИГА ХОС ИШЛАР"]],
[['text'=>"ИККАЛА БАЙРАМДА ҲАМ БАРАВАР ҚИЛИНАДИГАН ИШЛАР"],['text'=>"ЖУМАНИ ҲАФТА БАЙРАМИ СИФАТИДА НИШОНЛАШ"]],
[['text'=>"МАЖОЗИЙ БАЙРАМЛАРНИ НИШОНЛАШ ҲАҚИДА"],['text'=>"ИСРО ВА МЕЪРОЖ КЕЧАСИ ҲАҚИДА"]],
[['text'=>"МАВЛИД БАЙРАМИ ҲАҚИДА"],['text'=>"ДАМ ОЛИШ ЖОЙЛАРИ ВА САЙРГОҲЛАР ОДОБЛАРИ"]],
[['text'=>"ЁШЛАР ОДОБИ"],['text'=>"ТУРЛИ КИШИЛАР БИЛАН МУОМАЛА ОДОБЛАРИ"]],
[['text'=>"БОШҚА ДИНДАГИЛАР БИЛАН МУОМАЛА ОДОБИ"],['text'=>"КИЙИНИШ ОДОБЛАРИ"]],
[['text'=>"КИЙИМ ҲАҚИДА ШАРЪИЙ ҲУКМЛАР"],['text'=>"ЛИБОСГА ОИД УМУМИЙ ҲУКМЛАР"]],
[['text'=>"КИЙИНИШНИНГ УМУМИЙ ОДОБЛАРИ"],['text'=>"ЭРКАКЛАРГА ХОС КИЙИНИШ ОДОБЛАРИ"]],
[['text'=>"АЁЛЛАРНИНГ КИЙИНИШ ОДОБЛАРИ"],['text'=>"ШАХСИЙ ОЗОДАЛИК ОДОБЛАРИ"]],
[['text'=>"БАДАН ПОКЛИГИ ОДОБЛАРИ"],['text'=>"ХАЛО ОДОБЛАРИ"]],
[['text'=>"ФИТРАТ (СОФ ТАБИАТ) СУННАТЛАРИ"],['text'=>"АТРОФ МУҲИТ ПОКЛИГИ"]],
[['text'=>"АТРОФ МУҲИТ ПОКЛИГИ"],['text'=>"ЙЎЛ ОДОБЛАРИ"]],
[['text'=>"НАҚЛИЁТ ВОСИТАЛАРИ ОДОБЛАРИ"],['text'=>"ЙЎЛОВЧИ ОДОБЛАРИ"]],
[['text'=>"УЯЛИ ТЕЛЕФОН ОДОБЛАРИ"],['text'=>" УЯЛИ АЛОҚА ВОСИТАСИГА ОИД ОДОБЛАР"]],
[['text'=>"ЖАМОАТЧИЛИККА НИСБАТАН ОДОБЛАР"],['text'=>"СУҲБАТДОШГА НИСБАТАН ОДОБЛАР"]],
[['text'=>"ИНТЕРНЕТ ОДОБЛАРИ"],['text'=>"ИНТЕРНЕТДАН ФОЙДАЛАНИШ ОДОБЛАРИ"]],
[['text'=>"ИЖТИМОИЙ ТАРМОҚЛАРДАГИ АЛОҚА ОДОБЛАРИ"],['text'=>"ЭЛЕКТРОН ПОЧТА ОДОБЛАРИ"]],
[['text'=>"САФАР ОДОБЛАРИ"],['text'=>"МАТБУОТ ВА АХБОРОТ ВОСИТАЛАРИ ОДОБЛАРИ"]],
[['text'=>"МОЛ-ДУНЁ ВА БОЙЛИК ОДОБЛАРИ"],['text'=>"ТИЖОРАТ ОДОБЛАРИ"]],
[['text'=>"МАСЖИД ОДОБЛАРИ"],['text'=>"МАСЖИД ҚУРИШ ВА УНИ ОБОД ҚИЛИШ"]],
[['text'=>"МАСЖИДДАГИ ОДОБЛАР"],['text'=>"МАСЖИДДА ЖАМОАТ НАМОЗИ ЎҚИШНИНГ АҲАМИЯТИ"]],
[['text'=>"ЖАМОАТ НАМОЗИ ОДОБЛАРИ"],['text'=>"ЖУМА ОДОБЛАРИ"]],
[['text'=>"ҚЎШНИЧИЛИК ОДОБЛАРИ"],['text'=>"ҚЎШНИНИHГ ҲАҚЛАРИ"]],
[['text'=>"ҚЎШНИЛАРНИНГ МУОМАЛА ОДОБЛАРИ"],['text'=>"ИЛМ ОДОБЛАРИ"]],
[['text'=>"ИЛМ ТАЛАБ ҚИЛИШ ФАРЗДИР"],['text'=>"ИЛМ ТАЛАБ ҚИЛИШ ОДОБЛАРИ"]],
[['text'=>"ТАЪЛИМ БЕРИШ ВА МУАЛЛИМ ОДОБЛАРИ"],['text'=>"СУҲБАТ ОДОБЛАРИ"]],
[['text'=>"КАСБ ВА ИШ БАЖАРУВЧИ ОДОБЛАРИ"],['text'=>"КАСБ ОДОБЛАРИ"]],
[['text'=>"БЕМОРЛИК ВА БЕМОРНИ ЗИЁРАТ ҚИЛИШ ОДОБЛАРИ"],['text'=>"БЕМОРНИНГ ОДОБЛАРИ"]],
[['text'=>"ТАБИБНИНГ ОДОБЛАРИ"],['text'=>"БЕМОРНИ ЗИЁРАТ ҚИЛИШ ОДОБЛАРИ"]],
[['text'=>"ЎЛИМ, ЖАНОЗА, ТАЪЗИЯ ОДОБЛАРИ"],['text'=>"МУҲТАЗАРГА НИСБАТАН ҚИЛИНАДИГАН ИШЛАP"]],
[['text'=>"ЖОН УЗИЛГАНИДАН КЕЙИН ҚИЛИНАДИГАН ИШЛАP"],['text'=>"ЖАНОЗА ОДОБЛАРИ"]],
[['text'=>"$orqa"],],
]
]);

$ruha = json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>"Руҳий тарбия"],['text'=>"Руҳий тарбия 2"]],
[['text'=>"$orqa"],],
]
]);

$ramazon= json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>"Рўза қандай ибодат?"],['text'=>"Сизларга рўза тутиш фарз қилинди...» (1-қисм)"]],
[['text'=>"Сизларга рўза тутиш фарз қилинди...» (2-қисм)"],['text'=>"Сизларга рўза тутиш фарз қилинди...» (3-қисм)"]],
[['text'=>"Сизларга рўза тутиш фарз қилинди...» (4-қисм)"],['text'=>"РЎЗАНИНГ ДАРАЖАЛАРИ"]],
[['text'=>"РЎЗАНИНГ ШАРТЛАРИ"],['text'=>"РЎЗАНИНГ ТУРЛАРИ"]],
[['text'=>"РЎЗА ТУТИШ ҲАРОМ БЎЛГАН КУНЛАР"],['text'=>"РЎЗА ТУТИШ МАКРУҲ БЎЛГАН КУНЛАР"]],
[['text'=>"ИХТИЁРИЙ РЎЗА"],['text'=>"РЎЗАНИНГ НИЯТИ"]],
[['text'=>"РАМАЗОННИНГ ҲИЛОЛИ"],['text'=>"САҲАРЛИК ВА ИФТОРЛИK"]],
[['text'=>"САҲАРЛИК ВА ИФТОРЛИК ҲАҚИДА САВОЛ-ЖАВОБЛАР"],['text'=>"РЎЗАНИНГ МУСТАҲАБЛАРИ"]],
[['text'=>"РЎЗАНИ БУЗАДИГАН НАРСАЛАР"],['text'=>"МАВЗУГА ОИД САВОЛ-ЖАВОБЛAР"]],
[['text'=>"РЎЗАНИ БУЗМАЙДИГАН НАРСАЛАР"],['text'=>"РЎЗАНИ БУЗАДИГАН ВА БУЗМАЙДИГАН АМАЛЛАРГА ОИД САВОЛ-ЖАВОБЛАР"]],
[['text'=>"РЎЗАДОРГА МАКРУҲ БЎЛГАН НАРСАЛАР"],['text'=>"РЎЗАДА МАКРУҲ БЎЛГАН НАРСАЛАРГА ОИД САВОЛ-ЖАВОБЛАР"]],
[['text'=>"АЁЛЛАРГА ХОС МАСАЛАЛАР"],['text'=>"РЎЗА ТУТМАСЛИККА РУҲСАТ БЕРИЛГАНЛАР"]],
[['text'=>"РЎЗА ТУТМАСЛИКНИ ЁКИ ОЧИШНИ МУБОҲ ҚИЛУВЧИ ҲОЛАТЛАР"],['text'=>"ҚАЗО ВА КАФФОРОТГА ОИД САВОЛ-ЖАВОБЛАР"]],
[['text'=>"ЭЪТИКОФ"],['text'=>"ЭЪТИКОФГА ОИД САВОЛ-ЖАВОБЛАР"]],
[['text'=>"ФИТР САДАҚАСИ"],['text'=>"ФИТР САДАҚАСИНИНГ ВОЖИБ БЎЛИШ ШАРТЛАРИ"]],
[['text'=>"ФИТР САДАҚАСИГА ОИД САВОЛ-ЖАВОБЛАР"],['text'=>"ФИДЯ"]],
[['text'=>"ФИДЯГА ОИД САВОЛ-ЖАВОБЛАР"],['text'=>"ТАРОВЕҲ НАМOЗИ"]],
[['text'=>"МАВЗУГА ОИД САВOЛ-ЖАВОБЛАР"],['text'=>"МИНГ ОЙДАН ЯХШИРОҚ КЕЧА"]],
[['text'=>"НАФЛ РЎЗАЛАР ҲАҚИДАГИ ҲАДИСЛАР"],['text'=>"НАФЛ РЎЗАГА ОИД САВОЛ-ЖАВОБЛАР"]],
[['text'=>"ИЙДУЛ ФИТР НАМОЗИ"],['text'=>"РЎЗА ТУТИНГЛАР САЛОМАТ БЎЛАСИЗЛАР"]],
[['text'=>"$orqa"],],
]
]);

$Yaxshi = json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>"Муқаддима#ЯХШИЛИК_СИЛАИ_РАҲМ"],['text'=>"Ота-онага яхшилик қилиш"]],
[['text'=>"Ота-онага яхшилик қилиш(02)"],['text'=>"Отанинг ҳаққи улуғ"]],
[['text'=>"Онанинг хизматини қилиш"],['text'=>"ЎҒИЛ ОТАГА ИМОМ БЎЛМАЙДИ"]],
[['text'=>"ОТА-ОНАГА ЁМОН ҚАРАМАСЛИК"],['text'=>"ОТА-ОНАНИ ТАШЛАБ ТИЖОРАТГА КЕТМАСЛИК"]],
[['text'=>"ОТАДАН ОЛДИН ЮРМАСЛИК"],['text'=>"ОТА-ОНАНИ ЧИН ДИЛДАН ЯХШИ КЎРИШ"]],
[['text'=>"ОТА-ОНАГА СИЛАИ РАҲМ"],['text'=>"ТАВБАГА КЎП ҚАЙТУВЧИЛАР"]],
[['text'=>"ОТА-ОНАНИ СИЛТАМАСЛИК"],['text'=>"ОНА УЧУН ХАЖГА БОРМАСЛИК"]],
[['text'=>"КЕТГАНДА ВА КЕЛГАНДА САЛОМ"],['text'=>"ОТА-ОНАНИ РОЗИ ҚИЛИШ"]],
[['text'=>"ОТА-ОНАДАН ДУО ОЛИШ"],['text'=>"МАЪСИЯТГА ИТОАТ ЭТИЛМАЙДИ"]],
[['text'=>"ХОЛА ОНА ЎРНИГА ЎТАДИ"],['text'=>"АКА ОТА ЎРНИГА"]],
[['text'=>"ЭМИЗГАН АЁЛНИНГ ҲАҚҚИ"],['text'=>"АМАКИ ОТА ЎPНИГА ЎТАДИ"]],
[['text'=>"ОТА-ОНАГА ОҚ БЎЛИШ"],['text'=>"ҚАРИНДОШГА СИЛАИ РАҲМ ҚИЛИШ"]],
[['text'=>"ҚАРИНДОШЛИК"],['text'=>"ФАРЗАНДГА ЯХШИЛИИК ҚИЛИШ"]],
[['text'=>"ДЎСТЛАРГА ИКРОМ КЎРСАТИШ"],['text'=>"ҚИЗЛАР ТАРБИЯСИ"]],
[['text'=>"САДАҚАНИНГ ЭНГ АФЗАЛИ"],['text'=>"ФАРЗАНДЛАРГА АДОЛАТЛИ БЎЛИШ"]],
[['text'=>"ФАРЗАНД ТАРБИЯСИ"],['text'=>"ФАРЗАНДГА МЕҲР"]],
[['text'=>"ҲАЛОЛ КАСБ ҚИЛИШ"],['text'=>"МЕРОС ҲАҚИДА"]],
[['text'=>"ҚАРИНДОШЛАРГА САДАҚА ҚИЛИШ"],['text'=>"ТАРБИЯ САДАҚАДАН АФЗАЛ"]],
[['text'=>"АҲЛИДАН ОРТСА САДАҚА ҚИЛИШ"],['text'=>"САДАҚАНИ БИЛИБ БЕРИШ"]],
[['text'=>"ФАРЗАНД УЧУН БАХИЛ БЎЛИШ"],['text'=>"ЗУЛМ"]],
[['text'=>"ҚАРАМОҒИДАГИЛАРНИ ЗОЕ ҚИЛИШ"],['text'=>"ФАРЗАНД ОТА-ОНАСИНИ АМРИ-МАЪРУФ ҚИЛИШИ"]],
[['text'=>"ЭТИМНИНГ РИОЯСИ"],['text'=>"ҲАДЯ БЕРГАНГА ДУО ҚИЛИШ"]],
[['text'=>"ҲАДЯ БЕРИШ"],['text'=>"$orqa"]],
]
]);

$Zikrduo = json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>"Зикр, истиғфор, тавба ва дуолар китоби"],['text'=>"Зикр ва зокирларнинг фазли ҳақида"]],
[['text'=>"Аллоҳнинг гўзал исмлари"],['text'=>"Исмул Аъзам"]],
[['text'=>"Тасбеҳ, ҳамд, такбир ва таҳлилнинг фазли"],['text'=>"Тасбеҳни санаш ва тасбеҳнинг асли"]],
[['text'=>"Ла ҳавла вала қуввата илла биллаҳ -Жаннат калитларидан биридир"],['text'=>"Намоздан кейинги зикрлар"]],
[['text'=>"Намоздан кейинги жамоий дуо"],['text'=>"Жамоат ила дуо қилиш"]],
[['text'=>"Эрталаб ва кечки тасбеҳ ва зикрлар"],['text'=>"Зикрнинг фойда ва самаралари"]],
[['text'=>"Зикрнинг сийғалари"],['text'=>"Зокирнинг одоблари"]],
[['text'=>"Дуонинг фазли"],['text'=>"Дуонинг одоблари"]],
[['text'=>"Мақбул дуо"],['text'=>"Набий алайҳиссаломнинг умматларига қилган дуолари"]],
[['text'=>"Жамловчи дуолар"],['text'=>"Паноҳ сўраш калималари"]],
[['text'=>"Мушкули борнинг дуоси"],['text'=>"Сафар ва ундан қайтгандаги дуо"]],
[['text'=>"Видолашув дуоси"],['text'=>"Ҳилолни кўргандаги дуо"]],
[['text'=>"Мажлисдан туриш дуоси"],['text'=>"Хўроз қичқирганда ва эшшак ханграганда айтиладиган қавл"]],
[['text'=>"Уйдан чиқиш ва унга киришдаги дуо"],['text'=>"Ёмғир, шамол ва момақалдироқдаги дуо"]],
[['text'=>"Ҳар бир манзилга тушиш дуоси"],['text'=>"Ҳар бир манзилга тушиш дуоси"]],
[['text'=>"Мева нишонасини кўргандаги дуо"],['text'=>"Қўрқинч ва уйқусизликни ман қилувчи дуо"]],
[['text'=>"Қарзни узиш дуоси"],['text'=>"Балога учрагандагини кўргандаги дуо"]],
[['text'=>"Беморнинг дуоси"],['text'=>"Бозорга киришдаги дуо"]],
[['text'=>"Ёд олиш дуоси"],['text'=>"Дуонинг одоблари"]],
[['text'=>"Набий алайҳиссаломга саловат"],['text'=>"Истиғфор ва тавба ҳақида"]],
[['text'=>"Хулосалар"],['text'=>"Тавба ва унинг фазли"]],
[['text'=>"Тавбанинг вақти"],['text'=>"Гар бандаси исроф қилган бўлса ҳам Аллоҳ тавбасини қабул қилур"]],
[['text'=>"Тавба умр бўйи"],['text'=>"Тавба қиссалари"]],
[['text'=>"Каъб ибн Молик розияллоҳу анҳунинг тавбаси"],['text'=>"Иброҳим ибн Адҳамнинг тавбаси"]],
[['text'=>"Фузайл ибн Иёзнинг тавбаси"],['text'=>"Маҳзунлик сафари"]],
[['text'=>"Куфада"],['text'=>"Аллоҳ таолонинг раҳматининг кенглиги ҳақида"]],
[['text'=>"$orqa"],],
]
]);

$Saodat = json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>"Мукаммал_саодат_йўли  Муқаддима 1"],['text'=>"Мукаммал_саодат_йўли  Муқаддима 2"]],
[['text'=>"Инсон ҳақиқати"],['text'=>"Маърифат излаб"]],
[['text'=>"Саодат излаб"],],
[['text'=>"Ақлни пешлайдиган илм"],['text'=>"Диний маърифатнинг хусусияти"]],
[['text'=>"Ислом-илм динидир"],['text'=>"Илм ислом тарафида"]],
[['text'=>"Исломнинг мақсадлари"],['text'=>"Исломнинг асослари"]],
[['text'=>"Дин таълимотлари"],['text'=>"Аллоҳ таолога иймон Фаришталарга иймон"]],
[['text'=>"Илоҳий китобларга иймон Пайғамбарларга иймон"],['text'=>"Охират кунига иймон"]],
[['text'=>"Илоҳиёт"],['text'=>"Нубувват"]],
[['text'=>"Ғайбиёт"],['text'=>"Ислом шариати"]],
[['text'=>"Инсон ҳаётини муҳофаза қилиш"],['text'=>"Жони бор ҳомиласини олдириб ташлаган аёл ўз боласини қотили бўлади"]],
[['text'=>"Ислом шариати инсон ҳаётини муҳофаза қилиш мақсадида ўзини ўзи ўлдиришни ҳаромдир"],['text'=>"Ислом шариати инсон ҳаётини муҳофаза қилиш мақсадида қасосни жорий қилган"]],
[['text'=>"Ислом шариати инсон ҳаётини муҳофаза қилиш мақсадида инсонни уриш ва азоблашни ман қилган"],['text'=>"Ислом шариати инсон ҳаётини муҳофаза қилиш мақсадида ўзини ўзи қийнашни ман қилди"]],
[['text'=>"Инсоннинг ақлини муҳофаза қилиш"],['text'=>"Ислом шариати ақлни муҳофаза қилиш мақсадида, ақлга зарар етказадиган нарсаларни ҳаром қилади"]],
[['text'=>"Ислом шариати ақлни муҳофаза қилиш мақсадида ақлни ўстиришни фарз қилган"],['text'=>"Ислом шариати ақлни муҳофаза қилиш мақсадида ақлни хурофот, зарарли ҳаёл ва фикрлардан озод этди"]],
[['text'=>"Инсоннинг динини муҳофаза қилиш"],['text'=>"Ислом шариати динни муҳофаза қилиш мақсадида инсонларга диндорлик таянчи бўлган иймон асосларини тарғиб қилди"]],
[['text'=>"Ислом шариати динни муҳофаза қилиш мақсадида иймон-эътиқоднинг ақлий ва илмий-ҳужжатлар асосида бўлишини таъминлади"],['text'=>"Ислом шариати динни муҳофаза қилиш мақсадида диндорликка чақириб, динсизликдан қайтаришни йўлга қўйди"]],
[['text'=>"Ислом шариати динни муҳофаза қилиш мақсадида инсонларга эътиқод ва диндорлик эркилигини берди"],['text'=>"Ислом шариати дин муҳофаза муҳофазаси учун ватанни ҳам тарк қилишни жорий қилди"]],
[['text'=>"Инсоннинг наслини муҳофаза қилиш"],['text'=>"Ислом шариати инсон наслини муҳофаза қилиш мақсадида никоҳни жорий қилди"]],
[['text'=>"Ислом шариати инсон наслини муҳофаза қилиш мақсадида шариатга иддани киритди"],['text'=>"Ислом шариати инсон наслини муҳофаза қилиш мақсадида насабнинг поклигига катта аҳамият берди"]],
[['text'=>"Ислом шариати инсон наслини муҳофаза қилиш мақсадида яқин қариндошлар орасида никоҳни ҳаром қилди"],['text'=>"Ислом шариати инсон наслини муҳофаза қилиш мақсадида ота-оналарга ва жамиятга ёш авлод учун жавобгар этди"]],
[['text'=>"Ислом шариати инсон наслини муҳофаза қилиш мақсадида ота-оналарга ва жамиятга ёш авлод учун жавобгар этди"],['text'=>"Ислом шариати инсон наслини муҳофаза қилиш мақсадида наслга зарарли жинсий алоқаларни ҳаром қилди"]],
[['text'=>"Ислом шариати насл муҳофазасига футур етказадиган барча ишларни таъқиқлаган"],['text'=>"Ислом инсон наслини муҳофаза қилиш мақсадида наслга зарар етказадиган жинсий алоқаларни қилганларни жазолайди"]],
[['text'=>"Инсоннинг мол-мулкини муҳофаза қилиш"],['text'=>"Ислом шариати мол-мулкни муҳофаза қилиш мақсадида меҳнат қилишга, ризқни териб ейишга ундади"]],
[['text'=>"Инсоннинг молни муҳофаза қилиш мақсадида бировнинг молини ботил йўл билан ейишни ҳаром қилди"],['text'=>"Инсоннинг молни муҳофаза қилиш мақсадида рибохўрликни ҳаром қилди"]],
[['text'=>"Ислом шариати молни муҳофаза қилиш мақсадида алдамчиликни, савдода ёлғонни ишлатишни ҳаром қилди"],['text'=>"Ислом шариати молни муҳофаза қилиш мақсадида қиморни ҳаром қилди"]],
[['text'=>"Ислом шариати молни муҳофаза қилиш мақсадида нархни сунъий равишда кўтаришни ҳаром қилди"],['text'=>"Ислом шариати молни муҳофаза қилиш мақсадида ғасбни ҳаром қилди"]],
[['text'=>"Ислом шариати молни муҳофаза қилиш мақсадида ғарарни ҳаром қилди"],['text'=>"Ислом шариати молни муҳофаза қилиш мақсадида пора олишни ва беришни ҳаром қилди"]],
[['text'=>"Ислом шариати молни муҳофаза қилиш мақсадида исрофни ҳаром қилди"],['text'=>"Ислом шариати молни муҳофаза қилиш мақсадида молиявий муомалаларни ёзиб боришни жорий қилди"]],
[['text'=>"Ислом шариати молни муҳофаза қилиш мақсадида ҳалол касбга амр қилди ва ҳаромдан мол топишни ман қилди"],['text'=>"Манфаатлар"]],
[['text'=>"Ислом шариати молни муҳофаза қилиш мақсадида молиявий ибодатларни жорий қилди"],],
[['text'=>"Манфаатлар Биринчи қисм"],['text'=>"Манфаатлар Иккинчи қисм"]],
[['text'=>"Манфаатлар 3- қисм Таҳсиниёт"],['text'=>"Масолиҳул  мурсала"]],
[['text'=>"Шаръий амалларнинг турлари Фарз"],['text'=>"Шаръий амалларнинг турлари Вожиб"]],
[['text'=>"Шаръий амалларнинг турлари Суннат"],['text'=>"Шаръий амалларнинг турлари Ҳаром"]],
[['text'=>"Шаръий амалларнинг турлари Макруҳи таҳримий"],['text'=>"Шаръий амалларнинг турлари Макруҳи танзиҳий"]],
[['text'=>"Шаръий амалларнинг турлари Мубоҳ"],['text'=>"Шаръий амаллар баёни"]],
[['text'=>"Поклик китоби"],['text'=>"Таҳорат"]],
[['text'=>"Ғусл"],['text'=>"Сувларнинг ҳукми"]],
[['text'=>"Таяммумнинг ҳукми"],['text'=>"Узрлилар"]],
[['text'=>"Нажаслар боби"],['text'=>"Истинжо ва хало одоблари"]],
[['text'=>"Намоз китоби"],['text'=>"Намознинг сифати"]],
[['text'=>"Намознинг ҳикмати"],['text'=>"Намознинг вақтлари"]],
[['text'=>"Намознинг шартлари. Аврат, қибла ва ният"],['text'=>"Жамоат ва имомат. Сутра, витр, нафл ва таровеҳ"]],
[['text'=>"Кусуф ва хусуф. Истисқо. Қазо намозлари"],['text'=>"Саждаи саҳв ва тиловат саждаси"]],
[['text'=>"Беморнинг намози. Мусофирнинг намози. Жума намози"],['text'=>"Икки ийд намози. Жанозалар боби. Хавф намози"]],
[['text'=>"Закот китоби"],['text'=>"Рўза китобии"]],
[['text'=>"Ҳаж китобии"],['text'=>"Никоҳ китоби"]],
[['text'=>"Талоқ"],['text'=>"Молиявий муомалалар"]],
[['text'=>"Савдо китоби"],['text'=>"Турли масалалар"]],
[['text'=>"Бахтли ҳаёт ахлоқи"],['text'=>"Руҳий тарбия китоби"]],
[['text'=>"Рўзa"],['text'=>"Ҳaж"]],
[['text'=>"Қуръони Карим тиловати"],['text'=>"Зикр"]],
[['text'=>"Руҳий тарбиянинг иккинчи қисми"],['text'=>"Ҳавф ва Ражо"]],
[['text'=>"Тақво ва вараъ"],['text'=>"Руҳий тарбиянинг учинчи кисми"]],
[['text'=>"Тазктятун нафснинг самаралари"],['text'=>"Саодатли ҳаёт соҳибининг кун тартиби"]],
[['text'=>"Таҳоратга доир"],['text'=>"Турли одамлар билан муомала одоби"]],
[['text'=>"$orqa"],],
]
]);

$key = json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>"☪Duo va zikrlar"],],
[['text'=>"🇸🇦Arab tili Darslari 1-qism"],['text'=>"📑Tajvid Darslari 1-qism"]],
[['text'=>"📑Tajvid Darslari 2-qism"]],
[['text'=>"❇️Muhammad S.A.V hujjatli film"],['text'=>"⏰Namoz Vaqtlari"]],
[['text'=>"📜Sahobalar hayoti 1-qism"],['text'=>"📜Sahobalar hayoti 2-qism"]],
[['text'=>"📃Siyrat Darslari"],['text'=>"📃Siyrat Darslari 2-QISM"]],
[['text'=>"🔵Hadis ilmini o'rganamiz"],['text'=>"💦Nafsni Poklash"]],
[['text'=>"❌Gunohi kabiralar🚫"],['text'=>"📝Qur'on o'qishni o'rganamiz"]],
[['text'=>"📖Fiqh fani"],['text'=>"📒Aqida Darslari"]],
[['text'=>"☪Namoz"]],
[['text'=>"🟢Tafsiri Hilol"],['text'=>"📿Allohning zikri ila qalblar orom topur"]],
[['text'=>"💫Payg'ambarimizning mo'jizalari"],['text'=>"❔So'ragan edingiz"]],
[['text'=>"📋Payg'ambarimizning ayollari"]],
[['text'=>"Keyingi bo‘lim"],],
[['text'=>"Bosh menyu"],],
]
]);

$mojiza = json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>"1-Mo'jiza"],['text'=>"2-Mo'jiza"]],
[['text'=>"3-Mo'jiza"],['text'=>"4-Mo'jiza"]],
[['text'=>"5-Mo'jiza"],['text'=>"6-Mo'jiza"]],
[['text'=>"7-Mo'jiza"],['text'=>"8-Mo'jiza"]],
[['text'=>"9-Mo'jiza"],['text'=>"10-Mo'jiza"]],
[['text'=>"11-Mo'jiza"],['text'=>"12-Mo'jiza"]],
[['text'=>"13-Mo'jiza"],['text'=>"14-Mo'jiza"]],
[['text'=>"15-Mo'jiza"],['text'=>"16-Mo'jiza"]],
[['text'=>"17-Mo'jiza"],['text'=>"$nazad"]],
]
]);
$sora = json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>"Suv qachon obi mustaʼmalga aylanadi"],['text'=>"Erning ahli-ayoli oldidagi burchlari"]],
[['text'=>"Hozirgi kunda fiqhiy mazhablarga ergashish shartmi"],['text'=>"Safarda sunnat o'qiladimi"]],
[['text'=>"Paypoqqa mas'h tortsa bo'ladimi"],['text'=>"Аrab tilini yaxshi bilgan kishi Qurʼondan oʼzicha hukm chiqarsa boʼladimi"]],
[['text'=>"Namozdan so'ng nima deb duo qilish kerak"],['text'=>"Qur'on o‘qib savobini o‘tganlarga bag‘ishlasa bo‘ladimi"]],
[['text'=>"Shayton va jinlarning yomonligidan qanday saqlanish mumkin"],['text'=>"Qaysi holatlarda namozni buzish mumkin"]],
[['text'=>"Qazo namozlarning hukmi"],['text'=>"Hamkasbim islomni qabul qilmoqchi. U nima qilishi kerak"]],
[['text'=>"Qalbga ozor berishning hukmi"],['text'=>"Televizor ko'rish harommi"]],
[['text'=>"Niyatda namoz rakatlarini tayin qilish shartmi"],['text'=>"Dinimizda folbinlik va fol ochirishning hukmi"]],
[['text'=>"Tog'ut nima"],['text'=>"Zimmasida qazo namozlari boʼlganlar sunnatlarni oʼqimaydimi"]],
[['text'=>"Sajdaga borish va undan turish tartibi qanday"],['text'=>"Janoza namozi durust bo‘lishi uchun necha kishi ishtirok etishi kerak"]],
[['text'=>"Hayit namozini uyda o'qisa bo'ladimi"],['text'=>"ijtimoiy tarmoqlardagi diniy kanallar ishonchlimi"]],
[['text'=>"Ashuro kuni ro'zasining fazilati"],['text'=>"Musofir kishi safari davomida namozlarini avtoulovlarda oʼqib ketishiga shariatimizda nima deyilgan"]],
[['text'=>"Jumaning 2 rakat farzidan oldin va keyin sunnatni o'qimay turib chiqib ketishning hukmi qanday"],['text'=>"Dinimizda odob-ahloqning o‘rni"]],
[['text'=>"Ichkilik va giyohvand moddalarning salbiy ta'siri"],['text'=>"Zakot nisobi sharhi (1-qism)"]],
[['text'=>"Zakot nisobi sharhi (2-qism)"],['text'=>"Ёшлар ҳаётида ижтимоий тармоқларнинг ўрни"]],
[['text'=>"Zakot nima va uni kim beradi"],['text'=>"Aslida namozni qayerida qo'l ko'tariladi"]],
[['text'=>"Karantin paytida safda oraliq masofani saqlash namozni nuqsonli qiladimi"],['text'=>"Qo'y va echkilardan zakot qanday ado etiladi"]],
[['text'=>"Islomda oila va nikoh qanday ahamiyatga ega"],['text'=>"Yoshlar ta'lim-tarbiyasida do'stning ahamiyati"]],
[['text'=>"Namozda qo‘llar qayerga qo‘yiladi"],['text'=>"Va'da va ushr haqida "]],
[['text'=>"Dorul Islomdan hijrat qilinadimi"],['text'=>"$nazad"]],
]
]);
$Zikr = json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>"Allohning zikri ila qalblar orom topur 1-kun"],['text'=>"Allohning zikri ila qalblar orom topur 2-kun"]],
[['text'=>"Allohning zikri ila qalblar orom topur 3-kun"],['text'=>"Allohning zikri ila qalblar orom topur 4-kun"]],
[['text'=>"Allohning zikri ila qalblar orom topur 5-kun"],['text'=>"Allohning zikri ila qalblar orom topur 6-kun"]],
[['text'=>"Allohning zikri ila qalblar orom topur 7-kun"],['text'=>"Allohning zikri ila qalblar orom topur 8-kun"]],
[['text'=>"Allohning zikri ila qalblar orom topur 9-kun"],['text'=>"Allohning zikri ila qalblar orom topur 10-kun"]],
[['text'=>"Allohning zikri ila qalblar orom topur 11-kun"],['text'=>"Allohning zikri ila qalblar orom topur 12-kun"]],
[['text'=>"Allohning zikri ila qalblar orom topur 13-kun"],['text'=>"Allohning zikri ila qalblar orom topur 14-kun"]],
[['text'=>"Allohning zikri ila qalblar orom topur 15-kun"],['text'=>"Allohning zikri ila qalblar orom topur 16-kun"]],
[['text'=>"Allohning zikri ila qalblar orom topur 17-kun"],['text'=>"Allohning zikri ila qalblar orom topur 18-kun"]],
[['text'=>"Allohning zikri ila qalblar orom topur 19-kun"],['text'=>"Allohning zikri ila qalblar orom topur 20-kun"]],
[['text'=>"Allohning zikri ila qalblar orom topur 21-kun"],['text'=>"Allohning zikri ila qalblar orom topur 22-kun"]],
[['text'=>"Allohning zikri ila qalblar orom topur 23-kun"],['text'=>"Allohning zikri ila qalblar orom topur 24-kun"]],
[['text'=>"Allohning zikri ila qalblar orom topur 25-kun"],['text'=>"Allohning zikri ila qalblar orom topur 26-kun"]],
[['text'=>"$nazad"],],
]
]);
$Oqish = json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>"Qurʼon o‘qishni o‘rganamiz (Fotiha surasi)"],['text'=>"Qurʼon o‘qishni o‘rganamiz (An-Nass surasi)"]],
[['text'=>"Qurʼon o‘qishni o‘rganamiz (Falaq surasi)"],['text'=>"Qurʼon o‘qishni o‘rganamiz (Ixlos surasi)"]],
[['text'=>"Qurʼon o‘qishni o‘rganamiz (Masad surasi)"],['text'=>"Qurʼon o‘qishni o‘rganamiz (Nasr surasi)"]],
[['text'=>"Qurʼon o‘qishni o‘rganamiz (Kafirun surasi)"],['text'=>"Qurʼon o‘qishni o‘rganamiz (Kavsar surasi)"]],
[['text'=>"Qurʼon o‘qishni o‘rganamiz (Maaʼuun surasi)"],['text'=>"Qurʼon o‘qishni o‘rganamiz (Quraysh surasi)"]],
[['text'=>"Qur’on o‘qishni o‘rganamiz (Fil surasi)"],['text'=>"Qurʼon o‘qishni o‘rganamiz (Humaza surasi)"]],
[['text'=>"Qurʼon o‘qishni o‘rganamiz (Asr surasi)"],['text'=>"Qurʼon o‘qishni o‘rganamiz (Takaasur surasi)"]],
[['text'=>"Qurʼon o‘qishni o‘rganamiz (Qori'a surasi"],['text'=>"Qurʼon o‘qishni o‘rganamiz (Aʼdiyat surasi)"]],
[['text'=>"Qurʼon o‘qishni o‘rganamiz (Zalzala surasi)"],['text'=>"Qurʼon o‘qishni o‘rganamiz (Bayyina surasi 1-5 oyatlar)"]],
[['text'=>"Qurʼon o‘qishni o‘rganamiz (Bayyina surasi 6-8 oyatlar)"],['text'=>"Qurʼon o‘qishni o‘rganamiz (Qadr surasi)"]],
[['text'=>"Qurʼon o‘qishni o‘rganamiz (Alaq surasi)"],['text'=>"Qurʼon o‘qishni o‘rganamiz (Tiyn surasi)"]],
[['text'=>"Qurʼon o‘qishni o‘rganamiz (Sharh surasi)"],['text'=>"Qurʼon o‘qishni o‘rganamiz (Zuho surasi)"]],
[['text'=>"Qurʼon o‘qishni o‘rganamiz (Layl surasi)"],['text'=>"Qurʼon o‘qishni o‘rganamiz (Shams surasi)"]],
[['text'=>"Qurʼon o‘qishni o‘rganamiz (Balad surasi)"],['text'=>"Qurʼon o‘qishni o‘rganamiz (Fajr surasi 1-16 oyatlar)"]],
[['text'=>"Qurʼon o‘qishni o‘rganamiz (Fajr surasi 17-30 oyatlar)"],['text'=>"Qurʼon o‘qishni o‘rganamiz (G'oshiya surasi)"]],
[['text'=>"Qurʼon o‘qishni o‘rganamiz (A'laa surasi)"],['text'=>"Qurʼon o‘qishni o‘rganamiz (Toriq surasi)"]],
[['text'=>"Qurʼon o‘qishni o‘rganamiz (Buruj surasi)"],['text'=>"Qurʼon o‘qishni o‘rganamiz (Inshiqoq surasi)"]],
[['text'=>"Qurʼon o‘qishni o‘rganamiz (Mutoffifin surasi 1-21 oyatlar)"],['text'=>"Qurʼon o‘qishni o‘rganamiz (Mutoffifin surasi 22-36 oyatlar)"]],
[['text'=>"Qurʼon o‘qishni o‘rganamiz (Infitor surasi)"],['text'=>"Qurʼon o‘qishni o‘rganamiz (Takvir surasi)"]],
[['text'=>"Qurʼon o‘qishni o‘rganamiz (Abasa surasi 1-23 oyatlar)"],['text'=>"Qurʼon o‘qishni o‘rganamiz (Abasa surasi 24-42 oyatlar)"]],
[['text'=>"Qurʼon o‘qishni o‘rganamiz (Nozi’ot surasi 1-26 oyatlar)"],['text'=>"$nazad"]],
]
]);
$nafs = json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>"Nafsni Poklash 1 dars"],['text'=>"Nafsni Poklash 2 dars"]],
[['text'=>"Nafsni Poklash 3 dars"],['text'=>"Nafsni Poklash 4 dars"]],
[['text'=>"Nafsni Poklash 5 dars"],['text'=>"Nafsni Poklash 6 dars"]],
[['text'=>"Nafsni Poklash 7 dars"],['text'=>"Nafsni Poklash 8 dars"]],
[['text'=>"Nafsni Poklash 9 dars"],['text'=>"Nafsni Poklash 10 dars"]],
[['text'=>"Nafsni Poklash 11 dars"],['text'=>"Nafsni Poklash 12 dars"]],
[['text'=>"Nafsni Poklash 13 dars"],['text'=>"$nazad"]],
]
]);
$Ona = json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>"Hadicha Onamiz"],['text'=>"Oisha Onamiz"]],
[['text'=>"Hafsa Onamiz"],['text'=>"Zaynab binti Jaxsh Onamiz"]],
[['text'=>"Juvayriya Onamiz"],['text'=>"Ummu Habiba Romla bint Abu Sufyon Onamiz"]],
[['text'=>"Ummu Salama Hind binti abi Umayya Onamiz"],['text'=>"Moriya kibtiya Onamiz"]],
[['text'=>"$nazad"],],
]
]);
$tarbiya = json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>"Islomda Farzand Tarbiyasi 1-dars"],['text'=>"Islomda Farzand Tarbiyasi 2-dars"]],
[['text'=>"Islomda Farzand Tarbiyasi 3-dars"],['text'=>"Islomda Farzand Tarbiyasi 4-dars"]],
[['text'=>"Islomda Farzand Tarbiyasi 5-dars"],['text'=>"Islomda Farzand Tarbiyasi 6-dars"]],
[['text'=>"Islomda Farzand Tarbiyasi 7-dars"],['text'=>"Islomda Farzand Tarbiyasi 8-dars"]],
[['text'=>"Islomda Farzand Tarbiyasi 9-dars"],['text'=>"Islomda Farzand Tarbiyasi 10-dars"]],
[['text'=>"Islomda Farzand Tarbiyasi 11-dars"],['text'=>"Islomda Farzand Tarbiyasi 12-dars"]],
[['text'=>"Islomda Farzand Tarbiyasi 13-dars"],['text'=>"Islomda Farzand Tarbiyasi 14-dars"]],
[['text'=>"Islomda Farzand Tarbiyasi 15-dars"],['text'=>"Islomda Farzand Tarbiyasi 16-dars"]],
[['text'=>"Islomda Farzand Tarbiyasi 17-dars"],['text'=>"Islomda Farzand Tarbiyasi 18-dars"]],
[['text'=>"Islomda Farzand Tarbiyasi 19-dars"],['text'=>"Islomda Farzand Tarbiyasi 20-dars"]],
[['text'=>"Islomda Farzand Tarbiyasi 21-dars"],['text'=>"Islomda Farzand Tarbiyasi 22-dars"]],
[['text'=>"$nazad"],],
]
]);
$duo = json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>"Duoim qabul bo‘lsin desangiz"],['text'=>"Tong va kechqurunda"]],
[['text'=>"Juma tongida"],['text'=>"Uxlash uchun to‘shakka yotganda"]],
[['text'=>"Bezovta bo‘lib, uxlay olmaganda"],['text'=>"Uyquda qo‘rqqanda"]],
[['text'=>"Tushida yoqtirmagan narsani ko‘rganda"],['text'=>"Uyqudan uyg‘onganda"]],
[['text'=>"Tahorat qilganda"],['text'=>"Masjidga kirayotganda va undan chiqayotganda"]],
[['text'=>"Azon va iqomatni eshitganda"],['text'=>"Namoz boshlaganda"]],
[['text'=>"Namozdagi ruku’da"],['text'=>"Ruku’dan bosh ko‘targanda va tik turganda"]],
[['text'=>"Sajda paytida"],['text'=>"Vitrdagi qunut duosi"]],
[['text'=>"Tashahhud"],['text'=>"Namoz tugaganda"]],
[['text'=>"Kiyim echilganda"],['text'=>"Uydan chiqayotganda"]],
[['text'=>"Uyga kirayotganda"],['text'=>"Hojatxonaga kirayotganda"]],
[['text'=>"Hojatxonadan chiqayotganda"],['text'=>"Allohning gozal ismlari"]],
[['text'=>"Istixora qilganda"],['text'=>"Qiyinchilik va g‘amginlikda"]],
[['text'=>"Gam yoki tashvish etganida"],['text'=>"Qiyin ahvolga tushib qolganda"]],
[['text'=>"Bir qavmdan qo‘rqqanda"],['text'=>"Sultondan qo‘rqqanda"]],
[['text'=>"Dushmanga yo‘liqqanda"],['text'=>"Bir ish og‘irlik qilganida"]],
[['text'=>"Yashash qiyinlashganda"],['text'=>"Ofatni daf qilishda"]],
[['text'=>"Katta-kichik musibat etganida"],['text'=>"Qarzini tolashga qurbi etmaganida"]],
[['text'=>"Bolalarga panoh tilaganda"],['text'=>"Azolar yiringlaganda va narsa toshganda"]],
[['text'=>"Kasal bo‘lganda"],['text'=>"Bosh ogrigi, isitma va boshqa ogriqlarda"]],
[['text'=>"O‘lim yaqinlashganda"],['text'=>"Kishining yaqini vafot etganida"]],
[['text'=>"Do‘stining o‘limi xabari etganida"],['text'=>"Janoza duosi"]],
[['text'=>"Mayyit olib ketilayotganini ko‘rganda"],['text'=>"Mayyitni qabrga qo‘yayotganda"]],
[['text'=>"Talbiya aytganda"],['text'=>"$nazad"]],
]
]);
$arab= json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>"1dars"],['text'=>"2dars"]],
[['text'=>"3dars"],['text'=>"4dars"]],
[['text'=>"5dars"],['text'=>"6dars"]],
[['text'=>"7dars"],['text'=>"8dars"]],
[['text'=>"9dars"],['text'=>"10dars"]],
[['text'=>"11dars"],['text'=>"12dars"]],
[['text'=>"13dars"],['text'=>"14dars"]],
[['text'=>"15dars"],['text'=>"16dars"]],
[['text'=>"17dars"],['text'=>"18dars"]],
[['text'=>"19dars"],['text'=>"20dars"]],
[['text'=>"21dars"],['text'=>"22dars"]],
[['text'=>"23dars"],['text'=>"24dars"]],
[['text'=>"25dars"],['text'=>"26dars"]],
[['text'=>"27dars"],['text'=>"28dars"]],
[['text'=>"29dars"],['text'=>"$nazad"]],
]
]);
$arab1= json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>"1-dars"],['text'=>"2-dars"]],
[['text'=>"3-dars"],['text'=>"4-dars"]],
[['text'=>"5-dars"],['text'=>"6-dars"]],
[['text'=>"$nazad"],],
]
]);
$paygambar=json_encode([
'resize_keydboard'=>true,
'keyboard'=>[
[['text'=>"Alayhissalomlar kimlar?"],],
[['text'=>"Odam Alayhissalom"],['text'=>"Idris Alayhissalom"]],
[['text'=>"Nuh Alayhissalom"],['text'=>"Hud Alayhissalom"]],
[['text'=>"Solih Alayhissalom"],['text'=>"Ibrohim Alayhissalom"]],
[['text'=>"Ibrohim va Ismoil Alayhissalomlar"],['text'=>"Ibrohim Alayhissalom"]],
[['text'=>"Lut  Isxoq Yaqub Alayhissalomlar"],['text'=>"Yusuf Alayhissalom"]],
[['text'=>"Yaqub Alayhissalom"],['text'=>"Yusuf Alayhissalom"]],
[['text'=>"Shuayb Alayhissalom"],['text'=>"Ayub va  Zulkifl Alayhissalomlar"]],
[['text'=>"Muso Alayhissalom"],['text'=>"Muso va Horun Alayhissalomlar 2-qism"]],
[['text'=>"Muso va Horun Alayhissalomlar 3-qism"],['text'=>"Muso va Horun Alayhissalomlar 4-qism"]],
[['text'=>"Muso va Horun Alayhissalomlar 5-qism"],['text'=>"Muso va Horun Alayhissalomlar 6-qism"]],
[['text'=>"Xorun va Dovud Alayhissalomlar"],['text'=>"Sulaymon Alayhissalom"]],
[['text'=>"Ilyos Al-yasa Yunus Alayhissalomlar"],['text'=>"Zakariyo va Yahyo Alayhissalomlar"]],
[['text'=>"Yahyo Alayhissalom va Maryam binti Imron Alayhissalom"],['text'=>"Iyso Alayhissalom"]],
[['text'=>"Iyso Alayhissalom 2-qism"],['text'=>"$nazad"]],
]
]);
$tajvid = json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>" TAJVID FANIGA KIRISH"],['text'=>"1-DARS"]],
[['text'=>"2-DARS"],['text'=>"3-DARS"]],
[['text'=>"5-DARS"],['text'=>"6-DARS"]],
[['text'=>"7-DARS"],['text'=>"8-DARS"]],
[['text'=>"9-DARS"],['text'=>"10-DARS"]],
[['text'=>"11-DARS"],['text'=>"12-DARS"]],
[['text'=>"13-DARS"],['text'=>"14-DARS"]],
[['text'=>"15-DARS"],['text'=>"$nazad"]],
]
]);
$tajvid1 = json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>" 16-DARS"],['text'=>"17-DARS"]],
[['text'=>"18-DARS"],['text'=>"19-DARS"]],
[['text'=>"20-DARS"],['text'=>"21-DARS"]],
[['text'=>"22-DARS"],['text'=>"23-DARS"]],
[['text'=>"24-DARS"],['text'=>"25-DARS"]],
[['text'=>"26-DARS"],['text'=>"27-DARS"]],
[['text'=>"28-DARS"],['text'=>"29-DARS"]],
[['text'=>"30-DARS"],['text'=>"31-DARS"]],
[['text'=>"$nazad"],],
]
]);
$Bir =json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>"1-Qism"],['text'=>"2-Qism"]],
[['text'=>"3-Qism"],['text'=>"4-Qism"]],
[['text'=>"5-Qism"],['text'=>"6-Qism"]],
[['text'=>"7-Qism"],['text'=>"8-Qism"]],
[['text'=>"9-Qism"],['text'=>"10-Qism"]],
[['text'=>"11-Qism"],['text'=>"12-Qism"]],
[['text'=>"13-Qism"],['text'=>"14-Qism"]],
[['text'=>"15-Qism"],['text'=>"16-Qism"]],
[['text'=>"17-Qism"],['text'=>"18-Qism"]],
[['text'=>"19-Qism"],['text'=>"20-Qism"]],
[['text'=>"21-Qism"],['text'=>"22-Qism"]],
[['text'=>"23-Qism"],['text'=>"24-Qism"]],
[['text'=>"25-Qism"],['text'=>"Rasulullohning Oilasi"]],
[['text'=>"$nazad"],],
]
]);
$sahoba = json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>"Сахобалар фазилати"],['text'=>"Муоз ибн Жабал розияллоҳу анҳу"]],
[['text'=>"Муоз ибн Жабал розияллоҳу анҳу 2"],['text'=>"Абдуллоҳ ибн Масъуд розияллоҳу анҳу"]],
[['text'=>"Абдуллоҳ ибн Масъуд розияллоҳу анҳу 2"],['text'=>"Талха ибн Убайдуллоҳ розияллоҳу анҳу"]],
[['text'=>"Зубайр ибн Аввом розияллоҳу анҳу"],['text'=>"Абдураҳмон ибн Авф розияллоҳу анҳу"]],
[['text'=>"Абдураҳмон ибн Авф розияллоҳу анҳу 2"],['text'=>"Са'д ибн Аби Ваққос розияллоҳу анҳу"]],
[['text'=>"Са'д ибн Аби Ваққос розияллоҳу анҳу 2"],['text'=>"Са'ид ибн Зайид Розияллоҳу анҳу"]],
[['text'=>"Абу Убайда Розияллоҳу анҳу"],['text'=>"Абу Убайда Розияллоҳу анҳу 2"]],
[['text'=>"Зайд ибн Хориса розияллоҳу анҳу"],['text'=>"Суроқа ибн Молик Розияллоҳу анҳу"]],
[['text'=>"$nazad"],],
]
]);
$sahoba1 = json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>"Усома ибн Зайд Розияллоҳу анҳу"],['text'=>"Усома ибн Зайд Розияллоҳу анҳу 2"]],
[['text'=>"Солим розияллоҳу анҳу"],['text'=>"Солим розияллоҳу анҳу 2"]],
[['text'=>"Мусаб ибн умайр Розияллоҳу анҳу"],['text'=>"Мусаб ибн умайр Розияллоҳу анҳу 2"]],
[['text'=>"Хамза розияллоҳу анҳу"],['text'=>"Хузайфа ибн Йамон розияллоҳу анҳу"]],
[['text'=>"Хузайфа ибн Йамон розияллоҳу анҳу 2"],['text'=>"Абу Айюб розияллоҳу анҳу"]],
[['text'=>"Туфайл розияллоҳу анҳу"],['text'=>"Жа'фар ибн Аби Толиб розияллоҳу анҳу"]],
[['text'=>"Жа'фар ибн Аби Толиб розияллоҳу анҳу 2"],['text'=>"Кааб ибн Молик Розияллоҳу анҳу"]],
[['text'=>"Абу Суфён ибн Ҳорис Розияллоҳу анҳу"],['text'=>"Абул Ос ибн Робиа розияллоҳу анҳу"]],
[['text'=>"Абул Ос ибн Робиа розияллоҳу анҳу 2"],['text'=>"Наим ибн Масуд розияллоҳу анҳ"]],
[['text'=>"Абдуллох ибн Саллам розияллоҳу анҳу"],['text'=>"$nazad"]],
]
]);
$namooz = json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>"🏙Farg'ona"],['text'=>"🏙Xiva"],],
 [['text'=>"🏙Toshkent"],['text'=>"🏙Namangan"],],
 [['text'=>"🏙Buxoro"],['text'=>"🏙Guliston"],],
 [['text'=>"🏙Jizzax"],['text'=>"🏙Zarafshon"],],
 [['text'=>"🏙Qarshi"],['text'=>"🏙Navoiy"],],
 [['text'=>"🏙Nukus"],['text'=>"🏙Samarqand"],],
 [['text'=>"🏙Termiz"],['text'=>"🏙Urganch"],],
 [['text'=>"$nazad"],],
]
]);
$siyrat = json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>"Siyrat ilmi va ahamiyati"],['text'=>"Payg‘ambarimizga muhabbat iymondandir"],],
[['text'=>" Siyrat ilmi manbalari, adabiyotlari va siyrat ulamolari"],['text'=>"Siyratni tadqiq va tahqiq qilib o‘rganish ahamiyati"],],
[['text'=>"Payg‘ambarimizning naslu nasablari"],['text'=>"Payg‘ambarimizning tavalludlari"],],
[['text'=>"Payg‘ambarimizning bolalik davrlari"],['text'=>"Payg‘ambarimizning yigitlik davrlari"],],
[['text'=>"Payg‘ambarimizning Xadicha onamizga uylanishlari va Kaʼbaning qayta qurilishi"],['text'=>"Payg‘ambarlik arafasida"],],
[['text'=>"Birinchi vahiyning nozil bo‘lishi"],['text'=>"Nubuvvatdan risolat sari"],],
[['text'=>"Makka davrining 1-bosqichi Fatratul vahiy va maxfiy daʼvat"],['text'=>"Makka davrining 2-bosqichi Islom diniga oshkora daʼvat"],],
[['text'=>"$nazad"],],
]
]);
$siyrat2 = json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>"Payg‘ambarimizga qarshi tashviqot"],['text'=>"Payg‘ambarimizga qarshi qo‘llangan yangi uslublar"],],
[['text'=>"Sahobalar zulm iskanjasida"],['text'=>"Payg‘ambarimizga aziyatlarning boshlanishi"],],
[['text'=>"Sahobalarning Habashistonga ilk hijrati "],['text'=>"Sahobalarning Habashistonga ikkinchi hijrati"],],
[['text'=>"Aziyatlarning kuchayishi va hazrati Hamzaning musilmon bo’lishi"],['text'=>"Hazrati Umarni musulmon bo'lishi"],],
[['text'=>"Quraysh mushriklarining behuda urinishlari"],['text'=>"Qamal davri"],],
[['text'=>"Mahzunlik yili"],['text'=>"Madinalik ilk musulmonlar"],],
[['text'=>"Isro va Me'roj hodisasi"],['text'=>"Isro va Me'roj hodisasiga oid masalalar"],],
[['text'=>"$nazad"],],
]
]);
$hadis = json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>"Niyat"],['text'=>"Ixlos"],],
[['text'=>"Tavba fazilati"],['text'=>"Sabr fazilati"],],
[['text'=>"Rost so'zlash fazilati"],['text'=>"Taqvo"],],
[['text'=>"Tavakkul"],['text'=>"Yahshi amallarga shoshilish"],],
[['text'=>"Umr oxirida yaxshiliklarni ko‘paytirishga targ‘ib"],['text'=>"Yaxshilikning yo'llari ko'p"],],
[['text'=>"$nazad"],],
]
]);
$fiqh = json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>"1-Dars"],['text'=>"2-Dars"],],
[['text'=>"3-Dars"],['text'=>"4-Dars"],],
[['text'=>"5-Dars"],['text'=>"6-Dars"],],
[['text'=>"$nazad"],],
]
]);
$fiqh1 = json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>"Taqiq va Ruhsatlar"],['text'=>"Moliyaviy Muommolar"],],
[['text'=>"Oila va Turmush"],['text'=>"Aqiyda"],],
[['text'=>"Ayollar fiqhi"],['text'=>"Turli masalalar"],],
[['text'=>"$nazad"],],
]
]);
$aqida = json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>"Muqaddima"],['text'=>"Tavhid masalasi"],],
[['text'=>"Alloh taolo qadim va boqiydir"],['text'=>"Alloh taoloning zoti va sifatlari maxluqotlarning zot va sifatlariga muxolifdir"],],
[['text'=>"Alloh Ta’olo doimiy barhayotdir va U zot yaratuvchidir"],['text'=>"Alloh taolo hech qanday mashaqqatsiz Rizq beruvchidir"],],
[['text'=>"Alloh Ta’olo o'ldiruvchi va qayta tiriltiruvchidir"],['text'=>"Аллоҳ таолонинг зотий ва феълий барча сифатлари азалий  ва абадийдир"],],
[['text'=>"Тақдир - қазо қадар нима ўзи?"],['text'=>"Тақдирга тўлиқ розимиз. Муқаддаргачи?"],],
[['text'=>"Аллоҳ ҳоҳлаганини ҳидоят қилиб, ҳоҳлаганини адаштиради буни қандай тушунамиз?"],],
[['text'=>"Пaйғамбарга иймон келтириш"],['text'=>"Қуръон махлуқми ёки махлуқ эмасми ? Шу масалани қандай тушунамиз?"],],
[['text'=>"Аллоҳ таолони дунёда, охиратда, тушда кўриш жоизми?"],['text'=>"Меърож ҳақ ва Ҳавзи кавсар ҳақдир"],],
[['text'=>"Шафоат нима ва у неча тур бўлади? Ал-мийсоқ нима дегани?"],['text'=>"Фаришталар ҳақида ақидангиз қандай?"],],
[['text'=>"$nazad"],],
]
]);
$sura = json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>"📖Fotiha surasi"],],				
[['text'=>"📖Baqara surasi"],['text'=>"📖Imron surasi"],['text'=>"📖Niso surasi"],],
[['text'=>"📖Maida surasi"],['text'=>"📖Anam surasi"],['text'=>"📖Arof surasi"],],
[['text'=>"📖Anfol surasi"],['text'=>"📖Tavba surasi"],['text'=>"📖Yunus surasi"],],
[['text'=>"📖Hud surasi"],['text'=>"📖Yusuf surasi"],['text'=>"📖Rad surasi"],],
[['text'=>"📖Ibrohim surasi"],['text'=>"📖Hijr surasi"],['text'=>"📖Nahl surasi"],],
[['text'=>"📖Isro surasi"],['text'=>"📖Kahf surasi"],['text'=>"📖Maryam surasi"],],
[['text'=>"📖Toha surasi"],['text'=>"📖Anbiyo suarsi"],['text'=>"📖Haj surasi"],],
[['text'=>"📖Muminun surasi"],['text'=>"📖Nur surasi"],['text'=>"📖Furqon surasi"],],
[['text'=>"📖Shuaro surasi"],['text'=>"📖Naml surasi"],['text'=>"📖Qasos surasi"],],
[['text'=>"📖Ankabut surasi"],['text'=>"📖Rum Surasi"],['text'=>"📖Luqmon surasi"],],
[['text'=>"📖Sajda surasi"],['text'=>"📖Ahzob surasi"],['text'=>"📖Saba surasi"],],
[['text'=>"📖Fotir surasi"],['text'=>"📖Yosin surasi"],['text'=>"📖Soffat surasi"],],
[['text'=>"📖Sod surasi"],['text'=>"📖Zumar surasi"],['text'=>"📖Gofir surasi"],],
[['text'=>"📖Fussilat surasi"],['text'=>"📖Shoro surasi"],['text'=>"📖Zuxruf surasi"],],
[['text'=>"📖Zuhan surasi"],['text'=>"📖Jathiya surasi"],['text'=>"📖Ahqaf surasi"],],
[['text'=>"📖Muhammad surasi"],['text'=>"📖Fath surasi"],['text'=>"📖Hujurat surasi"],],
[['text'=>"📖Qof surasi"],['text'=>"📖Zuriyat surasi"],['text'=>"📖Tur surasi"],],
[['text'=>"📖Najim surasi"],['text'=>"📖Qamar surasi"],['text'=>"📖Rohman surasi"],],
[['text'=>"📖Voqiya surasi"],['text'=>"📖Hadid surasi"],['text'=>"??Mujadila surasi"],],
[['text'=>"📖Hashir surasi"],['text'=>"📖Mumtahina surasi"],],
[['text'=>"📖Soff surasi"],['text'=>"📖Juma surasi"],['text'=>"📖Munofiqun surasi"],],
[['text'=>"📖Taghabun surasi"],['text'=>"📖Taloq surasi"],['text'=>"📖Tahrim surasi"],],
[['text'=>"📖Mulk surasi"],['text'=>"📖Qalam surasi"],['text'=>"📖Haqqa surasi"],],
[['text'=>"📖Muorij surasi"],['text'=>"📖Nuh surasi"],['text'=>"📖jinn surasi"],],
[['text'=>"📖Muzzammil surasi"],['text'=>"📖Muddathir surasi"],['text'=>"📖Qiyama surasi"],],
[['text'=>"📖Insan surasi"],['text'=>"📖Mursalat surasi"],['text'=>"📖Naba surasi"],],
[['text'=>"📖Naziat surasi"],['text'=>"📖Abasa surasi"],['text'=>"📖Takawir surasi"],],
[['text'=>"📖Infitar surasi"],['text'=>"📖Mutaffifeen surasi"],['text'=>"📖Inshiqaq surasi"],],
[['text'=>"📖Burooj surasi"],['text'=>"📖Tariq surasi"],['text'=>"📖Ala surasi"],],
[['text'=>"📖Ghashiya surasi"],['text'=>"📖Fajir surasi"],['text'=>"📖Balad surasi"],],
[['text'=>"📖Shams surasi"],['text'=>"📖Lail surasi"],['text'=>"📖Dhuha surasi"],],
[['text'=>"📖Sharh surasi"],['text'=>"📖Teen surasi"],['text'=>"📖falaq surasi"],],
[['text'=>"📖Qadr surasi"],['text'=>"📖Bayyina surasi"],['text'=>"📖Zilzila surasi"],],
[['text'=>"📖Adiyat surasi"],['text'=>"📖Qaria surasi"],['text'=>"📖Takathur surasi"],],
[['text'=>"📖Asr surasi"],['text'=>"📖Hamza surasi"],['text'=>"📖Fil surasi"],],
[['text'=>"📖Quraysh surasi"],['text'=>"📖Moun surasi"],['text'=>"📖Kavsar surasi"],],
[['text'=>"📖Kofirun surasi"],['text'=>"📖Nosr surasi"],['text'=>"📖Masad surasi"],],
[['text'=>"📖Ixlos surasi"],['text'=>"📖Falaq surasi"],['text'=>"📖Nos surasi"],],
[['text'=>"$nazad"],], 
]
]);
$namoz = json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>"🛐Namoz haqida📝"],['text'=>"🛐Namoz o‘qishni o‘rganamiz🤲"],],
[['text'=>"$orqa"],],
]
]);
$namozh = json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>"Namoz Bu.."],['text'=>"Namozning Farzi.."],],
[['text'=>"Namozning Vojiblari.."],],
[['text'=>"Namozning Sunnatlar.."],['text'=>"Namozning Mustahablari.."],],
[['text'=>"Namozni buzuvchi amallar.."],],
[['text'=>"Namozning Makruhlari.."],],
[['text'=>"Namozning mubohlari"],],
[['text'=>"Erkak va ayollar namozining farqlar"],],
[['text'=>"Namozni buzish joiz bo‘lgan o‘rinlar"],],
[['text'=>"$orqa"],],
]
]);
$namozo = json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>"☑️Bomdod namozi☑️"],],
[['text'=>"☑️Peshin namozi☑️"],],
[['text'=>"☑️Asr namozi☑️"],],
[['text'=>"☑️Shom namozi☑️"],],
[['text'=>"☑️Xufton namozi☑️"],],
[['text'=>"☑️Namozdan keyin o‘qiladigan duolar☑️"],],
[['text'=>"☑️Musofirning namozi☑️"],],
[['text'=>"☑️Qazo namozlar☑️"],],
[['text'=>"☑️Juma namozi☑️"],],
[['text'=>"☑️Ikki hayit namozlari☑️"],],
[['text'=>"☑️Janoza namozi☑️"],],
[['text'=>"$orqa"],],
]
]);
$tafsir= json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>"Tafsiri hilol kirish"],['text'=>"Tafsiri hilol kirish 2"],],
[['text'=>"Tafsiri hilol o'quvchilariga"],['text'=>"Qur'onning tarqoq tushishi"],],
[['text'=>"Movarounahrda tafsir va mufassirlar"],['text'=>"Qur'onning mo'jizasi"],],
[['text'=>"Qur'onning insonlarni ojiz qoldirishi"],['text'=>"Muqaddima"],],
[['text'=>"Qur'onni qandoq o'qiymiz"],['text'=>"Qur'onning jamlanishi"],['text'=>"Qur'on tushishini boshlanishi"],],
[['text'=>"Mulk"],['text'=>"Qalam"],['text'=>"Haqqa"],],
[['text'=>"Maorij"],['text'=>"Nuh"],['text'=>"Jinn"],],
[['text'=>"Muzzammil"],['text'=>"Muddassir"],['text'=>"Qiyomat"],],
[['text'=>"Inson"],['text'=>"Mursalot"],['text'=>"Naba"],],
[['text'=>"Naziat"],['text'=>"Abasa"],['text'=>"Takvir"],],
[['text'=>"Infitor"],['text'=>"Mutaffifun"],['text'=>"Inshiqoq"],],
[['text'=>"Buruj"],['text'=>"Toriq"],['text'=>"Alaa"],],
[['text'=>"G'oshiya"],['text'=>"Fajir"],['text'=>"Balad"],],
[['text'=>"Shams"],['text'=>"Lail"],['text'=>"Zuho"],],
[['text'=>"Sharh"],['text'=>"Tiyn"],['text'=>"Alaq"],],
[['text'=>"Qadr"],['text'=>"Bayyina"],['text'=>"Zalzala"],],
[['text'=>"Adiyat"],['text'=>"Qoria"],['text'=>"Takaasur"],],
[['text'=>"Asr"],['text'=>"Humaza"],['text'=>"Fil"],],
[['text'=>"Quraysh"],['text'=>"Moun"],['text'=>"Kavsar"],],
[['text'=>"Kofirun"],['text'=>"Nosr"],['text'=>"Masad"],],
[['text'=>"Ixlos"],['text'=>"Falaq"],['text'=>"Nas"],],
[['text'=>"$nazad"],],
]
]);
$gunoh= json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>"Shirk"],['text'=>"Riyo"],],
[['text'=>"Kibr"],['text'=>"Z'oravonlik"],],
[['text'=>"Makr va Aldov"],['text'=>"Musibat paytida haddan oshish"],],
[['text'=>"Allohning makr sinovidan hotirjam bolish"],['text'=>"Allohning rahmatidan noumid bolish"],],
[['text'=>"Dunyo uchun ilm organish"],['text'=>"Taqdirni rad etish"],],
[['text'=>"Hiyonat va ahdga vafo qilmaslik"],['text'=>"Siydikdan poklanmaslik"],],
[['text'=>"Namozni qasddan tark etish"],['text'=>"Erkaklarning tilla va ipak kiyishi"],],
[['text'=>"Ayollaring erkaklarga erkalarning ayollarga o'xshashi"],['text'=>"Zakot bermaslik"],],
[['text'=>"Minnat qilishlik"],['text'=>"Suvni qizg'anish"],],
[['text'=>"Allohdan o'zgaga atab jonliq so'yishlik"],['text'=>"Sudxo'rlik"],],
[['text'=>"Tarozidan urib qolish"],['text'=>"Qo'shniga ozor berish"],],
[['text'=>"Chaqimchilik"],['text'=>"Tahlil qilish"],],
[['text'=>"Ota onaga oq bolish"],['text'=>"Pokiza ayollarga tuxmat qilish"],],
[['text'=>"Lanat aytish"],['text'=>"Odam oldirish"],],
[['text'=>"Folbin va munajjimning gapini tastiqlash"],['text'=>"Zino"],],
[['text'=>"Bachavozlik"],['text'=>"O'girlik"],],
[['text'=>"Aroq ichish"],['text'=>"Yolg'on qasam ichish"],],
[['text'=>"Poraxo'rlik"],['text'=>"Yolg'on gapirish"],],
[['text'=>"Qimor o'ynash"],['text'=>"$nazad"],],
]
]);
$otmen = json_encode([
'resize_keyboard'=>true,
'keyboard'=>[
[['text'=>"$otdex"],],
]
]);
if(mb_stripos($blocklar,"$user_id")!==false){
bot('sendMessage', [
'chat_id'=>$chat_id,
'parse_mode'=>"html",
'text'=>"<b>??Salom <a href='tg:user?id=$cid'>$name</a>!\nSiz ⛔️ Botimizdan foydalana olmaysiz, chunki botda bloklangansiz!!! Blokdan chiqish uchun ADMIN ga yozing! Blokdan chiqmaguncha bot siz uchun ishlamaydi!!!🚫!</b> " ,
'reply_markup'=>json_encode([
'inline_keyboard'=>[
[['text'=>"Admin👨‍💻", "url"=>"https://t.me/Payme_Tv"]],
]
])
]);return false;}


$DaMaS_BaSS = json_decode(file_get_contents('php://input'));
$AdvakatUz = $DaMaS_BaSS->message;
$cid = $AdvakatUz->chat->id;
$text=$AdvakatUz->text;
$type = $AdvakatUz->chat->type;
$reply = $AdvakatUz->reply_to_message->text;
$rpl = json_encode([
            'resize_keyboard'=>false,
            'force_reply'=>true,
            'selective'=>true
        ]);
 if($type=="private"){
if($text == "🚫Bandan Olish✅" and $cid==$admin){
bot('sendmessage', [
      'chat_id' =>$cid,
       'text' => "🚫Blockdan Olinadigan 🆔️ni Yozing!" ,
       'parse_mode'=>'markdown',  
       'reply_markup' => $rpl,
       ]);
       }}
       if($reply == "🚫Blockdan Olinadigan 🆔️ni Yozing!"){  
$fayl = file_get_contents("block.db");
$fayl2 = "$text";
$fayl3 = str_replace($fayl2,"",$fayl);
file_put_contents("block.db","$fayl3");
$fayl = file_get_contents("block.db");
bot('sendmessage', [
      'chat_id' =>$cid,
       'text' => "[$text](tg://user?id=$text)  Bandan olindi" ,
       'parse_mode'=>'markdown', 
'reply_markup'=>$panel,
      ]); 
      bot('sendmessage', [
      'chat_id' =>$sd,
       'text' => "*Salom*  [$name](tg://user?id=$uid)  Sizga Xush Xabar Bor!
Siz [Adminimiz](tg://user?id=$admin) Tomonidan Bandan Olindingiz!
Endi Botni Ishlatishingiz mumkin!
Qayta /start Bosing!" ,
       'parse_mode'=>'markdown', 
       ]);
}



$update = json_decode(file_get_contents('php://input'));
$message = $update->message;
$cid = $message->chat->id;
$bass = $message->text;
$uid = $message->from->id;
$reply = $message->reply_to_message->text;

$replymenu = json_encode([
            'resize_keyboard'=>false,
            'force_reply'=>true,
            'selective'=>true
        ]);

$blocks=file_get_contents("block.db");
if(mb_stripos($blocks,"$uid")!==false){
bot('sendMessage', [
'chat_id'=>$cid,
'parse_mode'=>"html",
'text'=>"<b>🖐Salom <a href='tg:user?id=$cid'>$name</a> \nSiz ⛔️ Botimizdan foydalana olmaysiz, chunki Bot sizni bloklangan!!!\nBlokdan chiqish uchun ADMIN ga yozing! Blokdan chiqmaguncha bot siz uchun ishlamaydi!!!🚫!</b> " ,
'reply_markup'=>json_encode([
'inline_keyboard'=>[
[['text'=>"Admin👨‍💻", "url"=>"https://t.me/vipshakh "]],
]
])
]);return false;}

if($bass=="🚫Ban🚫"){
if($cid==$admin){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Ban Qilinadigan 🆔️ni Yuboring!",
'reply_markup'=>$replymenu,
]);
}
}
if($reply=="Ban Qilinadigan 🆔️ni Yuboring!"){
file_put_contents("block.db","$blocks\n$bass");
bot('SendMessage',[
   'chat_id'=>$admin,
        'text'=>"✅[$bass](tg://user?id=$bass) *Banlandi!*", 
        'parse_mode'=>'markdown', 
'reply_markup'=>$panel,
        ]);//kodni manba bn ol inson bolsen
        bot('SendMessage',[
   'chat_id'=>$bass,
        'text'=>"<b>🚫😡Sizni ⛔bu botda bloklashdi🚫. Endi botimizdan foydalana olmaysiz!</b>", 
        'parse_mode'=>'html', 
        'reply_markup'=>json_encode([
'remove_keyboard'=>true,
]),
]);
}


if($text == "🗳Bot Kodi🗳"){
if($cid == $admin){
bot('senddocument',[
'chat_id'=>$cid,
'document'=>new CURLfile(__FILE__),
]);
}
}

if(mb_stripos($text,"/start")!==false){
bot('sendPhoto',[
'chat_id'=>$cid,
'photo'=>"https://t.me/ozga_dunyoo/16",
'caption'=>"👋Assalomu aleykum <a href='tg://user?id=$uid'>$name</a> Botimizga xush kelibsiz. Bu bot orqali o'zingizga kerakli bo'lgan ilmlarni o'rganib olishingiz mumkin . Botimiz Orqali ozingizga kerakli bilimlarni topa olganlar bo'lsangiz Allohning sizga bergan Ne'mati deb biling!
 Bizning botimizni dostlaringizga ham ulashing!!!

<a href='t.me/shahidlarbobo'>Shahidlar Bobo</a>
Marhamat kerakli  bo‘limni tanlang.",
'reply_markup'=>$menu,
'parse_mode'=>'html',
]);
bot('sendmessage',[
'chat_id'=>$admin,
'text'=>"Diqqat <a href = 'tg://user?id=$cid'>$cid</a> Botga🤖 /start Bosdi!
<b>🔔 Usernamesi:</b> @$user1
<b>🆔️ Raqami:</b> <code>$cid</code>",
'parse_mode'=>'html',
]);
}

if($text == "Bosh menyu"){
bot('sendPhoto',[
'chat_id'=>$cid,
'photo'=>"https://t.me/ozga_dunyoo/16",
'caption'=>"👋Assalomu aleykum <a href='tg://user?id=$uid'>$name</a> Botimizga xush kelibsiz. Bu bot orqali o'zingizga kerakli bo'lgan ilmlarni o'rganib olishingiz mumkin . Botimiz Orqali ozingizga kerakli bilimlarni topa olganlar bo'lsangiz Allohning sizga bergan Ne'mati deb biling!
Bizning botimizni dostlaringizga ham ulashing!!!

<a href='t.me/shahidlarbobo'>Shahidlar Bobo</a>
Marhamat kerakli  bo‘limni tanlang.",
'reply_markup'=>$menu,
'parse_mode'=>'html',
]);
bot('sendmessage',[
'chat_id'=>$admin,
'text'=>"Diqqat <a href = 'tg://user?id=$cid'>$cid</a> Botga🤖 /start Bosdi!
<b>🔔 Usernamesi:</b> @$user1
<b>🆔️ Raqami:</b> <code>$cid</code>",
'parse_mode'=>'html',
]);
}


if($text == "Keyingi bo‘lim"){
bot('sendMessage', [
'chat_id'=>$cid,
'text'=>"Keyingi bo‘limda audiolar mavjud!",
'reply_markup'=>$key1,
]);
}


if($text == "/panel"){
if($cid == $admin){
bot('sendMessage', [
'chat_id'=>$admin,
'text'=>"✔ Salom Admin! 
O'zingizga kerakli bo'limni tanlang!",
'reply_markup'=>$panel,
]);
}else{
bot("sendmessage",[
'chat_id'=>$cid,
'text'=> "*Panel Menusi faqat Admin uchun Ochiladi!*",
'parse_mode'=>'Markdown',
]);
}
}
if($text == "❇Userga Xabar❇"){
if($cid == $admin){
bot('sendMessage', [
'chat_id'=>$admin,
'text'=>"✔ Userga Xabar yuborish uchun
/sms 🆔️ Xabar 
shu tarzda yuboring!

Admin: @$userR",
'reply_markup'=>$panel,
]);
}else{
bot("sendmessage",[
'chat_id'=>$cid,
'text'=> "*🤪😂 Bu funksiyani Faqat men @$userR ishlata olaman.*",
'parse_mode'=>'Markdown',
]);
}
}
if(mb_stripos($text,"/sms") !== false){
if($cid == $admin){
$ex = explode(" ",$text);
$sms = str_replace("/sms $ex[1]","",$text);
$ismi = $message->from->first_name;

if(mb_stripos($ex[1],"@") !== false){
$ssl = str_replace("@","",$ex[1]);
$egasi = "t.me/$ssl";
}else{
$egasi = "tg://user?id=$ex[1]";
$eegasi = "$ex[1]";
}
bot('sendmessage',[
'chat_id'=>$ex[1],
'text'=>"📨 Admindan Yangi Habar

👤 [$ismi](tg://user?id=$uid)

💌Habar: $sms

📆 $vaqt 🔸  🕰 $time",
'parse_mode'=>"markdown", 
]);
bot('sendmessage',[
'chat_id'=>$admin,
'text'=>"👤[Foydalanuvchi]($egasi)ga Habaringiz Yuborildi📩",
'parse_mode'=>"markdown", 
]);
}else{
bot("sendmessage",[
'chat_id'=>$cid,
'text'=> "*🤪😂 Bu funksiyani Faqat men @$userR ishlata olaman.*",
'parse_mode'=>'Markdown',
]);
}
}
$lichka=file_get_contents("sirojiddin.db");
if($type=="private"){
if(strpos($lichka,"$cid") !==false){
}else{
file_put_contents("sirojiddin.db","$lichka\n$cid");
}
}
if($text == "📊Statistika"){
if($cid == $admin){
$lichka=file_get_contents("sirojiddin.db");
$lich=substr_count($lichka,"\n");
$time=date('H:i:s',strtotime('4 hour'));
$sana=date("d-F, Y-\y\i\l",strtotime("4 hour"));
$haf = date('N',strtotime('4 hour'));
$haft="1Dushanba1 2Seshanba2 3Chorshanba3 4Payshanba4 5Juma5 6Shanba6 7Yakshanba7";
$ex=explode("$haf",$haft);
$hafta="$ex[1]";
$okun=date("n");
$oynoms = "1Yanvar1 2Fevral2 3Mart3 4Aprel4 5May5 6Iyun6 7Iyul7 8Avgust8 9Sentabr9 10Oktabr10 11Noyabr11 12Dekabr12";
$ex2 = explode("$okun",$oynoms);
$oy = "$ex2[1]";
$oynomi = date('F', strtotime('4 hour'));
$sana2 = date('z', strtotime('4 hour'));
$anb8 = file_get_contents("https://obhavo.uz/tashkent"); $ex1=explode("n",$anb8);

$obh = file_get_contents('https://fa.weather.town/uz/forecast/uzbekistan/surxondaryo-viloyati/tirmiz/');

$ex = explode('title="Havo harorati"',$obh);

$exi = explode('right-container',$ex[1]);

$ubk = str_replace($exi[1],' ',$ex[1]);

$ubk1 = str_replace('dir="ltr">',' ',$ubk);

$ubk2 = str_replace('<div class="informer-main-page__container fleft right-container',' ',$ubk1);

$ubk3 = str_replace('&deg;C</div>',' ',$ubk2);

$ubk4 = str_replace('</div>',' ',$ubk3);

$obhavo = trim("$ubk4");
$buoy = date('t', strtotime('4 hour'));
$kun1 = date('z ',strtotime('4 hour')); 
  $a = 360;
  $c2 = $a-$kun1;
  $d = date('L ',strtotime('4 hour'));
  $b = $c2+$d;
  $f = $b+81;
  $e = $b+240;
  $kun2 = date('H ',strtotime('4 hour')); 
  $a2 = 23;
  $b2 = $a2-$kun2;
  $kun3 = date('i ',strtotime('4 hour')); 
  $a3 = 59;
  $b3 = $a3-$kun3;
  $kun4 = date('s ',strtotime('4 hour')); 
  $a4 = 60;
  $b4 = $a4-$kun4;
bot('sendmessage',[
'chat_id'=>$cid,
    'text'=> "<b>Bot statatistikasi:</b>    
├▶A'zolar: <b>$lich</b>
├▶Kanalimiz: <b>@</b>
└▶Admin: <b>@</b>

🔷️➰⏰Soat: $time ⏰, 
🔷️➰📅Sana: $sana 📅,
🔷️➰📆Hafta kuni: $hafta,
🔷️➰📅Oy Nomi: $oy ,
🔷️➰🔲Yilning: $sana2 kuni!🔲,
🔷️➰⛅Havo harorati: $obhavo C° ⛅,
🔷️➰🌐Bu oy $buoy kundan iborart!🌐,
🔷️➰❄Yangi yilga 📅$b kun, ☃️$b2 soat⏰, 🎅 $b3 minut, 🎁 $b4 sekund qoldi!,
🔷️➰🌚Ertangi kunga:⏰ $b2 -Soat⏰,🌹$b3 -Minut🥀, ➰ $b4 sekund qoldi!🌐",
'parse_mode' => 'html',
]);
}
}
$xabar = file_get_contents("send.txt");
if($text == "📄Xabar Jo'natish"){
if($cid == $admin){
bot('sendmessage',[
'chat_id'=>$admin,
'text'=>"*Userlarga yuboriladigan xabar matnini kiriting! Bekor qilish uchun /cancel ni bosing.*",
'parse_mode'=>"markdown",
]); file_put_contents("send.txt","user");
}else{
bot("sendmessage",[
'chat_id'=>$cid,
'text'=> "*🤪😂 Bu funksiyani Faqat men @$userR ishlata olaman.*",
'parse_mode'=>'Markdown',
]);
}
}
if($xabar=="user" and $cid==$admin){
if($text=="/cancel"){
bot('sendmessage',[
'chat_id'=>$admin,
'text'=>"Bekor qilindi!",
'parse_mode'=>"html",
]); unlink("send.txt");
}else{
$lich = file_get_contents("sirojiddin.db");
$lichka = explode("\n",$lich);
foreach($lichka as $lichkalar){
$okuser=bot("sendmessage",[
'chat_id'=>$lichkalar,
'text'=>$text,
'parse_mode'=>'Markdown'
]);
}
}
}
if($okuser){
bot("sendmessage",[
'chat_id'=>$admin,
'text'=>"Hamma userlarga yuborildi!",
'parse_mode'=>'html',
]); unlink("send.txt");
}

if($text =="📙Shayx Muhammad Sodiq Muhammad Yusuf xazratlarining audio kitoblari🎧"){
	bot('sendMessage',[
    'chat_id'=>$cid,
    'text'=>"<b> 📙Shayx Muhammad Sodiq Muhammad Yusuf xazratlarining audio kitoblari🎧 </b> <i> bo'limiga Xush kelibsiz Marhamat o'zingizga kerakli bo'limni tanlang</i>",
      'parse_mode'=>"html",
    'reply_markup'=>$key1,
]);
}
if($text == "Asosiy Bo'lim 🕌"){
    bot('sendMessage',[
    'chat_id'=>$cid,
    'text'=>"<b> Asosiy Bo'limga 💫 </b> <i> ga Xush kelibsiz Marhamat o'zingizga kerakli bo'limni tanlang </i>",
      'parse_mode'=>"html",
    'reply_markup'=>$key,
]);
}
if ($text == "↩Orqaga↩"  or  $text  ==  "🔝ORQAGA🔚"  or $text  ==  "🔚ORQAGA🔝 " ) {
bot('sendMessage', [
'chat_id'=>$cid,
'text'=>"Orqaga  qaytdingiz.
Marhamat kerakli  bo‘limni tanlang.",
'reply_markup'=>$key,
]);
}
if($text == "Manbalar 📚"){
    bot('sendMessage',[
    'chat_id'=>$cid,
    'text'=>"<b> Assalomu Aleykum Va Rahmatullohi Va Barakatuh</b> <i> Xush kelibsiz Bu Botimiz Barcha insonlarga Ilm ulashadi degan umiddamiz  Botimiz Orqali qanchadir miqdorda bolsaham ilmga erishsangiz Allohning sizga bergan nemati deb biling    Bu yerdagi barcha manbalar Ishonchli!!!!!     Biz foydalanilgan manbalar  quyidagilar

https://www.youtube.com/channel/UCLbdL0ibb4zqlqe7LRNOSNQ

https://www.youtube.com/c/Rivoyatlar

https://www.youtube.com/c/islomuz

https://www.youtube.com/c/ArabiyKanal

https://www.youtube.com/ilmnuriofficial

https://t.me/bintusodiq

https://t.me/islomuz

Barchangizga Omad Salomat boling!</i>",
      'parse_mode'=>"html",
    'reply_markup'=>$menu,
]);
}
if($text == "☪Duo va zikrlar"){
    bot('sendMessage',[
    'chat_id'=>$cid,
        'text'=>"<b> ☪Duo va zikrlar </b> <i> boʻlimiga xush kelibsiz </i>",
    'parse_mode'=>"html",
    'reply_markup'=>$duo,
]);
}
if($text == "Duoim qabul bo‘lsin desangiz"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Jaziriy o‘z asarlarida duolar qabul bo‘lishining quyidagi shartlarini zikr qilganlar:

1. Eydigan, ichadigan, kiyadigan narsalari va yashaydigan erlari haromdan bo‘lmasligi lozim.

2. Duo paytida ixlosli bo‘lishi zarur.

3. Musulmonlarga qarshi bo‘lmasligi kerak.

4. Kiyimlari g‘oyat toza bo‘lishi darkor.

5. Tahoratli bo‘lishi lozim.

6. Qiblaga yuzlangan holda duo qilishi zarur.

7. Tiz cho‘kib o‘tirgan holda duo qilsin.

8. Avval nafl namozi o‘qimog‘i darkor.

9. Xayr-ehsonlar qilishi kerak.

10. Kambag‘allar va ilm toliblarini xursand qilsin.

11. Duoni Alloh taologa hamd-sanolar bilan boshlamog‘i lozim.

12. Payg‘ambarimizga, barcha nabiylarga, ashobi kiromga salovot-durudlar aytmog‘i zarur.

13. Eng afzal salovot-namozdagi «Allohumma solli», «Allohumma barik»ni qancha ko‘p o‘qisa, duosi shuncha tez qabul bo‘ladi.

14. Qo‘llarini ko‘ksi barobar ko‘tarib, hovuchlarini ochib, kaftlarini birlashtirib duo qilmog‘i darkor.

15. Duo odobiga rioya qilmog‘i kerak.

16. Alloh taologa xushu’ va xuzu’ bilan yolbormog‘i lozim.

17. Alloh taoloning go‘zal ismlari (Asmai husna)ni o‘hib, tilagini tilamog‘i zarur.

18. Hafif (muloyim) ovoz bilan Alloh taologa yolbormog‘i kerak.

19. Gunohlarini e’tirof etib, Allohdan afv va mag‘firat so‘rashi darkor.

20. Payg‘ambarlardan vorid bo‘lgan sahih duolarni o‘qimog‘i lozim.

21. Duolarni takror-takror aytmog‘i zarur.

22. Tilagini qalb huzuri bilan so‘rasin.

23. Duosini hamdu-sano va salovotu durudlar bilan yakunlamog‘i kerak.

24. Qo‘llarini duodan so‘ng yuziga surtsin.

25. Va duosi qabul bo‘lishini umid qilmog‘i darkor. Shuni unutmaslik kerakki, Payg‘ambarimiz sollallohu alayhi vasallam duoda dunyo va oxirat saodatini tilamoqni tavsiya etganlar.",
'parse_mode'=>'html',
]);
}
if($text == "Tong va kechqurunda"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Abu Hurayra roziyallohu anhudan rivoyat qilinadi:
Rasululloh sollallohu alayhi vasallam: «Kim ertalab yoki kechqurun:

سُبْحَانَ اللهِ وَبِحَمْدِهِ

«Subhanallohi va bihamdihi», (Allohga hamd aytish bilan Uni aybu nuqsonlardan poklab yod etaman), deb yuz marta aytsa, qiyomat kuni biror kishi undan afzal bo‘lmaydi. Faqat ana shu kishi aytganidek yoki undan oshirib aytsagina, bo‘lishi mumkin», dedilar. 
Imom Muslim rivoyatlari.
Abu Dovudning rivoyatlarida:

سُبْحَانَ اللهِ العَظِيمِ وَبِحَمْدِهِ
«Subhanallohil ’aziym va bihamdihi», deb kelgan.
Rasululloh sollallohu alayhi vasallam qizlarining biridan rivoyat qilinadi. U zot qizlariga tong otganida:

سُبْحَانَ اللهِ وَبِحَمْدِهِ لاَ قُوَّةَ إِلاَّ بِاللهِ مَا شَاءَ اللهُ كَانَ وَمَا لَمْ يَشَأْ لَمْ يَكُنْ، أَعْلَمُ أَنَّ اللهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، وَأَنَّ اللهَ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا

«Subhanallohi va bihamdihi, la quvvata illa billahi masha`allohu kana va ma lam yasha` lam yakun. A’lamu annalloha ’ala kulli shay`in qodiyr. Va annalloha qod ahato bikulli shay`in ’ilma», deb aytishni o‘rgatar edilar. Chunki bu kalimalarni tong otganida aytgan kishi kech kirgunicha muhofaza qilinadi. Kech kirganida aytsa, tong otgunicha muhofaza etiladi.
(Ma’nosi: Allohga hamd aytish bilan Uni poklab yod etaman. Allohdan boshqada quvvat yo‘q. Alloh xohlagan narsa bo‘ladi. Xohlamagan narsa bo‘lmaydi. Bilamanki, Alloh har bir narsaga qodirdir. Va, albatta, Alloh har bir narsani ilmi bilan ihota qilgandir.) 
Abu Dovud rivoyatlari.",
'parse_mode'=>'html',
]);
}
if($text == "Juma tongida"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>" Anas roziyallohu anhudan rivoyat qilinadi:
Rasululloh sollallohu alayhi vasallam: «Kim juma kuni bomdod namozidan oldin:

أسْتَغْفِرُ اللهَ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ القَيُّومُ وَأَتُوبُ إِلَيْهِ 

«Astag‘firullohallaziy la ilaha illa huval hayyul qoyyum va atubu ilayh», deb uch marta aytsa, Alloh taolo uning gunohlarini dengiz ko‘pigicha bo‘lsa ham, kechirib yuboradi», dedilar.
(Ma’nosi: Hay va qayyum sifatli Zotdan boshqa iloh yo‘q va Unga istig‘for aytaman, Unga tavba qilaman.)
Ibn Sunniy rivoyatlari.",
'parse_mode'=>'html',
]);
}
if($text == "Uxlash uchun to‘shakka yotganda"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Abu Hurayra roziyallohu anhudan rivoyat qilinadi:
Rasululloh sollallohu alayhi vasallam: 
«Kishi to‘shakka yotayotganida ko‘rpa va izorini qoqib tashlasin. Chunki uning orasida nima borligini bilmaydi. So‘ng: 

بِاسْمِكَ رَبِّي وَضَعْتُ جَنْبِي وَبِكَ أَرْفَعُهُ إِنْ أَمْسَكْتَ نَفْسِي فَارْحَمْهَا وَإِنْ أرْسَلْتَهَا فَاحْفَظْهَا بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِينَ

«Bismika robbiy vazo’tu jambiy va bika arfa’uhu, in amsakta nafsiy farhamha va in arsaltaha fahfazha bima tahfazu bihi ’ibadakas solihiyn», deb aytsin», dedilar.
(Ma’nosi: Ey Rabbim, Sening isming bilan yotdim va Sening isming bilan turaman. Agar mening ruhimni olsang, unga rahm qil. Agar uni qo‘yib yuborsang, xuddi solih bandalaringni saqlaganingdek, uni ham hifzu himoyangga ol.)
Imom Buxoriy va Muslim rivoyatlari.

* Oisha roziyallohu anho aytadilar:
«Rasululloh sollallohu alayhi vasallam to‘shaklariga yotsalar, qo‘llariga suflab, ikkita «Qul a’uzu»ni o‘qir, so‘ng tanalariga surtar edilar».
Imom Buxoriy va Muslim rivoyatlari.",
'parse_mode'=>'html',
]);
}
if($text == "Bezovta bo‘lib, uxlay olmaganda"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Zayd ibn Sobit roziyallohu anhu aytadilar:
«Rasululloh sollallohu alayhi vasallamga uyqusizlikdan shikoyat qildim, u zot: 

اللهُمَّ غَارَتِ النُّجُومُ وَهَدَأَتِ العُيُونُ وَأَنْتَ حَيٌّ قَيُّوم لاَ تَأْخُذُكَ سِنَةٌ وَلاَ نَومٌ يَا حَيُّ يَا قَيُّومُ أهْدِي لَيْلِي وَأنِمْ عَيْنِي

«Allohumma g‘orotin nujumu va hada`atil ’uyunu va anta hayyun qoyyum, la ta`xuzuka sinatun va la navm, ya hayyu, ya qoyyumu, ahdiy layliy va anim ’ayniy, deb ayt», dedilar. Shu duoni aytgan edim, Alloh mendan uyqusizlikni ketkazdi». 
(Ma’nosi: Allohim, yulduzlar botdi, ko‘zlar tindi. Sen tirik, qoimdirsan. Seni mudroq ham, uyqu ham olmaydi. Ey Hay va Qayyum sifatli Zot, kechamni tinch qilib, ko‘zimga uyqu ber.) Ibn Sunniy rivoyatlari.",
'parse_mode'=>'html',
]);
}
if($text == "Tushida yoqtirmagan narsani ko‘rganda"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Ibn Sunniyning rivoyatlarida Abu Hurayra roziyallohu anhu bunday deganlar:
«Agar birortangiz o‘zi yoqtirmagan tush ko‘rsa, uch marta tuflab: 

إِنِّي أعُوذُ بِكَ مِنْ عَمَلِ الشَّيْطَانِ وَسَيِّئَاتِ الأَحْلاَمِ

«Inniy a’uzu bika min ’amalish shaytoni va sayyiatil ahlami», desa, unga hech narsa bo‘lmaydi». 
(Ma’nosi: Men shaytonning amalidan va bulg‘angan tushdan Sening isming ila panoh tilayman.",
'parse_mode'=>'html',
]);
}
if($text == "Uyqudan uyg‘onganda"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Huzayfa ibn Yamon roziyallohu anhu va Abu Zarr roziyallohu anhudan rivoyat qilinadi.
Rasululloh sollallohu alayhi vasallam to‘shaklariga yotsalar, 

بِاسْمِكَ اللهمَّ أَحْيَا وَأَمُوتُ

«Bismikallohumma ahya va amutu», deb aytganlar. 
(Ma’nosi: Ey Rabbim, Sening isming bilan tirilaman va o‘laman.)
Uyg‘onganlarida: 

الْحَمْدُ للهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ

«Alhamdu lillahillaziy ahyana ba’da ma amatana va ilayhin nushur», deb aytar edilar. (Ma’nosi: Bizni o‘ldirgandan keyin tiriltirgan Allohga hamd bo‘lsin. Va biz Ungagina qaytamiz.) Imom Buxoriy rivoyatlari.",
'parse_mode'=>'html',
]);
}
if($text == "Tahorat qilganda"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Umar ibn Xattob roziyallohu anhudan rivoyat qilinadi:
Rasululloh sollallohu alayhi vasallam: «Kim tahorat qilib bo‘lib:

أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ الله وَحْدَهُ لاَ شَرِيكَ لَهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ

«Ashhadu anla ilaha illallohu vahdahu la shariyka lahu va ashhadu anna Muhammadan ’abduhu va rosuluhu», desa, unga jannatning sakkizta eshigi ochilib, xohlaganidan kiraveradi», dedilar.
Imom Muslim rivoyatlari.",
'parse_mode'=>'html',
]);
}
if($text == "Masjidga kirayotganda va undan chiqayotganda"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Ibn Abbos roziyallohu anhudan rivoyat qilinadi:
U zot xolalari Maymuna roziyallohu anhuning uylarida tunab qolganlarida, Rasululloh sollallohu alayhi vasallamning quyidagi ishlariga guvoh bo‘lganini aytadilar:
«Nabiy sollallohu alayhi vasallam muazzinning bomdodga aytgan azonini eshitdilar, so‘ng namozga ketaturib, quyidagi duoni o‘qidilar:

اللهُمَّ اجْعِلْ فِي قَلْبِي نُورًا وَفِي لِسَانِي نُورًا وَاجْعَلْ فِي سَمْعِي نُورًا وَاجْعَلْ فِي بَصَرِي نُورًا وَاجْعَلْ مِنْ خَلْفِي نُورًا وَمِنْ أَمَامِي نُورًا وَاجْعَلْ مِنْ فَوقِي نُورًا وَمِنْ تَحْتِي نُورًا، اللهُمَّ اعْطِنِي نُورًا

«Allohummaj’al fiy qolbiy nuron va fiy lisaniy nuron vaj’al fiy sam’iy nuron vaj’al fiy basoriy nuron vaj’al min xolfiy nuron va min amamiy nuron vaj’al min favqiy nuron va min tahtiy nuron, Allohumma’tiniy nuro».
(Ma’nosi: Ey Rabbim, qalbimda nur qil, tilimda nur qil, qulog‘imda nur qil, ko‘zimda nur qil, orqamdan nur qil, oldimdan nur qil, ustimdan nur qil, ostimdan nur qil, ey Rabbim, menga nur ato et). 
Imom Muslim rivoyatlari.",
'parse_mode'=>'html',
]);
}
if($text == "Azon va iqomatni eshitganda"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Abu Said Xudriy roziyallohu anhudan rivoyat qilinadi:
Rasululloh sollallohu alayhi vasallam:
«Azonni eshitganinglarda muazzin nima desa, o‘shani aytinglar», dedilar.
Imom Buxoriy va Muslim rivoyatlari.

Azonning hammasini eshitib bo‘lganidan keyin Rasulullohga salovot aytib, ortidan mana bu duoni o‘qiydi:
Jobir roziyallohu anhudan rivoyat qilinadi:
Rasululloh sollallohu alayhi vasallam: Kim azonni eshitgan paytida – 

اللهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ وَالصَّلاَةِ القَائِمَةِ آتِ مُحَمَّدًا الوَسِيلَةَ وَالفَضِيلَةَ وَابْعَثْهُ مَقَامًا مُحْمُودًا الَّذِي وَعَدْتَهُ

«Allohumma robba hazihid da’vatit tammah vassolatil qoimah, ati Muhammadanil vasiylata val faziylah vab’ashu maqomam mahmudanillaziy va’adtah», deb aytsa, Qiyomat kuni unga shafoat bo‘ladi”, dedilar.
(Ma’nosi: Ey bu komil duoning va qoim bo‘lgan namozning egasi - Allohim, Muhammadga vasila va fazilat ber, u zotni va’da qilganing maqtovli maqomda tiriltir), deb so‘ngra xohlaganicha dunyoviy va uxroviy duolarni qilaveradi.)
Abu Dovud rivoyatlari.",
'parse_mode'=>'html',
]);
}
if($text == "Namoz boshlaganda"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Oisha onamiz roziyallohu anhodan rivoyat qilinadi:
Rasululloh sollallohu alayhi vasallam namozni boshlasalar:

سُبْحَانَكَ اللهُمَّ وَبِحَمْدِكَ وَتَبَارَكَ اسْمُكَ وَتَعَالى جَدُّكَ وَلاَ إِلَهَ غَيْرُكَ

«Subhanakallohumma va bihamdika va tabarokasmuka va ta’ala jadduka va la ilaha g‘oyruk», der edilar.
(Ma’nosi: Ey Rabbim, Senga hamd aytish bilan Seni aybu nuqsonlardan poklayman. Sening isming muborakdir. Azamating oliydir. Sendan boshqa iloh yo‘qdir.",
'parse_mode'=>'html',
]);
}
if($text == "Namozdagi rukuda"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Namoz oqiyotgan kishi ruku’ga to‘la egilsa

سُبْحَانَ رَبِّيَ العَظِيمِ، سُبْحَانَ رَبِّيَ العَظِيمِ، سُبْحَانَ رَبِّيَ العَظِيمِ

 Subhana robbiyal ’aziym deb ruku’ zikrlarini aytadi.
(Ma’nosi: Ulug‘ Rabbim nuqsonlardan pokdir.",
'parse_mode'=>'html',
]);
}
if($text == "Rukudan bosh ko‘targanda va tik turganda"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Abu Hurayra roziyallohu anhudan rivoyat qilinadi:
Rasululloh sollallohu alayhi vasallam ruku’dan qomatlarini ko‘targanlarida:

سَمِعَ اللهُ لِمَنْ حَمِدَهُ رَبَّنَا لَكَ الْحَمْدُ
«Sami’allohu liman hamidah» (Kim hamd aytsa, Alloh uni eshitadi), tik bo‘lganlarida esa, «Robbana lakal hamd» (Rabbimiz, Senga hamd bo‘lsin), deb aytar edilar (ba’zi rivoyatlarda: «Robbana va lakal hamd» bo‘lib kelgan). 
Imom Buxoriy va Muslim rivoyatlari.",
'parse_mode'=>'html',
]);
}
if($text == "Sajda paytida"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Rasululloh alayhissalom: «Agar birortangiz sajda qilsa, kamida uch marta:

سُبْحَانَ رَبِّيَ الأَعْلَى، سُبْحَانَ رَبِّيَ الأَعْلَى، سُبْحَانَ رَبِّيَ الأَعْلَى

«Subhana robbiyal a’la, Subhana robbiyal a’la, Subhana robbiyal a’la, », deb aytsin», dedilar.
Sunan kitoblarida rivoyat qilingan.",
'parse_mode'=>'html',
]);
}
if($text == "Vitrdagi qunut duosi"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"اللهُمَّ إِنَّا نَسْتَعِينُكَ وَنَسْتَغْفِرُكَ وَنُؤْمِنُ بِكَ وَنَتَوَكَّلُ عَلَيْكَ وَنُسْنِي عَلَيْكَ الْخَيْرَ كُلَّهُ نَشْكُرُكَ وَلاَ نَكْفُرُكَ وَنَخْلَعُ وَنَتْرُكُ مَنْ يَفْجُرُكَ، اللهُمَّ إِيَّاكَ نَعْبُدُ وَلَكَ نُصَلِّي وَنَسْجُدُ وَإِلَيْكَ نَسْعَي وَنَحْفِدُ نَرْجُو رَحْمَتَكَ وَنَخْشَى عَذَابَكَ إِنَّ عَذَابَكَ بِالكُفَّارِ مُلْحِقٌ

Allohumma inna nasta’iynuka va nastag‘firuka va nu`minu bika va natavakkalu ’alayka va nusniy ’alaykal xoyro kullah, nashkuruka va la nakfuruka va naxla’u va natruku may yafjuruk. Allohumma iyyaka na’budu va laka nusolliy va nasjudu va ilayka nas’a va nahfidu narju rohmataka va naxsha ’azabaka inna ’azabaka bilkuffari mulhiq».
(Ma’nosi: Ey Rabbim, Sening yordam berishingni, hidoyat qilishingni, gunohlarni kechishingni so‘rayman. Senga tavba qildim, iymon keltirdim va Senga suyandim. Yaxshiliklarning barchasi bilan Seni sifatlaymiz. Senga shukr qilamiz, noshukrlik qilmaymiz. Senga fojirlik qilganlardan chetlashamiz. Ey Rabbim, Senga ibodat, namoz, sajda etamiz. Va Sening yo‘lingda sa’y-harakat qilib, rahmatingni umid qilamiz. Azobingdan qo‘rqamiz. Albatta, haq azobing kofirlarga ro‘para qilinuvchidir.",
'parse_mode'=>'html',
]);
}
if($text == "Tashahhud"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Ibn Mas’ud roziyallohu anhudan rivoyat qilinadi:
Rasululloh sollallohu alayhi vasallam tashahhudda : 

اَلتَّحِيَّاتُ للهِ وَالصَّلَوَاتُ وَالطَيِّبَاتُ السَّلاَمُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ السَّلاَمُ عَلَيْنَا وَعَلَى عِبَادِ اللهِ الصَّالِحِينَ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ

«Attahiyyatu lillahi vassolavatu vattoyyibat assalamu ’alayka ayyuhan nabiyyu va rohmatullohi va barokatuh. Assalamu ’alayna va ’ala ’ibadillahis solihiyn. Ashhadu alla ilaha illallohu va ashhadu anna Muhammadan ’abduhu va rosuluh», deb aytdilar. 
(Ma’nosi: «Salomlar, duolar va yaxshiliklarning barchasi Alloh uchundir. Ey Payg‘ambar, sizga salom va Allohning rahmatiyu barakoti bo‘lsin. Bizlarga va Allohning solih bandalariga ham salom bo‘lsin. Allohdan boshqa iloh yo‘q deb guvohlik beraman. Va yana Muhammad Allohning bandasi va rasuli deb guvohlik beraman.)
Imom Buxoriy va Muslim rivoyatlari.",
'parse_mode'=>'html',
]);
}
if($text == "Kiyim echilganda"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Anas roziyallohu anhudan rivoyat qilinadi:
Rasululloh sollallohu alayhi vasallam: «Musulmon kishi kiyimini echmoqchi bo‘lsa:
بِسْمِ اللهِ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ
«Bismillahillaziy la ilaha illa huva», deb aytsin, shu so‘z odam bolasi avrati bilan jin ko‘zi orasida pardadir», dedilar. 
(Ma’nosi: Undan boshqa iloh yo‘q bo‘lgan Allohning ismi bilan.)
Ibn Sunniy rivoyatlari.",
'parse_mode'=>'html',
]);
}
if($text == "Uydan chiqayotganda"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Ummu Salama onamiz roziyallohu anhodan rivoyat qilinadi:
Rasululloh sollallohu alayhi vasallam uydan chiqayotib:
بِاسْمِ اللهِ تَوَكَّلْتُ عَلَى اللهِ، اللهُمَّ إِنِّي أَعُوذُ بِكَ أَنْ أَضِلَّ أَوْ أُضَلَّ أَوْ أَزِلَّ أَوْ أُزَلَّ أَوْ أَظْلِمَ أَوْ أُظْلَمَ أَوْ أَجْهَلَ أَوْ يُجْهَلَ عَلَيَّ
«Bismillahi, tavakkaltu ’alallohi. Allohumma inniy a’uzu bika an adilla av udalla av azilla av uzalla av azlima av uzlama av ajhala av yujhala ’alayya», degan duoni o‘qir edilar».
(Ma’nosi: Alloh nomi bilan. Allohga tavakkal qildim. Ey Rabbim, adashish va adashtirilishdan, toyilish va toyiltirilishdan, zulm qilish va zulm ko‘rishdan, johillik qilish va menga nisbatan johillik qilinishidan Sendan panoh so‘rayman.) 
Abu Dovud, Termiziy, Nasaiy, Ibn Moja rivoyatlari.",
'parse_mode'=>'html',
]);
}
if($text == "Uyga kirayotganda"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Manzilga kirayotganda «Bismilloh»ni aytib, zikrni ko‘paytirib, uyda odam bo‘lsin-bo‘lmasin, salom berib kirish mustahabdir. Alloh taolo Nur surasining 61-oyatida: «Bas, qachon uylarga kirsangizlar, bir-birlaringizga Alloh huzuridan bo‘lgan muborak pokiza salomni aytinglar (ya’ni, assalomu alaykum, denglar)», deb buyuradi. 

* Anas roziyallohu anhudan rivoyat qilinadi:
Rasululloh sollallohu alayhi vasallam menga: «Ey o‘g‘ilcham, uyingga kirsang, salom berib kir. Bu ishing o‘zingga va ahli ayolingga baraka keltiradi», dedilar».
Imom Termiziy rivoyatlari.

* Abu Molik Ash’ariy roziyallohu anhudan rivoyat qilinadi:
Rasululloh sollallohu alayhi vasallam: «Kishi uyiga kirayotganida: 
اللهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ الْمَوْلَجِ وَخَيْرَ الْمَخْرَجِ، بِاسْمِ اللهِ وَلَجْنَا وَبِاسْمِ اللهِ خَرَجْنَا وَعَلَى اللهِ رَبِّنَا تَوَكَّلْنَا
«Allohumma inniy as`aluka xoyral mavlaji va xoyral maxraji, bismillahi valajna va bismillahi xorojna va ’alallohi robbina tavakkalna».
(Ma’nosi: Ey Rabbim, Sendan kirishning ham, chiqishning ham yaxshisini so‘rayman. Allohning ismi bilan kirdik. Allohning ismi bilan chiqdik. Rabbimiz Allohga tavakkal qildik), deb aytib, so‘ngra ahliga salom bersin», dedilar. 
Abu Dovud rivoyatlari.",
'parse_mode'=>'html',
]);
}
if($text == "Hojatxonaga kirayotganda"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Anas roziyallohu anhudan rivoyat qilinadi:
Rasululloh sollallohu alayhi vasallam hojatxonaga kirayotganlarida:
اللهُمَّ إِنَّي أَعُوذُ بِكَ مِنَ الْخُبْثِ وَالْخَبَائِثِ
«Allohumma inniy a’uzu bika minal xubsi val xobais» duosini o‘qir edilar». 
(Ma’nosi: Ey Rabbim, erkak va ayol shaytonning yomonligidan panoh tilayman.) Imom Buxoriy va Muslim rivoyatlari.",
'parse_mode'=>'html',
]);
}
if($text == "Hojatxonadan chiqayotganda"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Rasululloh sollallohu alayhi vasallam hojatxonadan chiqqanlarida:
غُفْرَانَكَ، الْحَمْدُ للهِ الَّذِي أَذْهَبَ عَنِّي الأَذَى وَعَافَانِي
«g‘ufronaka» (Sening mag‘firatingni so‘rayman) va «alhamdu lillahillaziy azhaba ’annil aza va ’afaniy» (mendan aziyatlarni ketkazib, ofiyatda qilgan Allohga hamd bo‘lsin), deb aytar edilar.
Avvalgisini Abu Dovud va Termiziy, keyingisini Nasaiy va Ibn Mojalar rivoyat qilishgan.",
'parse_mode'=>'html',
]);
}
if($text == "Allohning gozal ismlari"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Arof surasining 180-oyatida: «Allohning chiroyli ismlari bor. U bilan duo qilinglar», deb aytilgan.
* Abu Hurayra roziyallohu anhudan rivoyat qilinadi:
Rasululloh sollallohu alayhi vasallam: «Alloh taoloning to‘qson to‘qqizta - bir kam yuzta ismi bor. Kim uni sanasa, jannatga kiradi. Alloh toqdir, toqni yaxshi ko‘radi», dedilar.
Bu hadisni shu ergacha Imom Buxoriy va Imom Muslim rivoyat qilishgan. Davomida Imom Termiziy va boshqalar Alloh taoloning ismlarini keltirishgan:
هُوَ اللهُ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الرَّحْمَنُ، الرَّحِيمُ، الْمَلِكُ، القُدُّوسُ، السَّلاَمُ، الْمُؤْمِنُ، الْمُهَيْمِنُ، العَزِيزُ، الْجَبَّارُ، الْمُتَكَبِّرُ، الْخَالِقُ، البَارِئُ، الْمُصَوِّرُ، الغَفَّارُ، القَهَّارُ، الوَهَّابُ، الرَّزَّاقُ، الفَتَّاحُ، العَلِيمُ، القَابِضُ، البَاسِطُ، الْخَافِضُ، الرَّافِعُ، الْمُعِزُّ، الْمُذِلُّ، السَّمِيعُ، البَصِيرُ، الْحَكَمُ، العَدْلُ، اللَّطِيفُ، الْخَبِيرُ، الْحَلِيمُ، العَظِيمُ، الغَفُورُ، الشَّكُورُ، العَلِيُّ، الكَبِيرُ، الْحَفِيظُ، الْمُقِيتُ، الْحَسِيبُ، الْجَلِيلُ، الكَرِيْمُ، الرَّقِيبُ، الْمُجِيبُ، الوَاسِعُ، الْحَكِيمُ، الوَدُودُ، الْمَجِيدُ، البَاعِثُ، الشَّهِيدُ، الْحَقُّ، الوَكِيلُ، القَوِيُّ، الْمَتِينُ، الوَلِيُّ، الْحَمِيدُ، الْمُحْصِي، الْمُبْدِيءُ، الْمُعِيدُ، الْمُحْيِي، الْمُمِيتُ، الْحَيُّ، القَيُّومُ، الوَاجِدُ، الْمَاجِدُ، الوَاحِدُ، الصَّمَدُ، القَادِرُ، الْمُقْتَدِرُ، الْمُقَدِّمُ، الْمُؤَخِّرُ، الأَوَّلُ، الآخِرُ، الظَّاهِرُ، البَاطِنُ، الوَالِي، الْمُتَعَالِ، البَرُّ، التَّوَّابُ، الْمُنْتَقِمُ، العَفُوُّ، الرَّؤُوفُ، مَالِكُ الْمُلْكِ، ذُو الْجَلاَلِ وَالإِكْرَامِ، الْمُقْسِطُ، الْجَامِعُ، الغَنِيُّ، الْمُغْنِي، الْمَانِعُ، الضَّارُّ، النَّافِعُ، النُّورُ، الْهَادِي، البَدِيعُ، البَاقِي، الوَارِثُ، الرَّشِيدُ، الصَّبُورُ.
1) Alloh. 
2) ar-Rahmon. 
3) ar-Rahiym. 
4) al-Malik. 
5) al-Quddus. 
6) as-Salom. 
7) al-Mo‘min. 
8) al-Muhaymin. 
9) al-Aziz. 
10) al-Jabbor. 
11) al-Mutakabbir. 
12) al-Xoliq. 
13) al-Bori’. 
14) al-Musavvir. 
15) al-G‘affor. 
16) al-Qahhor. 
17) al-Vahhob. 
18) ar-Razzoq. 
19) al-Fattoh. 
20) al-Aliym. 
21) al-Qobiz. 
22) al-Bosit. 
23) al-Xofiz.
24) ar-Rofe’. 
25) al-Mu’izz. 
26) al-Muzill.
27) as-Samiy’. 
28) al-Basiyr. 
29) al-Hakam. 
30) al-Adl. 
31) al-Latiyf. 
32) al-Xabiyr. 
33) al-Haliym. 
34) al-Aziym. 
35) al-G‘afur. 
36) ash-Shakur. 
37) al-Aliy. 
38) al-Kabiyr. 
39) al-Hafiyz. 
40) al-Muqiyt.
41) al-Hasiyb. 
42) al-Jaliyl.
43) al-Kariym. 
44) ar-Raqiyb. 
45) al-Mujiyb.
46) al-Vose’.
47) al-Hakiym.
48) al-Vadud. 
49) al-Majiyd.
50) al-Bo’is. 
51) ash-Shahiyd. 
52) al-Haq. 
53) al-Vakiyl.
54) al-Qaviy. 
55) al-Matiyn. 
56) al-Valiy. 
57) al-Hamiyd. 
58)al-Muhsiy.
59) al-Mubdi’.
60) al-Mu’iyd.
61) al-Muhyi.
62) al-Mumiyt. 
63) al-Hayy. 
64) al-Qayyum. 
65) al-Vojid. 
66) al-Mojid. 
67) al-Vohid. 
68) as-Somad. 
69) al-Qodir. 
70) al-Muqtadir.
71) al-Muqaddim. 
72) al-Muaxxir. 
73) al-Avval. 
74) al-Oxir. 
75) az-Zohir.
76) al-Botin.
77) al-Voliy. 
78) al-Muta’oliy.
79) al-Barr.
80) at-Tavvob.
81) al-Muntaqim.
82) al-Afuvv.
83) ar-Ra`uf.
84) al-Molikul mulk. 
85) Zul jaloli val ikrom.
86) al-Muqsit. 
87) al-Jome’.
88) al-G‘aniy.
89) al-Mug‘niy.
90) al-Mone’.
91) az-Zorr. 
92) an-Nofe’. 
93) an-Nur.
94) al-Hodiy. 
95) al-Badiy’.
96) al-Boqiy. 
97) al-Voris. 
98) ar-Rashiyd. 
99) as-Sabur. ",
'parse_mode'=>'html',
]);
}
if($text == "Istixora qilganda"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Jobir ibn Abdulloh roziyallohu anhudan rivoyat qilinadi:
Rasululloh sollallohu alayhi vasallam bizga hamma ishlarda istixorani xuddi Qur’ondan sura o‘rgatgandek o‘rgatar edilar. U zot: «Birortangiz bir ishni qasd qilsa, farzdan tashqari ikki rakat namoz o‘qisin. So‘ng: 
اللهُمَّ إِنِّي أَسْتَخِيرُكَ بِعِلْمِكَ وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ وَأَسْأَلُكَ مِنْ فَضْلِكَ العَظِيم فَإِنَّكَ تَقْدِرُ وَلاَ أَقْدِرُ وَتَعْلَمُ وَلاَ أعْلَمُ وَأنْتَ عَلاَّمُ الغُيُوبِ؛ اللهُمَّ إِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الأَمْرَ خَيْرٌ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أمْرِي أوْ قَالَ: عَاجِلِ أمْرِي وَآجِلِهِ فَاقْدُرْهُ لِي وَيَسِّرْهُ لِي ثُمَّ بَارِكْ لِي فِيهِ، وَإِنْ كُنْتَ تَعْلَمُ أنَّ هَذَا الأَمْرَ شَرٌّ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أمْرِي أوْ قَالَ: عَاجِلِ أمْرِي وَآجِلِهِ فَاصْرِفْهُ عَنِّي وَاقْدُرْ لِي الْخَيْرَ حَيْثُ كَانَ ثُمَّ رَضِّنِي بِهِ.
«Allohumma inniy astaxiyruka bi’ilmika, va astaqdiruka biqudrotika va as`aluka min fazlikal ’aziym. Fainnaka taqdiru va la aqdiru va ta’lamu va la a’lamu va anta ’allamul g‘uyub. Allohumma in kunta ta’lamu anna hazal amro xoyrun liy fiy diyniy va ma’ashiy va ’aqibati amriy, ’ajili amriy va ajilihi, faqdurhu liy va yassirhu liy, summa barik liy fiyhi va in kunta ta’lamu anna hazal amro sharrun liy fiy diyniy va ma’ashiy va ’aqibati amriy, ’ajili amriy va ajilihi fasrifhu ’anniy vaqdurliyal xoyro haysu kana summa rozziniy bih», deb hojatini aytsin», dedilar.
(Ma’nosi: Allohim, Sening ilming bilan Sendan yaxshilik so‘rayman. Sening qudrating bilan Sendan qodirlik va ulug‘ fazlingni so‘rayman. Sen (har narsaga) qodirsan, men qodir emasman. Sen (har narsani) biluvchisan, men bilmayman. Sen g‘aybni biluvchisan. Ey Rabbim, agar mana shu qilayotgan ishim (hojatining nomini aytadi) dinimda, yashashimda, ishlarimning oqibatida, dunyo va oxiratimda men uchun yaxshi bo‘lsa, uni menga nasib et va oson qil. So‘ng uni menga barakotli qil. Agar mana shu ishim (hojatining nomini aytadi) dinimda, yashashimda, ishlarimning oqibatida, dunyo va oxiratimda men uchun yomon bo‘lsa, mendan uni uzoqlashtir, qaerda bo‘lsa ham, men uchun yaxshilikni taqdir qil va meni undan rozi et.) 
Imom Buxoriy rivoyatlari.",
'parse_mode'=>'html',
]);
}
if($text == "Qiyinchilik va g‘amginlikda"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Ali roziyallohu anhudan rivoyat qilinadi:
Rasululloh sollallohu alayhi vasallam agar menga biror qiyinchilik yoki xafachilik etsa, quyidagi kalimalarni aytishni buyurdilar:
لاَ إِلَهَ إِلاَّ اللهُ الكَرِيْمُ العَظِيمُ، سُبْحَانَهُ تَبَارَكَ اللهُ رَبُّ العَرْشِ العَظِيمِ، الْحَمْدُ للهِ رَبِّ العَالَمِينَ
«La ilaha illallohu karimul ’aziym. Subhanahu tabarokallohu robbul ’arshil ’aziym. Alhamdu lillahi robbil ’alamiyn». 
(Ma’nosi: Ulug‘ va karim sifatli Allohdan boshqa iloh yo‘q. Ulug‘ arsh Rabbi Alloh barakotli va pokdir. Olamlar rabbi Allohga hamd bo‘lsin.)
Nasaiy va Ibn Sunniy rivoyatlari.",
'parse_mode'=>'html',
]);
}
if($text == "G'am yoki tashvish etganida"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Abu Muso Ash’ariy roziyallohu anhudan rivoyat qilinadi:
Rasululloh sollallohu alayhi vasallam: «Kimga g‘am-tashvish etsa, ushbu kalimalar bilan duo qilsin, deganlarida, bir kishi: «Ey Rasululloh mana shu kalimalardan bebahra qolgan kishi xasoratdami» dedi, Rasululloh sollallohu alayhi vasallam: «Ha», deb javob berdilar. So‘ngra, «Bu kalimalarni o‘zinglar aytib, boshqalarga ham o‘rgatinglar. Kim bir narsa talabida ana shu kalimalarni aytsa, Alloh undan xafalikni ketkazib, xursandchiligini ziyoda qiladi», deb o‘sha kalimalarni aytdilar: 
اللهُمَّ إنِّي عَبْدُكَ ابْنُ عَبْدِكَ ابْنُ أَمَتِكَ نَاصِيَتِي بِيَدِكَ مَاضٍ فِيَّ حُكْمُكَ عَدْلٌ فِيَّ قَضَاؤُكَ؛ أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ سَمَّيْتَ بِهِ نَفْسَكَ أَوْ أَنْزَلْتَهُ فِي كِتَابِكَ أَوْ عَلَّمْتَهُ أَحَدًا مِنْ خَلْقِكَ أوِ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الغَيْبِ عِنْدَكَ أَنْ تَجْعَلَ القُرْآنَ نُورَ صَدْرِي وَرَبِيعَ قَلْبِي وَجِلاَءَ حُزْنِي وَذَهَابَ هَمِّي.
«Allohumma inniy ’abduka, ibnu ’abdika, ibnu amatika, nasiyatiy biyadik, mazin fiyya hukmuk, ’adlun fiyya qozouk, as`aluka bikulli ismin huva laka sammayta bihi nafsaka av anzaltahu fi kitabika av ’allamtahu ahadan min xolqika av ista`sarta bihi fiy ’ilmil g‘oybi ’indaka an taj’alal Qur’ana nuro sodriy va robiy’a qolbiy va jilaa huzniy va zahaba hammiy».
(Ma’nosi: Men Sening qulingman, qulingning o‘g‘liman, cho‘ringning zurriyotiman. Peshonam Sening qo‘lingda. Hukming mening ustimda joriydir. Sening hukming odildir. O‘zingni nomlagan yoki kitobingda nozil qilgan yoki xalqingdan biror kishiga o‘rgatgan yoki g‘ayb ilmingda saqlab qo‘ygan ismlaring ila so‘raymanki, Qur’onni dilimning nuri, qalbimning bahori, mahzunligimni arituvchi va g‘amimni ketkizuvchi qil.)
Ibn Sunniy rivoyatlari.",
'parse_mode'=>'html',
]);
}
if($text == "Qiyin ahvolga tushib qolganda"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Ali roziyallohu anhudan rivoyat qilinadi:
Rasululloh sollallohu alayhi vasallam menga: «Ey Ali, qiyin ahvolga tushib qolganda aytiladigan kalimalarni o‘rgataymi?» dedilar. «Alloh meni sizga fido qilsin, o‘rgating», dedim. Rasululloh sollallohu alayhi vasallam: «Agar qiyin ahvolga tushib qolsang,
بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ، وَلاَ حَولَ وَلاَ قُوَّةَ إلاَّ بِاللهِ العَلِيِّ العَظِيمِ
«Bismillahir rohmanir rohiym. Va la havla va la quvvata illa billahil ’aliyyil ’aziym», deb ayt. Chunki Alloh mana shu duo bilan xohlaganicha, turli balolardan xalos qiladi», dedilar».
Ibn Sunniy rivoyatlari.",
'parse_mode'=>'html',
]);
}
if($text == "Bir qavmdan qo‘rqqanda"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Abu Muso Ash’ariy roziyallohu anhudan rivoyat qilinadi:
Rasululloh sollallohu alayhi vasallam agar biror qavmdan xavfsirasalar: 
اللهُمَّ إِنَّا نَجْعَلُكَ فِي نُحُورِهِمْ وَنَعُوذُ بِكَ مِنْ شُرُورِهِمْ
«Allohumma inna naj’aluka fiy nuhurihim va na’uzu bika min shururihim», deb aytardilar. 
(Ma’nosi: Ey Rabbim, biz Seni ularga ro‘para qo‘yamiz va Sening noming ila ularning yomonligidan panoh tilaymiz.)
Abu Dovud va Nasaiy rivoyatlari.",
'parse_mode'=>'html',
]);
}
if($text == "Sultondan qo‘rqqanda"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Ibn Umar roziyallohu anhudan rivoyat qilinadi:
Rasululloh sollallohu alayhi vasallam menga: «Agar sultondan yoki boshqa kishidan qo‘rqsang: 
لاَ إِلَهَ إِلاَّ اللهُ الْحَلِيمُ الْحَكِيمُ سُبْحَانَ اللهِ رَبِّ السَّمَوَاتِ السَّبْعِ وَرَبِّ العَرْشِ العَظِيمِ لاَ إِلَهَ إِلاَّ أَنْتَ عَزَّ جَارُكَ وَجَلَّ ثَنَاؤُكَ
«La ilaha illallohul haliymul hakiym. Subhanallohi robbis samavatis sab’i va robbil ’arshil ’aziym, la ilaha illa anta ’azza jaruka va jalla sanauka», deb ayt», dedilar». (Ma’nosi: Hakim va Halim sifatli Allohdan boshqa iloh yo‘q. Etti osmon va ulug‘ arshning rabbi Alloh pokdir. Sendan boshqa iloh yo‘q. Himoyang aziz bo‘ldi. Sanoing ulug‘ bo‘ldi.)
Ibn Sunniy rivoyatlari.",
'parse_mode'=>'html',
]);
}
if($text == "Dushmanga yo‘liqqanda"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Anas roziyallohu anhudan rivoyat qilinadi:
Rasululloh sollallohu alayhi vasallam dushmanga yo‘liqqanlarida: 
يَا مَالِكَ يَوْمِ الدِّينِ، إِيَّاكَ أعْبُدُ وَإِيَّاكَ أسْتَعِينُ
«Ya malika yavmiddin iyyaka a’budu va iyyaka asta’iyn», deb aytganlarida, farishtalar kishilarni erga yotqizib, oldidan va orqasidan urayotganini ko‘rdim»
. (Ma’nosi: Ey qiyomat kunining Podshohi, Sengagina ibodat qilaman, Sendangina yordam so‘rayman.)
Ibn Sunniy rivoyatlari.",
'parse_mode'=>'html',
]);
}
if($text == "Bir ish og‘irlik qilganida"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Anas roziyallohu anhudan rivoyat qilinadi:
Rasululloh sollallohu alayhi vasallam: 
اللهُمَّ لاَ سَهْلَ إِلاَّ ما جَعَلْتَهُ سَهْلاً وَأنْتَ تَجْعَلُ الْحَزْنَ إذَا شِئْتَ سَهْلاً
«Allohumma la sahla illa ma ja’altahu sahlan va anta taj’alul hazna iza shi`ta sahla», deb aytardilar.
(Ma’nosi: Allohim, Sen engil etgan narsagina engildir. Agar Sen xohlasang, qattiq erni ham tekis qiluvchisan.) 
Ibn Sunniy rivoyatlari.",
'parse_mode'=>'html',
]);
}
if($text == "Yashash qiyinlashganda"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Ibn Umar roziyallohu anhudan rivoyat qilinadi:
Rasululloh sollallohu alayhi vasallam: «Birortangizning yashashi qiyinlashib qolsa, uyidan ko‘chaga chiqayotib quyidagi duolarni aytishdan nima man qiladi?» dedilar:
بِسْمِ اللهِ عَلَى نَفْسِي وَمَالِي وَدِينِي، اللهُمَّ رَضِّنِي بِقَضَائِكَ وَبَارِكْ لِي فِيمَا قُدِّرَ لِي حَتَّى لاَ أحِبَّ تَعْجِيلَ مَا أخَّرْتَ وَلاَ تَأْخِيرَ مَا عَجَّلْتَ

«Bismillahi ’ala nafsiy va maliy va diniy. Allohumma rozziniy biqozoika va barik liy fiyma quddiro liy hatta la uhibba ta’jiyla ma axxorta va la ta`xiyro ma ’ajjalta». 
(Ma’nosi: nafsim, molim va dinimga Allohning ismini aytaman. Ey Rabbim, qazoi qadaringdan meni rozi et. Va taqdir qilgan narsangni men uchun barakali qil. Toki, kechiktirgan narsangni shoshiltirishni va shoshiltirgan narsangni kechiktirishni yaxshi ko‘rmayin.)
Ibn Sunniy rivoyatlari.",
'parse_mode'=>'html',
]);
}
if($text == "Ofatni daf qilishda"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Anas ibn Molik roziyallohu anhudan rivoyat qilinadi:
Rasululloh sollallohu alayhi vasallam: «Alloh taolo bir bandaga ahli ayoli, moli va farzandida bir ne’mat bersa, u: 
مَا شَاءَ اللهُ لاَ قُوَّةَ إِلاَّ بِاللهِ
«Ma sha`allohu la quvvata illa billahi» deb aytsa, shu ne’matlarda o‘limdan boshqa ofat ko‘rmaydi», dedilar.
(Ma’nosi: Allohning xohlagani bo‘ladi. Allohdan boshqada quvvat yo‘q.)
Ibn Sunniy rivoyatlari.",
'parse_mode'=>'html',
]);
}
if($text == "Katta-kichik musibat etganida"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Alloh taolo Baqara surasining 155 - 156-oyatlarida: 
«Biror musibat etsa: «Albatta, biz Allohning (bandalarimiz) va albatta, biz U zotga qaytguvchilarmiz», deydigan sobirlarga xushxabar bering. Ana o‘shalarga Parvardigorlari tomonidan salovot (mag‘firat) va rahmat bordir. Ana o‘shalar haq yo‘lni topguvchilardir», deb aytgan.

* Abu Hurayra roziyallohu anhudan rivoyat qilinadi:
Rasululloh sollallohu alayhi vasallam: «Har bir narsada istirjo’ ya’ni,
إِنَّا للهِ وَإنَّا إلَيهِ رَاجِعُون
«Inna lillahi va inna ilayhi roji’un», ayting, hatto oyoq kiyimingizning ipi (uzilgani) uchun ham, chunki u ham musibatdir», dedilar».
(Ma’nosi: Albatta, biz Allohning (bandalarimiz) va albatta, biz U zotga qaytguvchilarmiz). 
Ibn Sunniy rivoyatlari.",
'parse_mode'=>'html',
]);
}
if($text == "Qarzini tolashga qurbi etmaganida"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Ali roziyallohu anhudan rivoyat qilinadi:
Bir qul ozod bo‘lish uchun shartlashilgan bahodagi mablag‘ni topolmay, Hazrati Ali roziyallohu anhudan yordam so‘radi. Shunda u zot: «Senga Rasululloh o‘rgatgan kalimalarni o‘rgataymi? Agar: 

اللهُمَّ اكْفِنِي بِحَلاَلِكَ عَنْ حَرَامِكَ وَأغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ

«Allohumma ikfiniy bihalalika ’an haromika va ag‘niniy bifazlika ’amman sivaka» duosini o‘qib yursang, qarzing tog‘ning bir taraficha bo‘lsa ham, xalos bo‘lasan», dedilar.
(Ma’nosi: Ey Rabbim, harom (aralashtirmay) haloling bilan menga kifoya et. Fazling ila O‘zingdan boshqalardan behojat qil.)
Imom Termiziy rivoyatlari",
'parse_mode'=>'html',
]);
}
if($text == "Bolalarga panoh tilaganda"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Ibn Abbos roziyallohu anhudan rivoyat qilinadi:
Rasululloh sollallohu alayhi vasallam Hasan va Husaynlarga 

أعِيذُكُمَا بِكَلِمَاتِ اللهِ التَّامَّةِ مِنْ كُلِّ شَيْطَانٍ وَهَامَّةٍ وَمِنْ كُلِّ عَيْنٍ لاَمَّةٍ

«U’iyzukuma bikalimatillahit tammati min kulli shaytonin va hammah va min kulli ’aynin lammah», duosini o‘qib panoh tilar va: «Bu duo otangiz Ismoil va Ishoq alayhimussalomlarning panoh tilaydigan duolari edi», deb aytar edilar. 
(Ma’nosi: Allohning mukammal kalimalari bilan har bir shaytondan, zararli hasharotlardan va yomon ko‘zdan sizlarga panoh tilayman.)
Imom Buxoriy rivoyatlari.",
'parse_mode'=>'html',
]);
}
if($text == "Azolar yiringlaganda va narsa toshganda"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Rasululloh sollallohu alayhi vasallamning ayollaridan biri rivoyat qiladilar:
«Rasululloh sollallohu alayhi vasallam mening huzurimga kirdilar. Barmog‘im yallig‘langan edi. Shunda Rasululloh sollallohu alayhi vasallam: «Senda g‘arov qamishi (Hindistondan keltirilgan o‘simlik) bormi?» deb so‘radilar. Uni barmog‘imga qo‘ydilar va:

اللهُمَّ مُصَغِّرَ الكَبِيرِ وَمُكَبِّرَ الصَّغِيرِ صَغِّرْ مَا بِي
«Allohumma musag‘g‘irol kabiyr va mukabbiros sog‘iyr, sog‘g‘ir ma biy», deb ayt, shunda u sendan yo‘qoladi», dedilar».
(Ma’nosi: Ey kattani kichik, kichikni katta qiluvchi Zot, mendagi narsani kichik qil.) 
Ibn Sunniy rivoyatlari.",
'parse_mode'=>'html',
]);
}
if($text == "Kasal bo‘lganda"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Oisha roziyallohu anhodan rivoyat qilinadi:
Rasululloh sollallohu alayhi vasallamga birov bir narsadan - chaqami, jarohatmi - shikoyat qiladigan bo‘lsa, ko‘rsatkich barmoqlarini erga qo‘yib, so‘ngra ko‘tarib, quyidagi duoni o‘qir edilar: 

بِسْمِ اللهِ تُرْبَةُ أرْضِنَا بِرِيقَةِ بَعْضِنَا يُشْفَى بِهِ سَقِيمُنَا بِإِذْنِ رَبِّنَا

«Bismillahi turbatu arzina biriyqoti ba’zina yushfa bihi saqiymuna biizni robbina». 
(Ma’nosi: Allohning ismi bilan, erlarimizning tuprog‘i bilan, ba’zilarimizning tupugi bilan Rabbimizning izni ila kasallarimiz shifo topadi.) 
Imom Buxoriy, Muslim, Abu Dovud va boshqalar rivoyat qilishgan.

* Oisha roziyallohu anhodan rivoyat qilinadi:
Rasululloh sollallohu alayhi vasallam ahllaridan ba’zilariga o‘ng qo‘llarini surtib, panoh tilab, quyidagi duoni o‘qirdilar: 
اللهُمَّ رَبَّ النَّاسِ أذْهِبِ البَأْسَ اشْفِ أنْتَ الشَّافِي لاَ شِفَاءَ إِلاَّ شِفَاؤُكَ شِفَاءً لاَ يُغَادِرُ سَقَمًا
«Allohumma robban nasi azhibil ba`sa ishfi anta shafiy la shifaa illa shifauka shifaan la yug‘odiru saqoma».
(Ma’nosi: Allohim, Sen insonlarning rabbisan, qiyinchiliklarni ketkaz, shifo ber, Sen shifo beruvchisan. Sening shifoingdan boshqa shifo yo‘q. Sen bergan shifo birorta ham kasallik qoldirmaydi.)
Imom Buxoriy va Muslim rivoyatlari.",
'parse_mode'=>'html',
]);
}
if($text == "Bosh ogrigi, isitma va boshqa ogriqlarda"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Ibn Abbos roziyallohu anhudan rivoyat qilinadi:
Rasululloh sollallohu alayhi vasallam barcha kasalliklarga va isitma chiqqanida: 

بِسْمِ اللهِ الكَبِيرِ نَعُوذُ بِاللهِ العَظِيمِ مِنْ شَرِّ عِرْقٍ نَعَّارٍ وَمِنْ شَرِّ حَرِّ النَّارِ

«Bismillahil kabiyr, na’uzu billahil ’aziym, min sharri ’irqin na’’ar, va min sharri harrin nar», deb aytishni o‘rgatar edilar.
(Ma’nosi: Buyuk Allohning ismi bilan boshlayman. Ulug‘ Allohning nomi ila tomirdan shovullab oquvchi qonning yomonidan va do‘zax o‘tining yomonidan panoh tilayman.) 
Ibn Sunniy rivoyatlari.",
'parse_mode'=>'html',
]);
}
if($text == "O‘lim yaqinlashganda"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Oisha roziyallohu anhodan rivoyat qilinadi:
Rasululloh sollallohu alayhi vasallamning o‘limlari yaqinlashgan edi. Oldlarida bir qadahda suv bor edi. Unga qo‘llarini tiqdilar, so‘ng suvini yuzlariga surtib: 

اللهُمَّ أعِنِّي عَلَى غَمَرَاتِ الْمَوْتِ وَسَكَرَاتِ الْمَوْتِ

«Allohumma a’inniy ’ala g‘omarotil mavti va sakarotil mavt», deb aytdilar». 
(Ma’nosi: Allohim, o‘lim shiddati va o‘lim talvasasida menga yordam ber.) Termiziy va Ibn Moja rivoyatlari.
* Yana Oisha onamiz roziyallohu anho aytadilar: «Rasululloh sollallohu alayhi vasallam menga suyanib turib: 

اللهُمَّ اغْفِرْ لِي وَارْحَمْنِي وَألْحِقْنِي بِالرَّفِيقِ الأَعْلَى

«Allohummag‘firli varhamniy va alhiqniy birrofiqil a’la», deganlarini eshitdim». 
(Ma’nosi: Allohim, meni mag‘firat qil va menga rahm et. Meni Oliy do‘st bilan qovushtir.) 
Imom Buxoriy va Muslim rivoyatlari.

* Abu Hurayra va Abu Said Xudriylar roziyallohu anhumadan rivoyat qilinadi:
Rasululloh sollallohu alayhi vasallam o‘lim to‘shagida yotganlarga «La ilaha illalloh»ni aytib turishni buyurdilar».
Imom Muslim, Abu Dovud, Termiziy, Nasaiy rivoyatlari.",
'parse_mode'=>'html',
]);
}
if($text == "Kishining yaqini vafot etganida"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Ummu Salama onamiz roziyallohu anho aytadilar:
«Rasululloh sollallohu alayhi vasallam: «Biror bandaga musibat etganida: 

إِنَّا للهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ؛ اللهُمَّ اجُرْنِي فِي مُصِيبَتِي وَاخْلُفْ لِي خَيْرًا مِنْهَا

«Inna lillahi va inna ilayhi roji’un, Allohumma ajurniy fiy musiybatiy vaxlufliy xoyrom minha» (Biz Allohnikimiz va Allohga qaytuvchimiz. Ey Rabbim, musibatimda ajr qil va menga undan yaxshirog‘ini ber), deb aytsa, Alloh taolo musibatiga ajr berib, undan yaxshisini ato etadi», dedilar.",
'parse_mode'=>'html',
]);
}
if($text == "Do‘stining o‘limi xabari etganida"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Ibn Abbos roziyallohu anhudan rivoyat qilinadi:
Rasululloh sollallohu alayhi vasallam: «O‘lim qo‘rqinchdir. Sizlarning biringizga birodarining o‘limi xabari etsa: 
إِنَّا للهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ، وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ، اللهُمَّ اكْتُبْهُ عِنْدَكَ فِي الْمُحْسِنِينَ وَاجْعَلْ كِتَابَهُ فِي عِلِّيِّينَ وَاخْلُفْهُ فِي أهْلِهِ فِي الغَابِرِينَ وَلاَ تَحْرِمْنَا أجْرَهُ وَلاَ تَفْتِنَّا بَعْدَهُ

«Inna lillahi va inna ilayhi roji’un va inna ila robbina lamunqolibun, Allohummaktubhu ’indaka fil muhsiniyna vaj’al kitabahu fiy ’illiyyin vaxlufhu fiy ahlihi fil g‘obiriyn va la tahrimna ajrohu va la taftinna ba’dah», deb aytsin», dedilar.
(Ma’nosi: Biz Allohnikimiz va Unga qaytuvchimiz. Va, albatta, biz Rabbimizga qaytajakmiz. Ey Rabbim, o‘zingning huzuringda uni yaxshilardan deb yoz. Va uning kitobini Illiyyinda (ettinchi osmonda-nomai a’mollar bitilgan makonda) qil. Orqasida qolganlarga O‘zing uning o‘rnini bos. Uning ajrini bizlardan mahrum qilma. Undan keyin bizlarni fitnaga solma.)
Ibn Sunniy rivoyatlari.",
'parse_mode'=>'html',
]);
}
if($text == "Janoza duosi"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"اللهُمَّ اغْفِرْ لِحَيِّنَا وَمَيِّتِنَا وَشَاهِدِنَا وَغَائِبِنَا وَصَغِيرِنَا وَكَبِيرِنَا وَذَكَرِنَا وَأُنْثَانَا. اللهُمَّ مَنْ احْيَيْتَهُ مِنَّا فَأحْيِهِ عَلَى الإِسْلاَمِ وَمَنْ تَوَفَّيْتَهُ مِنَّا فَتَوَفَّهُ عَلَى الإِيْمَانِ؛ اللهُمَّ لاَ تَحْرِمْنَا أجْرَهُ وَلاَ تَفْتِنَّا بَعْدَهُ 
«Allohummag‘fir lihayyina va mayyitina va shahidina va g‘oibina va sog‘iyrina va kabiyrina va zakarina va unsana. Allohumma man ahyaytahu minna faahyihi ’alal islam va man tavaffaytahu minna fatavaffahu ’alal iyman. Allohumma la tahrimna ajrohu va la taftinna ba’dahu».
Ma’nosi: Ey Rabbim, tirigu o‘ligimizni, hoziru g‘oyibimizni, kichigu kattamizni, erkagu ayolimizni mag‘firat qil. Ey Rabbim, kimimizni hayotda qoldiradigan bo‘lsang, uni Islomda qil, kimimizni o‘ldiradigan bo‘lsang, uni iymon bilan vafot ettir. Bizni uning ajridan mahrum qilma. Undan keyin bizni fitnaga solma.

Agar mayyit yosh bola bo‘lsa, quyidagi duoni o‘qiydi: 

اللهُمَّ اجْعَلْهُ لَهُمَا فَرَطًا وَاجْعَلْهُ لَهُمَا سَلَفًا وَاجْعَلْهُ لَهُمَا ذُخْرًا وَثَقِّلْ بِهِ مَوَازِينَهُمَا وَأَفْرِغِ الصَّبْرَ عَلَى قُلُوبِهِمَا وَلاَ تَفْتِنْهُمَا بَعْدَهُ وَلاَ تَحْرِمْهُمَا أَجْرَهُ
«Allohummaj’alhu lahuma farotan vaj’alhu lahuma salafan vaj’alhu lahumo zuhron va saqqil bihi mavaziynahuma va afrig‘is sobro ’ala qulubihima va la taftinhuma ba’dahu va la tahrimhuma ajrah».
(Ma’nosi: Allohim, bu go‘dakni ota-onalari uchun ajr, fazl va zahira qil. U sababli ota-onasining tarozilarini og‘ir qil, qalblariga sabr yog‘dir. Undan so‘ng ularni fitnaga solma, ularni uning ajridan mahrum qilma.",
'parse_mode'=>'html',
]);
}
if($text == "Mayyit olib ketilayotganini ko‘rganda"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Tobutni ko‘rganda:

سُبْحَانَ الْحَيِّ الَّذِي لاَ يَمُوتُ
«Subhanal hayyillaziy la yamut» (Hargiz o‘lmaydigan, abadiy tirik zot Alloh pokdir), deb aytish mustahabdir. Yoki Abulmahosin Ravyoniy «Bahr» nomli kitoblarida keltirganlaridek,

لاَ إِلَهَ إِلاَّ اللهُ الْحَيُّ الَّذِي لاَ يَمُوتُ
«La ilaha illallohu hayyullaziy la yamut», deb aytib, so‘ng mayyitni yaxshilik bilan eslanadi va uning haqqiga duo qilinadi.",
'parse_mode'=>'html',
]);
}
if($text == "Mayyitni qabrga qo‘yayotganda"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Ibn Umar roziyallohu anhudan rivoyat qilinadi:
Rasululloh alayhissalom mayyitni qabrga qo‘yayotganlarida:
بِسْمِ اللهِ وَعَلَى سُنَّةِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ
«Bismillahi va ’ala sunnati rosulillah», deb aytardilar.
Ma’nosi: Allohning ismi bilan, Rasulullohning sunnatlariga muvofiq
Abu Dovud, Termiziy, Bayhaqiylar rivoyati.
Ba’zi rivoyatda «’ala sunnati»ning o‘rniga «’ala millati» bo‘lib kelgan.",
'parse_mode'=>'html',
]);
}
if($text == "Talbiya aytganda"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Labbaykallohumma labbayk, labbayka la shariyka laka labbayk, innal hamda vanni’mata laka val mulk, la shariyka lak». (Ma’nosi: Labbay, Allohim, Senga itoatdaman. Senga itoatdaman. Sening sheriging yo‘q. Labbay Senga. Albatta, hamd, ne’mat va mulk Senikidir. Sening sheriging yo‘q",
'parse_mode'=>'html',
]);
}
if($text == "🇸🇦Arab tili Darslari 1-qism"){
    bot('sendmessage',[
    'chat_id'=>$cid,
    'text'=>"<b> 🇸🇦Arab tili Darslari 1-qism </b> <i>bo'limiga xush kelibsiz Marhamat Ozingizga kerakli Darslarni tanlang</i>",
    'parse_mode'=>"html",
    'reply_markup'=>$arab,
]);
}
if($text == "1dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/arabiy_videodarslar/27",
       'caption'=>"<b>1. Алифбо ҳарфларига кириш ва унлилар.

Бу видео дарсликда:

• Араб тили алифбосида нечта ҳарф борлиги;
• алифбо ҳарфларидаги бир-бирига ўхшаш ҳарфлар;
• Ўзбек тилида учрамайдиган араб ҳарфлари;
• унлилар ва сукун тушунчаси;
• Араб тилида сўзлар қандай услубда ёзилиши ва ўқилиши ҳақида умумий маълумотлар берилади.
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$arab,
]);
}
if($text == "2dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/arabiy_videodarslar/28",
       'caption'=>"<b>2. Alif harfi | Алиф ҳарфи

Видео дарсликда:

• алиф ҳарфнинг ёзилиши;
• ўқилиши;
• алиф ҳарфининг ҳамза ундоши билан бирга келиши тушунтирилган.
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$arab,
]);
}
if($text == "3dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/arabiy_videodarslar/29",
       'caption'=>"<b>3. Ro harfi | Ро ҳарфи

Видео дарсликда:

• ҳарфнинг ёзилиши;
• талаффузидаги қоидалари;
• ўқилиши тушунтирилган.
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$arab,
]);
}
if($text == "4dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/arabiy_videodarslar/30",
       'caption'=>"<b>4. Zay harfi | Зай ҳарфи

Видео дарсликда:

• ҳарфнинг ёзилиши;
• талаффузидаги қоидалари;
• ўқилиши тушунтирилган.
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$arab,
]);
}
if($text == "5dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/arabiy_videodarslar/31",
       'caption'=>"<b>5. Miym harfi | Мийм ҳарфи

Видео дарсликда:

• ҳарфнинг ёзилиши;
• талаффузидаги қоидалари;
• ўқилиши тушунтирилган;
• ўтилган дарсда берилган вазифа таҳлил қилинган. 
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$arab,
]);
}
if($text == "6dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/arabiy_videodarslar/32",
       'caption'=>"<b>6. Ta harfi | Та ҳарфи

Видео дарсликда:

• ҳарфнинг ёзилиши;
• талаффузидаги қоидалари;
• ўқилиши тушунтирилган;
• ўтилган дарсда берилган вазифа таҳлил қилинган. 
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$arab,
]);
}

if($text == "7dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/arabiy_videodarslar/33",
       'caption'=>"<b>7. Nun harfi | Нун ҳарфи

Видео дарсликда:

• ҳарфнинг ёзилиши;
• талаффузидаги қоидалари;
• ўқилиши тушунтирилган;
• ўтилган дарсда берилган вазифа таҳлил қилинган. 
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$arab,
]);
}

if($text == "8dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/arabiy_videodarslar/34",
       'caption'=>"<b>8. Ya harfi | Йа ҳарфи

Видео дарсликда:

• ҳарфнинг ёзилиши;
• талаффузидаги қоидалари;
• ўқилиши тушунтирилган;
• ўтилган дарсда берилган вазифа таҳлил қилинган. 
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$arab,
]);
}

if($text == "9dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/arabiy_videodarslar/35",
       'caption'=>"<b>9. Ba harfi | Ба ҳарфи

Видео дарсликда:

• ҳарфнинг ёзилиши;
• талаффузидаги қоидалари;
• ўқилиши тушунтирилган;
• ўтилган дарсда берилган вазифа таҳлил қилинган. 
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$arab,
]);
}

if($text == "10dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/arabiy_videodarslar/36",
       'caption'=>"<b>10. Kaf harfi | Каф ҳарфи

Видео дарсликда:

• ҳарфнинг ёзилиши;
• талаффузидаги қоидалари;
• ўқилиши тушунтирилган;
• ўтилган дарсда берилган вазифа таҳлил қилинган. 
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$arab,
]);
}

if($text == "11dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/arabiy_videodarslar/37",
       'caption'=>"<b>11. Lam harfi | Лам ҳарфи

Видео дарсликда:

• ҳарфнинг ёзилиши;
• талаффузидаги қоидалари;
• ўқилиши тушунтирилган;
• ўтилган дарсда берилган вазифа таҳлил қилинган. 
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$arab,
]);
}

if($text == "12dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/arabiy_videodarslar/38",
       'caption'=>"<b>12. Vav harfi | Вав ҳарфи

Видео дарсликда:

• ҳарфнинг ёзилиши;
• талаффузидаги қоидалари;
• ўқилиши тушунтирилган;
• ўтилган дарсда берилган вазифа таҳлил қилинган. 
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$arab,
]);
}
if($text == "13dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/arabiy_videodarslar/39",
       'caption'=>"<b>13. Ha harfi | Ҳа ҳарфи

Видео дарсликда:

• ҳарфнинг ёзилиши;
• талаффузидаги қоидалари;
• ўқилиши тушунтирилган;
• ўтилган дарсда берилган вазифа таҳлил қилинган. 

Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$arab,
]);
}
if($text == "14dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/arabiy_videodarslar/40",
       'caption'=>"<b>14. Fa harfi | Фа ҳарфи

Видео дарсликда:

• ҳарфнинг ёзилиши;
• талаффузидаги қоидалари;
• ўқилиши тушунтирилган;
• ўтилган дарсда берилган вазифа таҳлил қилинган. 

       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$arab,
]);
}
if($text == "15dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/arabiy_videodarslar/41",
       'caption'=>"<b>15. Qof harfi | Қоф ҳарфи

Видео дарсликда:

• ҳарфнинг ёзилиши;
• талаффузидаги қоидалари;
• ўқилиши тушунтирилган;
• ўтилган дарсда берилган вазифа таҳлил қилинган. 

       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$arab,
]);
}
if($text == "16dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/arabiy_videodarslar/42",
       'caption'=>"<b>16. Shiyn harfi | Шийн ҳарфи

Видео дарсликда:

• ҳарфнинг ёзилиши;
• талаффузидаги қоидалари;
• ўқилиши тушунтирилган;
• ўтилган дарсда берилган вазифа таҳлил қилинган. 
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$arab,
]);
}
if($text == "17dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/arabiy_videodarslar/43",
       'caption'=>"<b>17. Siyn harfi | Сийн ҳарфи

Видео дарсликда:

• ҳарфнинг ёзилиши;
• талаффузидаги қоидалари;
• ўқилиши тушунтирилган;
• ўтилган дарсда берилган вазифа таҳлил қилинган. 
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$arab,
]);
}
if($text == "18dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/arabiy_videodarslar/44",
       'caption'=>"<b>18. Sa harfi | Са ҳарфи

Видео дарсликда:

• ҳарфнинг ёзилиши;
• талаффузидаги қоидалари;
• ўқилиши тушунтирилган;
• ўтилган дарсда берилган вазифа таҳлил қилинган. 
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$arab,
]);
}
if($text == "19dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/arabiy_videodarslar/45",
       'caption'=>"<b>19. Sod harfi | Сод ҳарфи

Видео дарсликда:

• ҳарфнинг ёзилиши;
• талаффузидаги қоидалари;
• ўқилиши тушунтирилган;
• ўтилган дарсда берилган вазифа таҳлил қилинган. 
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$arab,
]);
}
if($text == "20dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/arabiy_videodarslar/46",
       'caption'=>"<b>20. To harfi | То ҳарфи

Видео дарсликда:

• ҳарфнинг ёзилиши;
• талаффузидаги қоидалари;
• ўқилиши тушунтирилган;
• ўтилган дарсда берилган вазифа таҳлил қилинган. 
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$arab,
]);
}
if($text == "21dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/arabiy_videodarslar/47",
       'caption'=>"<b>21. Jiym harfi | Жийм ҳарфи

Видео дарсликда:

• ҳарфнинг ёзилиши;
• талаффузидаги қоидалари;
• ўқилиши тушунтирилган;
• ўтилган дарсда берилган вазифа таҳлил қилинган. 
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$arab,
]);
}
if($text == "22dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/arabiy_videodarslar/48",
       'caption'=>"<b>22. Xo harfi | Хо ҳарфи

Видео дарсликда:

• ҳарфнинг ёзилиши;
• талаффузидаги қоидалари;
• ўқилиши тушунтирилган;
• ўтилган дарсда берилган вазифа таҳлил қилинган. 
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$arab,
]);
}
if($text == "23dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/arabiy_videodarslar/49",
       'caption'=>"<b>23. Ha harfi | Ҳа ҳарфи

Видео дарсликда:

• ҳарфнинг ёзилиши;
• талаффузидаги қоидалари;
• ўқилиши тушунтирилган;
• ўтилган дарсда берилган вазифа таҳлил қилинган. 
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$arab,
]);
}
if($text == "24dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/arabiy_videodarslar/50",
       'caption'=>"<b>24. G'oyn harfi | Ғойн ҳарфи

Видео дарсликда:

• ҳарфнинг ёзилиши;
• талаффузидаги қоидалари;
• ўқилиши тушунтирилган;
• ўтилган дарсда берилган вазифа таҳлил қилинган. 
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$arab,
]);
}
if($text == "25dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/arabiy_videodarslar/51",
       'caption'=>"<b>25. Ayn harfi | Айн ҳарфи


Видео дарсликда:

• ҳарфнинг ёзилиши;
• талаффузидаги қоидалари;
• ўқилиши тушунтирилган;
• ўтилган дарсда берилган вазифа таҳлил қилинган. 
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$arab,
]);
}
if($text == "26dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/arabiy_videodarslar/52",
       'caption'=>"<b>26. Dal harfi | Дал ҳарфи

Видео дарсликда:

• ҳарфнинг ёзилиши;
• талаффузидаги қоидалари;
• ўқилиши тушунтирилган;
• ўтилган дарсда берилган вазифа таҳлил қилинган. 
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$arab,
]);
}
if($text == "27dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/arabiy_videodarslar/53",
       'caption'=>"<b>27. Dzod harfi | Дзод ҳарфи

Видео дарсликда:

• ҳарфнинг ёзилиши;
• талаффузидаги қоидалари;
• ўқилиши тушунтирилган;
• ўтилган дарсда берилган вазифа таҳлил қилинган. 
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$arab,
]);
}
if($text == "28dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/arabiy_videodarslar/54",
       'caption'=>"<b>28. Zal harfi | Зал ҳарфи

Видео дарсликда:

• ҳарфнинг ёзилиши;
• талаффузидаги қоидалари;
• ўқилиши тушунтирилган;
• ўтилган дарсда берилган вазифа таҳлил қилинган. 
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$arab,
]);
}
if($text == "29dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/arabiy_videodarslar/55",
       'caption'=>"<b>29.Zzo harfi | Ззо ҳарфи

Видео дарсликда:

• ҳарфнинг ёзилиши;
• талаффузидаги қоидалари;
• ўқилиши тушунтирилган;
• ўтилган дарсда берилган вазифа таҳлил қилинган. 
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$arab,
]);
}
if($text == "🇸🇦Arab tili Darslari 2-qismm"){
    bot('sendmessage',[
    'chat_id'=>$cid,
    'text'=>"<b> 🇸🇦Arab tili Darslari 2-qism </b> <i>bo'limiga xush kelibsiz Marhamat O'zingizga kerakli darslarni tanlang</i>",
    'parse_mode'=>"html",
    'reply_markup'=>$arab1,
]);
}
if($text == "1-dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/SACOLJFTUHV/1042",
       'caption'=>"<b>1. Arab tili: Mad harflari | Мад ҳарфлари
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$arab1,
]);
}
if($text == "2-dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/SACOLJFTUHV/1043",
       'caption'=>"<b>2. Arab tili: Tashdid | Ташдид
      
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$arab1,
]);
}
if($text == "3-dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/SACOLJFTUHV/1044",
       'caption'=>"<b>3. Arab tili: Tanvin. Tanvinli tashdid | Танвин. Танвинли ташдид
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$arab1,
]);
}
if($text == "4-dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/SACOLJFTUHV/1045",
       'caption'=>"<b>4. Arab tili: Hamza undoshi. Ta-u marbuta harfi | Ҳамза ундоши. Тау марбута ҳарфи
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$arab1,
]);
}
if($text == "5-dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/SACOLJFTUHV/1046",
       'caption'=>"<b>5. Taqdiriy 3 harf. Alifning boshqa ko'rinishlari | Тақдирий 3 ҳарф. Алифнинг бошқа кўринишлари
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$arab1,
]);
}
if($text == "6-dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/SACOLJFTUHV/1047",
       'caption'=>"<b>Alif-lom qoidasi — ulab o'qish. Vasliy hamza
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$arab1,
]);
}
if($text == "🔆Payg'ambarlar Tarixii"){
    bot('sendMessage',[
    'chat_id'=>$cid,
    'text'=>"<b> 🔆Payg'ambarlar Tarixi</b> <i>boʻlimiga xush kelibsiz Marhamat O'zingizga kerakli menyuni tanlang</i>",
    'parse_mode'=>"html",
    'reply_markup'=>$paygambar,
]);
}
if($text == "Alayhissalomlar kimlar?"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/SACOLJFTUHV/280",
       'caption'=>"<b>Alayhissalomlar kimlar?
       
Audiodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$paygambar,
]);
}
if($text == "Odam Alayhissalom"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/SACOLJFTUHV/281",
       'caption'=>"<b>Odam Alayhissalom
       
Audiodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$paygambar,
]);
}
if($text == "Idris Alayhissalom"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/SACOLJFTUHV/282",
       'caption'=>"<b>Idris Alayhissalom
       
Audiodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$paygambar,
]);
}
if($text == "Nuh Alayhissalom"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/SACOLJFTUHV/283",
       'caption'=>"<b>Nuh Alayhissalom
       
Audiodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$paygambar,
]);
}
if($text == "Hud Alayhissalom"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/SACOLJFTUHV/284",
       'caption'=>"<b>Hud Alayhissalom
       
Audiodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$paygambar,
]);
}
if($text == "Solih Alayhissalom"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/SACOLJFTUHV/285",
       'caption'=>"<b>Solih Alayhissalom
       
Audiodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$paygambar,
]);
}
if($text == "Ibrohim Alayhissalom"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/SACOLJFTUHV/286",
       'caption'=>"<b>Ibrohim Alayhissalom
       
Audiodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$paygambar,
]);
}
if($text == "Ibrohim va Ismoil Alayhissalomlar"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/SACOLJFTUHV/287",
       'caption'=>"<b>Ibrohim va Ismoil Alayhissalomlar
       
Audiodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$paygambar,
]);
}
if($text == "Ibrohim Alayhissalom"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/SACOLJFTUHV/288",
       'caption'=>"<b>Ibrohim Alayhissalom
       
Audiodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$paygambar,
]);
}
if($text == "Lut  Isxoq Yaqub Alayhissalomlar"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/SACOLJFTUHV/289",
       'caption'=>"<b>Lut  Isxoq Yaqub Alayhissalomlar
       
Audiodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$paygambar,
]);
}
if($text == "Yusuf  Alayhissalom"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/SACOLJFTUHV/290",
       'caption'=>"<b>Yusuf  Alayhissalom
       
Audiodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$paygambar,
]);
}

if($text == "Shuayb Alayhissalom"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/SACOLJFTUHV/291",
       'caption'=>"<b>Shuayb Alayhissalom
       
Audiodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$paygambar,
]);
}
if($text == "Ayub va  Zulkifl Alayhissalomlar"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/SACOLJFTUHV/292",
       'caption'=>"<b>Ayub va  Zulkifl Alayhissalomlar
       
Audiodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$paygambar,
]);
}
if($text == "Muso Alayhissalom"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/SACOLJFTUHV/293",
       'caption'=>"<b>Muso Alayhissalom
       
Audiodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$paygambar,
]);
}
if($text == "Muso va Horun Alayhissalomlar 2-qism"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/SACOLJFTUHV/294",
       'caption'=>"<b>Muso va Horun Alayhissalomlar 2-qism
       
Audiodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$paygambar,
]);
}
if($text == "Muso va Horun Alayhissalomlar 3-qism"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/SACOLJFTUHV/295",
       'caption'=>"<b>Muso va Horun Alayhissalomlar 3-qism
       
Audiodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$paygambar,
]);
}
if($text == "Muso va Horun Alayhissalomlar 4-qism"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/SACOLJFTUHV/296",
       'caption'=>"<b>Muso va Horun Alayhissalomlar 4-qism
       
Audiodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$paygambar,
]);
}
if($text == "Muso va Horun Alayhissalomlar 5-qism"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/SACOLJFTUHV/297",
       'caption'=>"<b>Muso va Horun Alayhissalomlar 5-qism
       
Audiodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$paygambar,
]);
}
if($text == "Muso va Horun Alayhissalomlar 6-qism"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/SACOLJFTUHV/298",
       'caption'=>"<b>Muso va Horun Alayhissalomlar 6-qism
       
Audiodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$paygambar,
]);
}
if($text == "Xorun va Dovud Alayhissalomlar"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/SACOLJFTUHV/299",
       'caption'=>"<b>Xorun va Dovud Alayhissalomlar
       
Audiodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$paygambar,
]);
}
if($text == "Sulaymon Alayhissalom"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/SACOLJFTUHV/300",
       'caption'=>"<b>Sulaymon Alayhissalom
       
Audiodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$paygambar,
]);
}
if($text == "Ilyos Al-yasa Yunus Alayhissalomlar"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/SACOLJFTUHV/301",
       'caption'=>"<b>Ilyos Al-yasa Yunus Alayhissalomlar
       
Audiodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$paygambar,
]);
}
if($text == "Zakariyo va Yahyo Alayhissalomlar"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/SACOLJFTUHV/302",
       'caption'=>"<b>MUSO ALAYHISSALOM 4-QISM - PAYG'AMBARLAR SIYMOSI 
       
Audiodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$paygambar,
]);
}
if($text == "Yahyo Alayhissalom va Maryam binti Imron Alayhissalom"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/SACOLJFTUHV/303",
       'caption'=>"<b>Yahyo Alayhissalom va Maryam binti Imron Alayhissalom
       
Audiodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$paygambar,
]);
}
if($text == "Iyso Alayhissalom"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/SACOLJFTUHV/304",
       'caption'=>"<b>Iyso Alayhissalom
       
Audiodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$paygambar,
]);
}
if($text == "Iyso Alayhissalom 2-qism"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/SACOLJFTUHV/305",
       'caption'=>"<b>Iyso Alayhissalom 2-qism
       
Audiodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$paygambar,
]);
}
if($text == "/panel"){
if($cid == $admin){
bot('sendMessage', [
'chat_id'=>$admin,
'text'=>"Salom Admin! 
O'zingizga kerakli bo'limni tanlang!",
'reply_markup'=>$panel,
]);
}else{
bot("sendmessage",[
'chat_id'=>$cid,
'text'=> "*Panel Menusi faqat Admin uchun Ochiladi!*",
'parse_mode'=>'Markdown',
]);
}
}
if($text == "↗️Xabar yuborish↗️" and $chat_id == $admin){
bot('sendMessage',[
'chat_id'=>$chat_id,
'text'=>" Yuboriladigan xabar matnini kiriting. Xabar turi markdown",
]);
file_put_contents("UzStarTm/$chat_id.step","user");
}

if($step == "user" and $chat_id == $admin){
file_put_contents("UzStarTm/$chat_id.step","ulink");
file_put_contents("UzStarTm/$chat_id.matn",$text);
bot('sendmessage',[
'chat_id'=>$admin,
'parse_mode'=>"markdown",
'text'=>"âœ…*Matn qabul qilindi.Endi namuna bo'yicha knopkani yuboring!
Namuna:*
`Mobil aloqa operatorlari=https://t.me/mobilaloqauz`",
]);      
}

    
if($step == "ulink"){
if($text == "/otmen"){
unlink("UzStarTm/$chat_id.step");
}else{ 
$matn=file_get_contents("UzStarTm/$chat_id.matn");
$ex=explode("=",$text);
$mess=$ex[0];
$url=$ex[1];
$idszs=explode("\n",$azolar);
foreach($idszs as $idlat){
$userr = bot('sendMessage',[
'chat_id'=>$idlat,
'text'=>$matn,
'parse_mode'=>'markdown',
'disable_web_page_preview' => true,
'reply_markup'=>json_encode([   
'inline_keyboard'=>[   
[['text'=>$mess, 'url' => $url]],
]
])
]);
}
if($userr){
bot('sendmessage',[
'chat_id'=>$admin,
'text'=>"Yuborildi!",
]);      
unlink("UzStarTm/$chat_id.step");
unlink("UzStarTm/$chat_id.matn");
 }
 }
}
if($text == "ðŸ“ŠStatistika" and $chat_id == $admin){
      $all=substr_count($azolar,"\n");
      $gr=substr_count($azolar,"-");
      $us=$all-$gr;
      $tx = "ðŸ“ŠStatistika

ðŸ‘¤Userlar: $us ta

ðŸ•œVaqti: $bugun $vaqt";
  bot('sendmessage',[
   'chat_id'=>$admin,
   'parse_mode'=>'markdown',
   'text'=>$tx,
    ]); 
} 
if($text == "📈Statistika📈"){
if($cid == $admin){
$lichka=file_get_contents("sirojiddin.db");
$lich=substr_count($lichka,"\n");
$time=date('H:i:s',strtotime('2 hour'));
$sana=date("d-F, Y-\y\i\l",strtotime("2 hour"));
$haf = date('N',strtotime('2 hour'));
$haft="1Dushanba1 2Seshanba2 3Chorshanba3 4Payshanba4 5Juma5 6Shanba6 7Yakshanba7";
$ex=explode("$haf",$haft);
$hafta="$ex[1]";
$okun=date("n");
$oynoms = "1Yanvar1 2Fevral2 3Mart3 4Aprel4 5May5 6Iyun6 7Iyul7 8Avgust8 9Sentabr9 10Oktabr10 11Noyabr11 12Dekabr12";
$ex2 = explode("$okun",$oynoms);
$oy = "$ex2[1]";
$oynomi = date('F', strtotime('2 hour'));
$sana2 = date('z', strtotime('2 hour'));
$anb8 = file_get_contents("https://obhavo.uz/termez"); $ex1=explode("n",$anb8);

$obh = file_get_contents('https://fa.weather.town/uz/forecast/uzbekistan/surxondaryo-viloyati/tirmiz/');

$ex = explode('title="Havo harorati"',$obh);

$exi = explode('right-container',$ex[1]);

$ubk = str_replace($exi[1],' ',$ex[1]);

$ubk1 = str_replace('dir="ltr">',' ',$ubk);

$ubk2 = str_replace('<div class="informer-main-page__container fleft right-container',' ',$ubk1);

$ubk3 = str_replace('&deg;C</div>',' ',$ubk2);

$ubk4 = str_replace('</div>',' ',$ubk3);

$obhavo = trim("$ubk4");
$buoy = date('t', strtotime('2 hour'));
$kun1 = date('z ',strtotime('2 hour')); 
  $a = 360;
  $c2 = $a-$kun1;
  $d = date('L ',strtotime('2 hour'));
  $b = $c2+$d;
  $f = $b+81;
  $e = $b+240;
  $kun2 = date('H ',strtotime('2 hour')); 
  $a2 = 23;
  $b2 = $a2-$kun2;
  $kun3 = date('i ',strtotime('2 hour')); 
  $a3 = 59;
  $b3 = $a3-$kun3;
  $kun4 = date('s ',strtotime('2 hour')); 
  $a4 = 60;
  $b4 = $a4-$kun4;
bot('sendmessage',[
'chat_id'=>$cid,
    'text'=> "<b>Bot statatistikasi:</b>    
A'zolar: <b>$lich</b>
Kanalimiz: <b>@New_Hackerlar</b>
Admin: <b>@Muzaffar_Blogger</b>

Soat: $time , 
Sana: $sana ,
Hafta kuni: $hafta,
Oy Nomi: $oy ,
Yilning: $sana2 kuni!,
Havo harorati: $obhavo C� ,
Bu oy $buoy kundan iborart!,
Yangi yilga $b kun, $b2 soat,  $b3 minut,  $b4 sekund qoldi!,
Ertangi kunga: $b2 -Soat,$b3 -Minut,  $b4 sekund qoldi!",
'parse_mode' => 'html',
]);
}
}
if($text == "📑Tajvid Darslari 1-qism"){
    bot('sendmessage',[
    'chat_id'=>$cid,
    'text'=>"<b> Tajvid Darslari 1-qism </b> <i>bo'limiga xush kelibsiz Marhamat O'zingizga kerakli darslarni tanlang</i>",
    'parse_mode'=>"html",
    'reply_markup'=>$tajvid,
]);
}
if($text == "TAJVID FANIGA KIRISH"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/37",
       'caption'=>"<b>Tajvid fani - Kirish
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tajvid,
]);
}
if($text == "1-DARS"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/38",
       'caption'=>"<b>Tajvid fani | 1-dars | Lahn ta'rifi, qismlari va hukmi
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tajvid,
]);
}
if($text == "2-DARS"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/39",
       'caption'=>"<b>Tajvid fani | 2-dars | Isti'oza va basmalaning holatlari
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tajvid,
]);
}
if($text == "3-DARS"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/40",
       'caption'=>"<b>Tajvid fani | 3-Dars | Qur'on qiroatida tezlik darajalari
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tajvid,
]);
}
if($text == "4-DARS"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/41",
       'caption'=>"<b>Tajvid fani | 4-Dars | Harflarning sifatlari
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tajvid,
]);
}
if($text == "5-DARS"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/42",
       'caption'=>"<b>Tajvid fani | 5-dars | Rahova shidda va bayniya sifatlari haqida
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tajvid,
]);
}
if($text == "6-DARS"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/43",
       'caption'=>"<b>Tajvid fani | 6-dars | Iste’lo va istefola  Infitoh va itboq tovushlari
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tajvid,
]);
}
if($text == "7-DARS"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/44",
       'caption'=>"<b>Tajvid fani | 7-dars | Sukunli nun va tanvin, izhor qoidasi
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tajvid
,
]);
}
if($text == "8-DARS"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/45",
       'caption'=>"<b>Tajvid fani | 8-Dars | Sukunli nun va tanvin, idg'om qoidasi
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tajvid,
]);
}
if($text == "9-DARS"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/46",
       'caption'=>"<b>Tajvid fani | 9-Dars | Sukunli nun va tanvin, iqlob qoidasi
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tajvid,
]);
}
if($text == "10-DARS"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/47",
       'caption'=>"<b>Tajvid fani | 10-Dars | Sukunli nun va tanvin, ixfo qoidasi
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tajvid,
]);
}
if($text == "11-DARS"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/48",
       'caption'=>"<b>Tajvid fani | 11-Dars | Sukunli mim qoidasi
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tajvid,
]);
}
if($text == "12-DARS"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/49",
       'caption'=>"<b>Tajvid fani | 12-Dars | Tashdidli nun va mim, g'unna: maxraji, miqdori, darajasi
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tajvid,
]);
}
if($text == "13-DARS"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/50",
       'caption'=>"<b>Tajvid fani | 13-Dars |  Sukunli Lom qoidasi
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tajvid,
]);
}
if($text == "14-DARS"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/51",
       'caption'=>"<b>Tajvid fani | 14-Dars | RO harfining holati
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tajvid,
]);
}
if($text == "15-DARS"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/52",
       'caption'=>"<b>Tajvid fani | 15-Dars | Mad: qismlari turlari  va hukmi
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tajvid,
]);
}
$lichka = file_get_contents("lichka.txt");
mkdir("data");
mkdir("data/$cid");
if($type=="private"){
if(strpos($lichka,"$cid") !==false){
}else{
file_put_contents("lichka.txt","$lichka\n$cid");
}
}
$reply = $message->reply_to_message->text;
$rpl = json_encode([
'resize_keyboard'=>false,
'force_reply' => true,
'selective' => true
]);


if($text=="/send" and $cid==$admin){
bot('sendmessage',[
'chat_id'=>$admin,
'text'=>"Yuboriladigan xabar matnini kiriting!",'parse_mode'=>"html",'reply_markup'=>$rpl
]);
}
if($reply=="Yuboriladigan xabar matnini kiriting!"){
$lich = file_get_contents("lichka.txt");
$lichka = explode("\n",$lich);
foreach($lichka as $uid){
bot("sendmessage",[
'chat_id'=>$uid,
'text'=>"$text",
'reply_markup'=>$key]);
}
}
if($text=="/stat" and $cid==$admin){
$lich = substr_count($lichka,"\n");
bot('sendmessage',[
'chat_id'=>$cid,
'text'=>"Bot foydalanuvchilari soni $lich ta.",
'parse_mode'=>"html"
]);
}
if($text =="📑Tajvid Darslari 2-qism"){
    bot('sendmessage',[
    'chat_id'=>$cid,
    'text'=>"<b> Tajvid Darslari 2-qism </b> <i>bo'limiga xush kelibsiz Marhamat O'zingizga kerakli darslarni tanlang</i>",
    'parse_mode'=>"html",
    'reply_markup'=>$tajvid1,
]);
}
if($text == "16-DARS"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/53",
       'caption'=>"<b>Tajvid fani | 16-Dars | Badal mad
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tajvid1,
]);
}
if($text == "17-DARS"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/54",
       'caption'=>"<b>Tajvid fani | 17-Dars | Mad muttasil
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tajvid1,
]);
}
if($text == "18-DARS"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/55",
       'caption'=>"<b>Tajvid fani | 18-Dars | Mad sila
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tajvid1,
]);
}
if($text == "19-DARS"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/56",
       'caption'=>"<b>Tajvid fani | 19-Dars | Mad lozim
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tajvid1,
]);
}
if($text == "20-DARS"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/57",
       'caption'=>"<b>Tajvid fani | 20-Dars | Mad oriz
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tajvid1,
]);
}
if($text == "21-DARS"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/58",
       'caption'=>"<b>Tajvid fani | 21-Dars | Mad lin
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tajvid1,
]);
}
if($text == "22-DARS"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/59",
       'caption'=>"<b>Tajvid fani | 22-Dars | Madning darajalari
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tajvid1,
]);
}
if($text == "23-DARS"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/60",
       'caption'=>"<b>Tajvid fani | 23-Dars | Idg’om mutamasilayn, mutajonisayn
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tajvid1,
]);
}
if($text == "24-DARS"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/61",
       'caption'=>"<b>Tajvid fani | 24-Dars | Idg’om mutoqoribayn
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tajvid1,
]);
}
if($text == "25-DARS"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/62",
       'caption'=>"<b>Tajvid fani | 25-Dars | Ziddi yo'q sifatlar
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tajvid1,
]);
}
if($text == "26-DARS"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/63",
       'caption'=>"<b>Tajvid fani | 26-dars | vaqf va ibtido
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tajvid1,
]);
}
if($text == "27-DARS"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/64",
       'caption'=>"<b>Tajvid fani | 27-Dars | Joiz vaqf
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tajvid1,
]);
}
if($text == "28-DARS"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/65",
       'caption'=>"<b>Tajvid fani | 28-dars | Nojoiz vaqf
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tajvid1,
]);
}
if($text == "29-DARS"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/66",
       'caption'=>"<b>Tajvid fani | 29-dars | Ibtido
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tajvid1,
]);
}
if($text == "30-DARS"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/67",
       'caption'=>"<b>Tajvid fani | 30-dars | Ravm, ishmom va sukun
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tajvid1,
]);
}
if($text == "31-DARS"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/68",
       'caption'=>"<b>Tajvid fani | 31-dars |  Imola, nabr va tas'hil
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tajvid1,
]);
}
if($text == "❇️Muhammad S.A.V hujjatli film"){
    bot('sendmessage',[
    'chat_id'=>$cid,
    'text'=>"<b> Assalomu Aleykum </b> <i>bo'limga xush kelibsiz Marhamat O'zingizga kerakli Qismni tanlang</i>",
    'parse_mode'=>"html",
    'reply_markup'=>$Bir,
]);
}
if($text == "1-Qism"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/69",
       'caption'=>"<b>Muhammad (S.A.V) hujjatli film 1-QISM
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Bir,
]);
}
if($text == "2-Qism"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/70",
       'caption'=>"<b>Muhammad (S.A.V) hujjatli film 2-QISM
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Bir,
]);
}
if($text == "3-Qism"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/71",
       'caption'=>"<b>Muhammad (S.A.V) hujjatli film 3-QISM
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Bir,
]);
}
if($text == "4-Qism"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/72",
       'caption'=>"<b>Muhammad (S.A.V) hujjatli film 4-QISM
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Bir,
]);
}
if($text == "5-Qism"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/73",
       'caption'=>"<b>Muhammad (S.A.V) hujjatli film 5-QISM
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Bir,
]);
}
if($text == "6-Qism"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/74",
       'caption'=>"<b>Muhammad (S.A.V) hujjatli film 6-QISM
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Bir,
]);
}
if($text == "7-Qism"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/75",
       'caption'=>"<b>Muhammad (S.A.V) hujjatli film 7-QISM
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Bir,
]);
}
if($text == "8-Qism"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/76",
       'caption'=>"<b>Muhammad (S.A.V) hujjatli film 8-QISM
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Bir,
]);
}
if($text == "9-Qism"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/77",
       'caption'=>"<b>Muhammad (S.A.V) hujjatli film 9-QISM
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Bir,
]);
}
if($text == "10-Qism"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/78",
       'caption'=>"<b>Muhammad (S.A.V) hujjatli film 10-QISM
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Bir,
]);
}
if($text == "11-Qism"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/79",
       'caption'=>"<b>Muhammad (S.A.V) hujjatli film 11-QISM
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Bir,
]);
}
if($text == "12-Qism"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/80",
       'caption'=>"<b>Muhammad (S.A.V) hujjatli film 12-QISM
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Bir,
]);
}
if($text == "13-Qism"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/81",
       'caption'=>"<b>Muhammad (S.A.V) hujjatli film 13-QISM
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Bir,
]);
}
if($text == "14-Qism"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/82",
       'caption'=>"<b>Muhammad (S.A.V) hujjatli film 14-QISM
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Bir,
]);
}
if($text == "15-Qism"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/83",
       'caption'=>"<b>Muhammad (S.A.V) hujjatli film 5-QISM
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Bir,
]);
}
if($text == "16-Qism"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/84",
       'caption'=>"<b>Muhammad (S.A.V) hujjatli film 16-QISM
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Bir,
]);
}
if($text == "17-Qism"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/85",
       'caption'=>"<b>Muhammad (S.A.V) hujjatli film 17-QISM
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Bir,
]);
}
if($text == "18-Qism"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/86",
       'caption'=>"<b>Muhammad (S.A.V) hujjatli film 18-QISM
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Bir,
]);
}
if($text == "19-Qism"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/87",
       'caption'=>"<b>Muhammad (S.A.V) hujjatli film 19-QISM
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Bir,
]);
}
if($text == "20-Qism"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/88",
       'caption'=>"<b>Muhammad (S.A.V) hujjatli film 20-QISM
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Bir,
]);
}
if($text == "21-Qism"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/89",
       'caption'=>"<b>Muhammad (S.A.V) hujjatli film 21-QISM
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Bir,
]);
}
if($text == "22-Qism"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/90",
       'caption'=>"<b>Muhammad (S.A.V) hujjatli film 22-QISM
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Bir,
]);
}
if($text == "23-Qism"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/91",
       'caption'=>"<b>Muhammad (S.A.V) hujjatli film 23-QISM
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Bir,
]);
}
if($text == "24-Qism"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/92",
       'caption'=>"<b>Muhammad (S.A.V) hujjatli film 24-QISM
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Bir,
]);
}
if($text == "25-Qism"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/93",
       'caption'=>"<b>Muhammad (S.A.V) hujjatli film 25-QISM
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Bir,
]);
}
if($text == "Rasulullohning Oilasi"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/94",
       'caption'=>"<b>Rasulullohning  Oilasi hujjatli film 
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Bir,
]);
}
if($text == "📜Sahobalar hayoti 1-qism"){
    bot('sendMessage',[
    'chat_id'=>$cid,
    'text'=>"<b>📜Sahobalar hayoti 1-qism</b> <i>boʻlimiga xush kelibsiz Marhamat ozingizga kerakli sahobani tanlang</i>",
    'parse_mode'=>"html",
    'reply_markup'=>$sahoba,
]);
}
if($text == "Сахобалар фазилати"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/95",
       'caption'=>"<b> Сахобалар фазилати
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sahoba,
]);
}
if($text == "Муоз ибн Жабал розияллоҳу анҳу"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/96",
       'caption'=>"<b> Муоз ибн Жабал розияллоҳу анҳу
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sahoba,
]);
}
if($text == "Муоз ибн Жабал розияллоҳу анҳу 2"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/97",
       'caption'=>"<b> Муоз ибн Жабал розияллоҳу анҳу 2
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sahoba,
]);
}
if($text == "Абдуллоҳ ибн Масъуд розияллоҳу анҳу"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/98",
       'caption'=>"<b> Абдуллоҳ ибн Масъуд розияллоҳу анҳу
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sahoba,
]);
}
if($text == "Абдуллоҳ ибн Масъуд розияллоҳу анҳу 2"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/99",
       'caption'=>"<b> Абдуллоҳ ибн Масъуд розияллоҳу анҳу 2
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sahoba,
]);
}
if($text == "Талха ибн Убайдуллоҳ розияллоҳу анҳу"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/100",
       'caption'=>"<b> Талха ибн Убайдуллоҳ розияллоҳу анҳу
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sahoba,
]);
}
if($text == "Зубайр ибн Аввом розияллоҳу анҳу"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/101",
       'caption'=>"<b> Зубайр ибн Аввом розияллоҳу анҳу
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sahoba,
]);
}
if($text == "Абдураҳмон ибн Авф розияллоҳу анҳу"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/102",
       'caption'=>"<b> Абдураҳмон ибн Авф розияллоҳу анҳу
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sahoba,
]);
}
if($text == "Абдураҳмон ибн Авф розияллоҳу анҳу 2"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/103",
       'caption'=>"<b> Абдураҳмон ибн Авф розияллоҳу анҳу 2
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sahoba,
]);
}
if($text == "Са'д ибн Аби Ваққос розияллоҳу анҳу"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/104",
       'caption'=>"<b> Са'д ибн Аби Ваққос розияллоҳу анҳу
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sahoba,
]);
}
if($text == "Са'д ибн Аби Ваққос розияллоҳу анҳу 2"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/105",
       'caption'=>"<b> Са'д ибн Аби Ваққос розияллоҳу анҳу 2
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sahoba,
]);
}
if($text == "Са'ид ибн Зайид Розияллоҳу анҳу"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/106",
       'caption'=>"<b> Са'ид ибн Зайид Розияллоҳу анҳу
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sahoba,
]);
}
if($text == "Абу Убайда Розияллоҳу анҳу"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/107",
       'caption'=>"<b> Абу Убайда Розияллоҳу анҳу
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sahoba,
]);
}
if($text == "Абу Убайда Розияллоҳу анҳу 2"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/108",
       'caption'=>"<b> Абу Убайда Розияллоҳу анҳу 2
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sahoba,
]);
}
if($text == "Зайд ибн Хориса розияллоҳу анҳу"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/109",
       'caption'=>"<b> Зайд ибн Хориса розияллоҳу анҳу
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sahoba,
]);
}
if($text == "Суроқа ибн Молик Розияллоҳу анҳу"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/110",
       'caption'=>"<b> Суроқа ибн Молик Розияллоҳу анҳу
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sahoba,
]);
}
if($text == "📜Sahobalar hayoti 2-qism"){
    bot('sendMessage',[
    'chat_id'=>$cid,
    'text'=>"<b>📜Sahobalar hayoti 2-qism</b> <i>boʻlimiga xush kelibsiz Marhamat ozingizga kerakli sahobani tanlang</i>",
    'parse_mode'=>"html",
    'reply_markup'=>$sahoba1,
]);
}
if($text == "Усома ибн Зайд Розияллоҳу анҳу"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/111",
       'caption'=>"<b> Усома ибн Зайд Розияллоҳу анҳу
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sahoba1,
]);
}
if($text == "Усома ибн Зайд Розияллоҳу анҳу 2"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/112",
       'caption'=>"<b> Усома ибн Зайд Розияллоҳу анҳу 2
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sahoba1,
]);
}
if($text == "Солим розияллоҳу анҳу"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/113",
       'caption'=>"<b> Солим розияллоҳу анҳу
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sahoba1,
]);
}
if($text == "Солим розияллоҳу анҳу 2"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/114",
       'caption'=>"<b> Солим розияллоҳу анҳу 2
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sahoba1,
]);
}
if($text == "Мусаб ибн умайр Розияллоҳу анҳу"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/115",
       'caption'=>"<b> Мусаб ибн умайр Розияллоҳу анҳу
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sahoba1,
]);
}
if($text == "Мусаб ибн умайр Розияллоҳу анҳу 2"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/116",
       'caption'=>"<b> Мусаб ибн умайр Розияллоҳу анҳу 2
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sahoba1,
]);
}
if($text == "Хамза розияллоҳу анҳу"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/117",
       'caption'=>"<b> Хамза розияллоҳу анҳу
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sahoba1,
]);
}
if($text == "Хузайфа ибн Йамон розияллоҳу анҳу"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/118",
       'caption'=>"<b> Хузайфа ибн Йамон розияллоҳу анҳу
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sahoba1,
]);
}
if($text == "Хузайфа ибн Йамон розияллоҳу анҳу 2"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/119",
       'caption'=>"<b> Хузайфа ибн Йамон розияллоҳу анҳу 2
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sahoba1,
]);
}
if($text == "Абу Айюб розияллоҳу анҳу"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/120",
       'caption'=>"<b> Абу Айюб розияллоҳу анҳу
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sahoba1,
]);
}
if($text == "Туфайл розияллоҳу анҳу"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/121",
       'caption'=>"<b> Туфайл розияллоҳу анҳу
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sahoba1,
]);
}
if($text == "Жа'фар ибн Аби Толиб розияллоҳу анҳу"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/122",
       'caption'=>"<b> Жа'фар ибн Аби Толиб розияллоҳу анҳу
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sahoba1,
]);
}
if($text == "Жа'фар ибн Аби Толиб розияллоҳу анҳу 2"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/123",
       'caption'=>"<b> Жа'фар ибн Аби Толиб розияллоҳу анҳу 2
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sahoba1,
]);
}
if($text == "Кааб ибн Молик Розияллоҳу анҳу"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/124",
       'caption'=>"<b> Кааб ибн Молик Розияллоҳу анҳу
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sahoba1,
]);
}
if($text == "Абу Суфён ибн Ҳорис Розияллоҳу анҳу"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/125",
       'caption'=>"<b> Абу Суфён ибн Ҳорис Розияллоҳу анҳу
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sahoba1,
]);
}
if($text == "Абул Ос ибн Робиа розияллоҳу анҳу"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/126",
       'caption'=>"<b> Абул Ос ибн Робиа розияллоҳу анҳу
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sahoba1,
]);
}
if($text == "Абул Ос ибн Робиа розияллоҳу анҳу 2"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/127",
       'caption'=>"<b> Абул Ос ибн Робиа розияллоҳу анҳу 2
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sahoba1,
]);
}
if($text == "Наим ибн Масуд розияллоҳу анҳ"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/128",
       'caption'=>"<b> Наим ибн Масуд розияллоҳу анҳ
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sahoba1,
]);
}
if($text == "Абдуллох ибн Саллам розияллоҳу анҳу"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/129",
       'caption'=>"<b> Абдуллох ибн Саллам розияллоҳу анҳу
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sahoba1,
]);
}
if($text == "⏰Namoz Vaqtlari"){
    bot('sendMessage',[
    'chat_id'=>$cid,
    'text'=>"<b>⏰Namoz Vaqtlari</b> <i>boʻlimiga xush kelibsiz Marhamat ozingizga kerakli viloyatni tanlang</i>",
    'parse_mode'=>"html",
    'reply_markup'=>$namooz,
]);
}
if($text == "🏙Farg'ona"){
$sayt = file_get_contents('http://uzsmart.ru/namoz-vaqtlari/shahar/Farg%60ona.html');
//bobdod
$bob = explode('<td><b>Tong (sahar)</b></td> <td>',"$sayt");
$bob2 = explode('</td>',"$bob[1]");
$bobdod = str_replace("$bob[1]"," ","$bob2[0]");
//quyosh
$quy = explode('<td><b>Quyosh</b></td> <td>',"$sayt");
$quy2 = explode('</td>',"$quy[1]");
$quyosh = str_replace("$quy[1]"," ","$quy2[0]");
//peshin
$pesh= explode('<td><b>Pеshin</b></td> <td>',"$sayt");
$pesh2 = explode('</td>',"$pesh[1]");
$pеshin = str_replace("$pesh[1]"," ","$pesh2[0]");
//asr
$as= explode('<td><b>Asr</b></td> <td>',"$sayt");
$as2 = explode('</td>',"$as[1]");
$asr = str_replace("$as[1]"," ","$as2[0]");
//shom
$sho= explode('<td><b>Shom (iftor)</b></td> <td>',"$sayt");
$sho2 = explode('</td>',"$sho[1]");
$shom = str_replace("$sho[1]"," ","$sho2[0]");
//xufton
$xuf= explode('<td><b>Xufton</b></td> <td>',"$sayt");
$xuf2 = explode('</td>',"$xuf[1]");
$xufton = str_replace("$xuf[1]"," ","$xuf2[0]");
$yil = date("Y",strtotime("5 hour"));
$Y = str_replace(["2021","2021","2022"],["2021","2021","2022"], $yil);
$kun = date("d",strtotime("2 hour"));
$d = str_replace(["0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31"],["0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31"], $kun);
$okun=date("n");
$oynoms = "1Yᴀɴᴠᴀʀ1 2Fᴇᴠʀᴀʟ2 3Mᴀʀᴛ3 4Aᴘʀᴇʟ4 5Mᴀʏ5 6Iʏᴜɴ6 7Iʏᴜʟ7 8Aᴠɢᴜsᴛ8 9Sᴇɴᴛᴀʙʀ9 11Oᴋᴛᴀʙʀ10 11Nᴏʏᴀʙʀ11 12Dᴇᴋᴀʙʀ12";
$ex2 = explode("$okun",$oynoms);
$oy = "$ex2[1]";
$haf = date('N',strtotime('2 hour'));
$haft="1Dᴜsʜᴀɴʙᴀ1 2Sᴇsʜᴀɴʙᴀ2 3Cʜᴏʀsʜᴀɴʙᴀ3 4Pᴀʏsʜᴀɴʙᴀ4 5Jᴜᴍᴀ5 6Sʜᴀɴʙᴀ6 7Yᴀᴋsʜᴀɴʙᴀ7";
$ex=explode("$haf",$haft);
$hafta="$ex[1]";

bot('sendPhoto',[
'chat_id'=>$cid,
'photo'=>"https://t.me/TARIINISG/130",
'caption'=>"Namoz vaqtlari
=========================
📌 《 🏙 Farg'ona 》 vaqti bilan
--------------------------------------------
🌓  Tong:          -  $bobdod
🌞  Quyosh:     -  $quyosh

🕰  Bomdod:   -  $bobdod 
🕰  Peshin:      -  $pеshin 
🕰  Asr:            -  $asr 
🕰  Shom:        -  $shom 
🕰  Xufton:       -  $xufton
--------------------------------------------

📅 $Y yil $d $oy, $hafta",
'parse_mode'=>'html',
'reply_markup'=>$namooz,
]);
}
if($text == "🏙Xiva"){
$sayt = file_get_contents('http://uzsmart.ru/namoz-vaqtlari/shahar/Xiva.html');
//bobdod
$bob = explode('<td><b>Tong (sahar)</b></td> <td>',"$sayt");
$bob2 = explode('</td>',"$bob[1]");
$bobdod = str_replace("$bob[1]"," ","$bob2[0]");
//quyosh
$quy = explode('<td><b>Quyosh</b></td> <td>',"$sayt");
$quy2 = explode('</td>',"$quy[1]");
$quyosh = str_replace("$quy[1]"," ","$quy2[0]");
//peshin
$pesh= explode('<td><b>Pеshin</b></td> <td>',"$sayt");
$pesh2 = explode('</td>',"$pesh[1]");
$pеshin = str_replace("$pesh[1]"," ","$pesh2[0]");
//asr
$as= explode('<td><b>Asr</b></td> <td>',"$sayt");
$as2 = explode('</td>',"$as[1]");
$asr = str_replace("$as[1]"," ","$as2[0]");
//shom
$sho= explode('<td><b>Shom (iftor)</b></td> <td>',"$sayt");
$sho2 = explode('</td>',"$sho[1]");
$shom = str_replace("$sho[1]"," ","$sho2[0]");
//xufton
$xuf= explode('<td><b>Xufton</b></td> <td>',"$sayt");
$xuf2 = explode('</td>',"$xuf[1]");
$xufton = str_replace("$xuf[1]"," ","$xuf2[0]");
$yil = date("Y",strtotime("5 hour"));
$Y = str_replace(["2021","2021","2022"],["2021","2021","2022"], $yil);
$kun = date("d",strtotime("2 hour"));
$d = str_replace(["0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31"],["0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31"], $kun);
$okun=date("n");
$oynoms = "1Yᴀɴᴠᴀʀ1 2Fᴇᴠʀᴀʟ2 3Mᴀʀᴛ3 4Aᴘʀᴇʟ4 5Mᴀʏ5 6Iʏᴜɴ6 7Iʏᴜʟ7 8Aᴠɢᴜsᴛ8 9Sᴇɴᴛᴀʙʀ9 11Oᴋᴛᴀʙʀ10 11Nᴏʏᴀʙʀ11 12Dᴇᴋᴀʙʀ12";
$ex2 = explode("$okun",$oynoms);
$oy = "$ex2[1]";
$haf = date('N',strtotime('2 hour'));
$haft="1Dᴜsʜᴀɴʙᴀ1 2Sᴇsʜᴀɴʙᴀ2 3Cʜᴏʀsʜᴀɴʙᴀ3 4Pᴀʏsʜᴀɴʙᴀ4 5Jᴜᴍᴀ5 6Sʜᴀɴʙᴀ6 7Yᴀᴋsʜᴀɴʙᴀ7";
$ex=explode("$haf",$haft);
$hafta="$ex[1]";

bot('sendPhoto',[
'chat_id'=>$cid,
'photo'=>"https://t.me/TARIINISG/130",
'caption'=>"Namoz vaqtlari
=========================
📌 《 🏙 Xiva 》 vaqti bilan
--------------------------------------------
🌓  Tong:          -  $bobdod
🌞  Quyosh:     -  $quyosh

🕰  Bomdod:   -  $bobdod 
🕰  Peshin:      -  $pеshin 
🕰  Asr:            -  $asr 
🕰  Shom:        -  $shom 
🕰  Xufton:       -  $xufton
--------------------------------------------

📅 $Y yil $d $oy, $hafta",
'parse_mode'=>'html',
'reply_markup'=>$namooz,
]);
}
if($text == "🏙Andijon"){
$sayt = file_get_contents('http://uzsmart.ru/namoz-vaqtlari/shahar/Andijon.html');
//bobdod
$bob = explode('<td><b>Tong (sahar)</b></td> <td>',"$sayt");
$bob2 = explode('</td>',"$bob[1]");
$bobdod = str_replace("$bob[1]"," ","$bob2[0]");
//quyosh
$quy = explode('<td><b>Quyosh</b></td> <td>',"$sayt");
$quy2 = explode('</td>',"$quy[1]");
$quyosh = str_replace("$quy[1]"," ","$quy2[0]");
//peshin
$pesh= explode('<td><b>Pеshin</b></td> <td>',"$sayt");
$pesh2 = explode('</td>',"$pesh[1]");
$pеshin = str_replace("$pesh[1]"," ","$pesh2[0]");
//asr
$as= explode('<td><b>Asr</b></td> <td>',"$sayt");
$as2 = explode('</td>',"$as[1]");
$asr = str_replace("$as[1]"," ","$as2[0]");
//shom
$sho= explode('<td><b>Shom (iftor)</b></td> <td>',"$sayt");
$sho2 = explode('</td>',"$sho[1]");
$shom = str_replace("$sho[1]"," ","$sho2[0]");
//xufton
$xuf= explode('<td><b>Xufton</b></td> <td>',"$sayt");
$xuf2 = explode('</td>',"$xuf[1]");
$xufton = str_replace("$xuf[1]"," ","$xuf2[0]");
$yil = date("Y",strtotime("5 hour"));
$Y = str_replace(["2021","2021","2022"],["2021","2021","2022"], $yil);
$kun = date("d",strtotime("2 hour"));
$d = str_replace(["0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31"],["0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31"], $kun);
$okun=date("n");
$oynoms = "1Yᴀɴᴠᴀʀ1 2Fᴇᴠʀᴀʟ2 3Mᴀʀᴛ3 4Aᴘʀᴇʟ4 5Mᴀʏ5 6Iʏᴜɴ6 7Iʏᴜʟ7 8Aᴠɢᴜsᴛ8 9Sᴇɴᴛᴀʙʀ9 11Oᴋᴛᴀʙʀ10 11Nᴏʏᴀʙʀ11 12Dᴇᴋᴀʙʀ12";
$ex2 = explode("$okun",$oynoms);
$oy = "$ex2[1]";
$haf = date('N',strtotime('2 hour'));
$haft="1Dᴜsʜᴀɴʙᴀ1 2Sᴇsʜᴀɴʙᴀ2 3Cʜᴏʀsʜᴀɴʙᴀ3 4Pᴀʏsʜᴀɴʙᴀ4 5Jᴜᴍᴀ5 6Sʜᴀɴʙᴀ6 7Yᴀᴋsʜᴀɴʙᴀ7";
$ex=explode("$haf",$haft);
$hafta="$ex[1]";

bot('sendPhoto',[
'chat_id'=>$cid,
'photo'=>"https://t.me/TARIINISG/130",
'caption'=>"Namoz vaqtlari
=========================
📌 《 🏙 Andijon 》 vaqti bilan
--------------------------------------------
🌓  Tong:          -  $bobdod
🌞  Quyosh:     -  $quyosh

🕰  Bomdod:   -  $bobdod 
🕰  Peshin:      -  $pеshin 
🕰  Asr:            -  $asr 
🕰  Shom:        -  $shom 
🕰  Xufton:       -  $xufton
--------------------------------------------

📅 $Y yil $d $oy, $hafta",
'parse_mode'=>'html',
'reply_markup'=>$namooz,
]);
}
if($text == "🏙Namangan"){
$sayt = file_get_contents('http://uzsmart.ru/namoz-vaqtlari/shahar/Jambul.html');
//bobdod
$bob = explode('<td><b>Tong (sahar)</b></td> <td>',"$sayt");
$bob2 = explode('</td>',"$bob[1]");
$bobdod = str_replace("$bob[1]"," ","$bob2[0]");
//quyosh
$quy = explode('<td><b>Quyosh</b></td> <td>',"$sayt");
$quy2 = explode('</td>',"$quy[1]");
$quyosh = str_replace("$quy[1]"," ","$quy2[0]");
//peshin
$pesh= explode('<td><b>Pеshin</b></td> <td>',"$sayt");
$pesh2 = explode('</td>',"$pesh[1]");
$pеshin = str_replace("$pesh[1]"," ","$pesh2[0]");
//asr
$as= explode('<td><b>Asr</b></td> <td>',"$sayt");
$as2 = explode('</td>',"$as[1]");
$asr = str_replace("$as[1]"," ","$as2[0]");
//shom
$sho= explode('<td><b>Shom (iftor)</b></td> <td>',"$sayt");
$sho2 = explode('</td>',"$sho[1]");
$shom = str_replace("$sho[1]"," ","$sho2[0]");
//xufton
$xuf= explode('<td><b>Xufton</b></td> <td>',"$sayt");
$xuf2 = explode('</td>',"$xuf[1]");
$xufton = str_replace("$xuf[1]"," ","$xuf2[0]");
$yil = date("Y",strtotime("5 hour"));
$Y = str_replace(["2021","2021","2022"],["2021","2021","2022"], $yil);
$kun = date("d",strtotime("2 hour"));
$d = str_replace(["0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31"],["0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31"], $kun);
$okun=date("n");
$oynoms = "1Yᴀɴᴠᴀʀ1 2Fᴇᴠʀᴀʟ2 3Mᴀʀᴛ3 4Aᴘʀᴇʟ4 5Mᴀʏ5 6Iʏᴜɴ6 7Iʏᴜʟ7 8Aᴠɢᴜsᴛ8 9Sᴇɴᴛᴀʙʀ9 11Oᴋᴛᴀʙʀ10 11Nᴏʏᴀʙʀ11 12Dᴇᴋᴀʙʀ12";
$ex2 = explode("$okun",$oynoms);
$oy = "$ex2[1]";
$haf = date('N',strtotime('2 hour'));
$haft="1Dᴜsʜᴀɴʙᴀ1 2Sᴇsʜᴀɴʙᴀ2 3Cʜᴏʀsʜᴀɴʙᴀ3 4Pᴀʏsʜᴀɴʙᴀ4 5Jᴜᴍᴀ5 6Sʜᴀɴʙᴀ6 7Yᴀᴋsʜᴀɴʙᴀ7";
$ex=explode("$haf",$haft);
$hafta="$ex[1]";

bot('sendPhoto',[
'chat_id'=>$cid,
'photo'=>"https://t.me/TARIINISG/130",
'caption'=>"Namoz vaqtlari
=========================
📌 《 🏙 Namangan 》 vaqti bilan
--------------------------------------------
🌓  Tong:          -  $bobdod
🌞  Quyosh:     -  $quyosh

🕰  Bomdod:   -  $bobdod 
🕰  Peshin:      -  $pеshin 
🕰  Asr:            -  $asr 
🕰  Shom:        -  $shom 
🕰  Xufton:       -  $xufton
--------------------------------------------

📅 $Y yil $d $oy, $hafta",
'parse_mode'=>'html',
'reply_markup'=>$namooz,
]);
}
if($text == "🏙Buxoro"){
$sayt = file_get_contents('http://uzsmart.ru/namoz-vaqtlari/shahar/Buxoro.html');
//bobdod
$bob = explode('<td><b>Tong (sahar)</b></td> <td>',"$sayt");
$bob2 = explode('</td>',"$bob[1]");
$bobdod = str_replace("$bob[1]"," ","$bob2[0]");
//quyosh
$quy = explode('<td><b>Quyosh</b></td> <td>',"$sayt");
$quy2 = explode('</td>',"$quy[1]");
$quyosh = str_replace("$quy[1]"," ","$quy2[0]");
//peshin
$pesh= explode('<td><b>Pеshin</b></td> <td>',"$sayt");
$pesh2 = explode('</td>',"$pesh[1]");
$pеshin = str_replace("$pesh[1]"," ","$pesh2[0]");
//asr
$as= explode('<td><b>Asr</b></td> <td>',"$sayt");
$as2 = explode('</td>',"$as[1]");
$asr = str_replace("$as[1]"," ","$as2[0]");
//shom
$sho= explode('<td><b>Shom (iftor)</b></td> <td>',"$sayt");
$sho2 = explode('</td>',"$sho[1]");
$shom = str_replace("$sho[1]"," ","$sho2[0]");
//xufton
$xuf= explode('<td><b>Xufton</b></td> <td>',"$sayt");
$xuf2 = explode('</td>',"$xuf[1]");
$xufton = str_replace("$xuf[1]"," ","$xuf2[0]");
$yil = date("Y",strtotime("5 hour"));
$Y = str_replace(["2021","2021","2022"],["2021","2021","2022"], $yil);
$kun = date("d",strtotime("2 hour"));
$d = str_replace(["0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31"],["0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31"], $kun);
$okun=date("n");
$oynoms = "1Yᴀɴᴠᴀʀ1 2Fᴇᴠʀᴀʟ2 3Mᴀʀᴛ3 4Aᴘʀᴇʟ4 5Mᴀʏ5 6Iʏᴜɴ6 7Iʏᴜʟ7 8Aᴠɢᴜsᴛ8 9Sᴇɴᴛᴀʙʀ9 11Oᴋᴛᴀʙʀ10 11Nᴏʏᴀʙʀ11 12Dᴇᴋᴀʙʀ12";
$ex2 = explode("$okun",$oynoms);
$oy = "$ex2[1]";
$haf = date('N',strtotime('2 hour'));
$haft="1Dᴜsʜᴀɴʙᴀ1 2Sᴇsʜᴀɴʙᴀ2 3Cʜᴏʀsʜᴀɴʙᴀ3 4Pᴀʏsʜᴀɴʙᴀ4 5Jᴜᴍᴀ5 6Sʜᴀɴʙᴀ6 7Yᴀᴋsʜᴀɴʙᴀ7";
$ex=explode("$haf",$haft);
$hafta="$ex[1]";

bot('sendPhoto',[
'chat_id'=>$cid,
'photo'=>"https://t.me/TARIINISG/130",
'caption'=>"Namoz vaqtlari
=========================
📌 《 🏙 Buxoro 》 vaqti bilan
--------------------------------------------
🌓  Tong:          -  $bobdod
🌞  Quyosh:     -  $quyosh

🕰  Bomdod:   -  $bobdod 
🕰  Peshin:      -  $pеshin 
🕰  Asr:            -  $asr 
🕰  Shom:        -  $shom 
🕰  Xufton:       -  $xufton
--------------------------------------------

📅 $Y yil $d $oy, $hafta",
'parse_mode'=>'html',
'reply_markup'=>$namooz,
]);
}
if($text == "🏙Guliston"){
$sayt = file_get_contents('http://uzsmart.ru/namoz-vaqtlari/shahar/Guliston.html');
//bobdod
$bob = explode('<td><b>Tong (sahar)</b></td> <td>',"$sayt");
$bob2 = explode('</td>',"$bob[1]");
$bobdod = str_replace("$bob[1]"," ","$bob2[0]");
//quyosh
$quy = explode('<td><b>Quyosh</b></td> <td>',"$sayt");
$quy2 = explode('</td>',"$quy[1]");
$quyosh = str_replace("$quy[1]"," ","$quy2[0]");
//peshin
$pesh= explode('<td><b>Pеshin</b></td> <td>',"$sayt");
$pesh2 = explode('</td>',"$pesh[1]");
$pеshin = str_replace("$pesh[1]"," ","$pesh2[0]");
//asr
$as= explode('<td><b>Asr</b></td> <td>',"$sayt");
$as2 = explode('</td>',"$as[1]");
$asr = str_replace("$as[1]"," ","$as2[0]");
//shom
$sho= explode('<td><b>Shom (iftor)</b></td> <td>',"$sayt");
$sho2 = explode('</td>',"$sho[1]");
$shom = str_replace("$sho[1]"," ","$sho2[0]");
//xufton
$xuf= explode('<td><b>Xufton</b></td> <td>',"$sayt");
$xuf2 = explode('</td>',"$xuf[1]");
$xufton = str_replace("$xuf[1]"," ","$xuf2[0]");
$yil = date("Y",strtotime("5 hour"));
$Y = str_replace(["2021","2021","2022"],["2021","2021","2022"], $yil);
$kun = date("d",strtotime("2 hour"));
$d = str_replace(["0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31"],["0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31"], $kun);
$okun=date("n");
$oynoms = "1Yᴀɴᴠᴀʀ1 2Fᴇᴠʀᴀʟ2 3Mᴀʀᴛ3 4Aᴘʀᴇʟ4 5Mᴀʏ5 6Iʏᴜɴ6 7Iʏᴜʟ7 8Aᴠɢᴜsᴛ8 9Sᴇɴᴛᴀʙʀ9 11Oᴋᴛᴀʙʀ10 11Nᴏʏᴀʙʀ11 12Dᴇᴋᴀʙʀ12";
$ex2 = explode("$okun",$oynoms);
$oy = "$ex2[1]";
$haf = date('N',strtotime('2 hour'));
$haft="1Dᴜsʜᴀɴʙᴀ1 2Sᴇsʜᴀɴʙᴀ2 3Cʜᴏʀsʜᴀɴʙᴀ3 4Pᴀʏsʜᴀɴʙᴀ4 5Jᴜᴍᴀ5 6Sʜᴀɴʙᴀ6 7Yᴀᴋsʜᴀɴʙᴀ7";
$ex=explode("$haf",$haft);
$hafta="$ex[1]";

bot('sendPhoto',[
'chat_id'=>$cid,
'photo'=>"https://t.me/TARIINISG/130",
'caption'=>"Namoz vaqtlari
=========================
📌 《 🏙 Guliston 》 vaqti bilan
--------------------------------------------
🌓  Tong:          -  $bobdod
🌞  Quyosh:     -  $quyosh

🕰  Bomdod:   -  $bobdod 
🕰  Peshin:      -  $pеshin 
🕰  Asr:            -  $asr 
🕰  Shom:        -  $shom 
🕰  Xufton:       -  $xufton
--------------------------------------------

📅 $Y yil $d $oy, $hafta",
'parse_mode'=>'html',
'reply_markup'=>$namooz,
]);
}
if($text == "🏙Jizzax"){
$sayt = file_get_contents('http://uzsmart.ru/namoz-vaqtlari/shahar/Jizzax.html');
//bobdod
$bob = explode('<td><b>Tong (sahar)</b></td> <td>',"$sayt");
$bob2 = explode('</td>',"$bob[1]");
$bobdod = str_replace("$bob[1]"," ","$bob2[0]");
//quyosh
$quy = explode('<td><b>Quyosh</b></td> <td>',"$sayt");
$quy2 = explode('</td>',"$quy[1]");
$quyosh = str_replace("$quy[1]"," ","$quy2[0]");
//peshin
$pesh= explode('<td><b>Pеshin</b></td> <td>',"$sayt");
$pesh2 = explode('</td>',"$pesh[1]");
$pеshin = str_replace("$pesh[1]"," ","$pesh2[0]");
//asr
$as= explode('<td><b>Asr</b></td> <td>',"$sayt");
$as2 = explode('</td>',"$as[1]");
$asr = str_replace("$as[1]"," ","$as2[0]");
//shom
$sho= explode('<td><b>Shom (iftor)</b></td> <td>',"$sayt");
$sho2 = explode('</td>',"$sho[1]");
$shom = str_replace("$sho[1]"," ","$sho2[0]");
//xufton
$xuf= explode('<td><b>Xufton</b></td> <td>',"$sayt");
$xuf2 = explode('</td>',"$xuf[1]");
$xufton = str_replace("$xuf[1]"," ","$xuf2[0]");
$yil = date("Y",strtotime("5 hour"));
$Y = str_replace(["2021","2021","2022"],["2021","2021","2022"], $yil);
$kun = date("d",strtotime("2 hour"));
$d = str_replace(["0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31"],["0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31"], $kun);
$okun=date("n");
$oynoms = "1Yᴀɴᴠᴀʀ1 2Fᴇᴠʀᴀʟ2 3Mᴀʀᴛ3 4Aᴘʀᴇʟ4 5Mᴀʏ5 6Iʏᴜɴ6 7Iʏᴜʟ7 8Aᴠɢᴜsᴛ8 9Sᴇɴᴛᴀʙʀ9 11Oᴋᴛᴀʙʀ10 11Nᴏʏᴀʙʀ11 12Dᴇᴋᴀʙʀ12";
$ex2 = explode("$okun",$oynoms);
$oy = "$ex2[1]";
$haf = date('N',strtotime('2 hour'));
$haft="1Dᴜsʜᴀɴʙᴀ1 2Sᴇsʜᴀɴʙᴀ2 3Cʜᴏʀsʜᴀɴʙᴀ3 4Pᴀʏsʜᴀɴʙᴀ4 5Jᴜᴍᴀ5 6Sʜᴀɴʙᴀ6 7Yᴀᴋsʜᴀɴʙᴀ7";
$ex=explode("$haf",$haft);
$hafta="$ex[1]";

bot('sendPhoto',[
'chat_id'=>$cid,
'photo'=>"https://t.me/TARIINISG/130",
'caption'=>"Namoz vaqtlari
=========================
📌 《 🏙 Jizzax 》 vaqti bilan
--------------------------------------------
🌓  Tong:          -  $bobdod
🌞  Quyosh:     -  $quyosh

🕰  Bomdod:   -  $bobdod 
🕰  Peshin:      -  $pеshin 
🕰  Asr:            -  $asr 
🕰  Shom:        -  $shom 
🕰  Xufton:       -  $xufton
--------------------------------------------

📅 $Y yil $d $oy, $hafta",
'parse_mode'=>'html',
'reply_markup'=>$namooz,
]);
}
if($text == "🏙Zarafshon"){
$sayt = file_get_contents('http://uzsmart.ru/namoz-vaqtlari/shahar/Nurota.html');
//bobdod
$bob = explode('<td><b>Tong (sahar)</b></td> <td>',"$sayt");
$bob2 = explode('</td>',"$bob[1]");
$bobdod = str_replace("$bob[1]"," ","$bob2[0]");
//quyosh
$quy = explode('<td><b>Quyosh</b></td> <td>',"$sayt");
$quy2 = explode('</td>',"$quy[1]");
$quyosh = str_replace("$quy[1]"," ","$quy2[0]");
//peshin
$pesh= explode('<td><b>Pеshin</b></td> <td>',"$sayt");
$pesh2 = explode('</td>',"$pesh[1]");
$pеshin = str_replace("$pesh[1]"," ","$pesh2[0]");
//asr
$as= explode('<td><b>Asr</b></td> <td>',"$sayt");
$as2 = explode('</td>',"$as[1]");
$asr = str_replace("$as[1]"," ","$as2[0]");
//shom
$sho= explode('<td><b>Shom (iftor)</b></td> <td>',"$sayt");
$sho2 = explode('</td>',"$sho[1]");
$shom = str_replace("$sho[1]"," ","$sho2[0]");
//xufton
$xuf= explode('<td><b>Xufton</b></td> <td>',"$sayt");
$xuf2 = explode('</td>',"$xuf[1]");
$xufton = str_replace("$xuf[1]"," ","$xuf2[0]");
$yil = date("Y",strtotime("5 hour"));
$Y = str_replace(["2021","2021","2022"],["2021","2021","2022"], $yil);
$kun = date("d",strtotime("2 hour"));
$d = str_replace(["0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31"],["0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31"], $kun);
$okun=date("n");
$oynoms = "1Yᴀɴᴠᴀʀ1 2Fᴇᴠʀᴀʟ2 3Mᴀʀᴛ3 4Aᴘʀᴇʟ4 5Mᴀʏ5 6Iʏᴜɴ6 7Iʏᴜʟ7 8Aᴠɢᴜsᴛ8 9Sᴇɴᴛᴀʙʀ9 11Oᴋᴛᴀʙʀ10 11Nᴏʏᴀʙʀ11 12Dᴇᴋᴀʙʀ12";
$ex2 = explode("$okun",$oynoms);
$oy = "$ex2[1]";
$haf = date('N',strtotime('2 hour'));
$haft="1Dᴜsʜᴀɴʙᴀ1 2Sᴇsʜᴀɴʙᴀ2 3Cʜᴏʀsʜᴀɴʙᴀ3 4Pᴀʏsʜᴀɴʙᴀ4 5Jᴜᴍᴀ5 6Sʜᴀɴʙᴀ6 7Yᴀᴋsʜᴀɴʙᴀ7";
$ex=explode("$haf",$haft);
$hafta="$ex[1]";


bot('sendPhoto',[
'chat_id'=>$cid,
'photo'=>"https://t.me/TARIINISG/130",
'caption'=>"Namoz vaqtlari
=========================
📌 《 🏙 Zarafshon 》 vaqti bilan
--------------------------------------------
🌓  Tong:          -  $bobdod
🌞  Quyosh:     -  $quyosh

🕰  Bomdod:   -  $bobdod 
🕰  Peshin:      -  $pеshin 
🕰  Asr:            -  $asr 
🕰  Shom:        -  $shom 
🕰  Xufton:       -  $xufton
--------------------------------------------

📅 $Y yil $d $oy, $hafta",
'parse_mode'=>'html',
'reply_markup'=>$namooz,
]);
}
if($text == "🏙Qarshi"){
$sayt = file_get_contents('http://uzsmart.ru/namoz-vaqtlari/shahar/Qarshi.html');
//bobdod
$bob = explode('<td><b>Tong (sahar)</b></td> <td>',"$sayt");
$bob2 = explode('</td>',"$bob[1]");
$bobdod = str_replace("$bob[1]"," ","$bob2[0]");
//quyosh
$quy = explode('<td><b>Quyosh</b></td> <td>',"$sayt");
$quy2 = explode('</td>',"$quy[1]");
$quyosh = str_replace("$quy[1]"," ","$quy2[0]");
//peshin
$pesh= explode('<td><b>Pеshin</b></td> <td>',"$sayt");
$pesh2 = explode('</td>',"$pesh[1]");
$pеshin = str_replace("$pesh[1]"," ","$pesh2[0]");
//asr
$as= explode('<td><b>Asr</b></td> <td>',"$sayt");
$as2 = explode('</td>',"$as[1]");
$asr = str_replace("$as[1]"," ","$as2[0]");
//shom
$sho= explode('<td><b>Shom (iftor)</b></td> <td>',"$sayt");
$sho2 = explode('</td>',"$sho[1]");
$shom = str_replace("$sho[1]"," ","$sho2[0]");
//xufton
$xuf= explode('<td><b>Xufton</b></td> <td>',"$sayt");
$xuf2 = explode('</td>',"$xuf[1]");
$xufton = str_replace("$xuf[1]"," ","$xuf2[0]");
$yil = date("Y",strtotime("5 hour"));
$Y = str_replace(["2021","2021","2022"],["2021","2021","2022"], $yil);
$kun = date("d",strtotime("2 hour"));
$d = str_replace(["0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31"],["0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31"], $kun);
$okun=date("n");
$oynoms = "1Yᴀɴᴠᴀʀ1 2Fᴇᴠʀᴀʟ2 3Mᴀʀᴛ3 4Aᴘʀᴇʟ4 5Mᴀʏ5 6Iʏᴜɴ6 7Iʏᴜʟ7 8Aᴠɢᴜsᴛ8 9Sᴇɴᴛᴀʙʀ9 11Oᴋᴛᴀʙʀ10 11Nᴏʏᴀʙʀ11 12Dᴇᴋᴀʙʀ12";
$ex2 = explode("$okun",$oynoms);
$oy = "$ex2[1]";
$haf = date('N',strtotime('2 hour'));
$haft="1Dᴜsʜᴀɴʙᴀ1 2Sᴇsʜᴀɴʙᴀ2 3Cʜᴏʀsʜᴀɴʙᴀ3 4Pᴀʏsʜᴀɴʙᴀ4 5Jᴜᴍᴀ5 6Sʜᴀɴʙᴀ6 7Yᴀᴋsʜᴀɴʙᴀ7";
$ex=explode("$haf",$haft);
$hafta="$ex[1]";

bot('sendPhoto',[
'chat_id'=>$cid,
'photo'=>"https://t.me/TARIINISG/130",
'caption'=>"Namoz vaqtlari
=========================
📌 《 🏙 Qarshi 》 vaqti bilan
--------------------------------------------
🌓  Tong:          -  $bobdod
🌞  Quyosh:     -  $quyosh

🕰  Bomdod:   -  $bobdod 
🕰  Peshin:      -  $pеshin 
🕰  Asr:            -  $asr 
🕰  Shom:        -  $shom 
🕰  Xufton:       -  $xufton
--------------------------------------------

📅 $Y yil $d $oy, $hafta",
'parse_mode'=>'html',
'reply_markup'=>$namooz,
]);
}
if($text == "🏙Navoiy"){
$sayt = file_get_contents('http://uzsmart.ru/namoz-vaqtlari/shahar/Navoiy.html');
//bobdod
$bob = explode('<td><b>Tong (sahar)</b></td> <td>',"$sayt");
$bob2 = explode('</td>',"$bob[1]");
$bobdod = str_replace("$bob[1]"," ","$bob2[0]");
//quyosh
$quy = explode('<td><b>Quyosh</b></td> <td>',"$sayt");
$quy2 = explode('</td>',"$quy[1]");
$quyosh = str_replace("$quy[1]"," ","$quy2[0]");
//peshin
$pesh= explode('<td><b>Pеshin</b></td> <td>',"$sayt");
$pesh2 = explode('</td>',"$pesh[1]");
$pеshin = str_replace("$pesh[1]"," ","$pesh2[0]");
//asr
$as= explode('<td><b>Asr</b></td> <td>',"$sayt");
$as2 = explode('</td>',"$as[1]");
$asr = str_replace("$as[1]"," ","$as2[0]");
//shom
$sho= explode('<td><b>Shom (iftor)</b></td> <td>',"$sayt");
$sho2 = explode('</td>',"$sho[1]");
$shom = str_replace("$sho[1]"," ","$sho2[0]");
//xufton
$xuf= explode('<td><b>Xufton</b></td> <td>',"$sayt");
$xuf2 = explode('</td>',"$xuf[1]");
$xufton = str_replace("$xuf[1]"," ","$xuf2[0]");
$yil = date("Y",strtotime("5 hour"));
$Y = str_replace(["2021","2021","2022"],["2021","2021","2022"], $yil);
$kun = date("d",strtotime("2 hour"));
$d = str_replace(["0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31"],["0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31"], $kun);
$okun=date("n");
$oynoms = "1Yᴀɴᴠᴀʀ1 2Fᴇᴠʀᴀʟ2 3Mᴀʀᴛ3 4Aᴘʀᴇʟ4 5Mᴀʏ5 6Iʏᴜɴ6 7Iʏᴜʟ7 8Aᴠɢᴜsᴛ8 9Sᴇɴᴛᴀʙʀ9 11Oᴋᴛᴀʙʀ10 11Nᴏʏᴀʙʀ11 12Dᴇᴋᴀʙʀ12";
$ex2 = explode("$okun",$oynoms);
$oy = "$ex2[1]";
$haf = date('N',strtotime('2 hour'));
$haft="1Dᴜsʜᴀɴʙᴀ1 2Sᴇsʜᴀɴʙᴀ2 3Cʜᴏʀsʜᴀɴʙᴀ3 4Pᴀʏsʜᴀɴʙᴀ4 5Jᴜᴍᴀ5 6Sʜᴀɴʙᴀ6 7Yᴀᴋsʜᴀɴʙᴀ7";
$ex=explode("$haf",$haft);
$hafta="$ex[1]";


bot('sendPhoto',[
'chat_id'=>$cid,
'photo'=>"https://t.me/TARIINISG/130",
'caption'=>"Namoz vaqtlari
=========================
📌 《 🏙 Navoiy 》 vaqti bilan
--------------------------------------------
🌓  Tong:          -  $bobdod
🌞  Quyosh:     -  $quyosh

🕰  Bomdod:   -  $bobdod 
🕰  Peshin:      -  $pеshin 
🕰  Asr:            -  $asr 
🕰  Shom:        -  $shom 
🕰  Xufton:       -  $xufton
--------------------------------------------

📅 $Y yil $d $oy, $hafta",
'parse_mode'=>'html',
'reply_markup'=>$namooz,
]);
}
if($text == "🏙Nukus"){
$sayt = file_get_contents('http://uzsmart.ru/namoz-vaqtlari/shahar/Nukus.html');
//bobdod
$bob = explode('<td><b>Tong (sahar)</b></td> <td>',"$sayt");
$bob2 = explode('</td>',"$bob[1]");
$bobdod = str_replace("$bob[1]"," ","$bob2[0]");
//quyosh
$quy = explode('<td><b>Quyosh</b></td> <td>',"$sayt");
$quy2 = explode('</td>',"$quy[1]");
$quyosh = str_replace("$quy[1]"," ","$quy2[0]");
//peshin
$pesh= explode('<td><b>Pеshin</b></td> <td>',"$sayt");
$pesh2 = explode('</td>',"$pesh[1]");
$pеshin = str_replace("$pesh[1]"," ","$pesh2[0]");
//asr
$as= explode('<td><b>Asr</b></td> <td>',"$sayt");
$as2 = explode('</td>',"$as[1]");
$asr = str_replace("$as[1]"," ","$as2[0]");
//shom
$sho= explode('<td><b>Shom (iftor)</b></td> <td>',"$sayt");
$sho2 = explode('</td>',"$sho[1]");
$shom = str_replace("$sho[1]"," ","$sho2[0]");
//xufton
$xuf= explode('<td><b>Xufton</b></td> <td>',"$sayt");
$xuf2 = explode('</td>',"$xuf[1]");
$xufton = str_replace("$xuf[1]"," ","$xuf2[0]");
$yil = date("Y",strtotime("5 hour"));
$Y = str_replace(["2021","2021","2022"],["2021","2021","2022"], $yil);
$kun = date("d",strtotime("2 hour"));
$d = str_replace(["0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31"],["0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31"], $kun);
$okun=date("n");
$oynoms = "1Yᴀɴᴠᴀʀ1 2Fᴇᴠʀᴀʟ2 3Mᴀʀᴛ3 4Aᴘʀᴇʟ4 5Mᴀʏ5 6Iʏᴜɴ6 7Iʏᴜʟ7 8Aᴠɢᴜsᴛ8 9Sᴇɴᴛᴀʙʀ9 11Oᴋᴛᴀʙʀ10 11Nᴏʏᴀʙʀ11 12Dᴇᴋᴀʙʀ12";
$ex2 = explode("$okun",$oynoms);
$oy = "$ex2[1]";
$haf = date('N',strtotime('2 hour'));
$haft="1Dᴜsʜᴀɴʙᴀ1 2Sᴇsʜᴀɴʙᴀ2 3Cʜᴏʀsʜᴀɴʙᴀ3 4Pᴀʏsʜᴀɴʙᴀ4 5Jᴜᴍᴀ5 6Sʜᴀɴʙᴀ6 7Yᴀᴋsʜᴀɴʙᴀ7";
$ex=explode("$haf",$haft);
$hafta="$ex[1]";


bot('sendPhoto',[
'chat_id'=>$cid,
'photo'=>"https://t.me/TARIINISG/130",
'caption'=>"Namoz vaqtlari
=========================
📌 《 🏙 Nukus 》 vaqti bilan
--------------------------------------------
🌓  Tong:          -  $bobdod
🌞  Quyosh:     -  $quyosh

🕰  Bomdod:   -  $bobdod 
🕰  Peshin:      -  $pеshin 
🕰  Asr:            -  $asr 
🕰  Shom:        -  $shom 
🕰  Xufton:       -  $xufton
--------------------------------------------

📅 $Y yil $d $oy, $hafta",
'parse_mode'=>'html',
'reply_markup'=>$namooz,
]);
}
if($text == "🏙Samarqand"){
$sayt = file_get_contents('http://uzsmart.ru/namoz-vaqtlari/shahar/Samarqand.html');
//bobdod
$bob = explode('<td><b>Tong (sahar)</b></td> <td>',"$sayt");
$bob2 = explode('</td>',"$bob[1]");
$bobdod = str_replace("$bob[1]"," ","$bob2[0]");
//quyosh
$quy = explode('<td><b>Quyosh</b></td> <td>',"$sayt");
$quy2 = explode('</td>',"$quy[1]");
$quyosh = str_replace("$quy[1]"," ","$quy2[0]");
//peshin
$pesh= explode('<td><b>Pеshin</b></td> <td>',"$sayt");
$pesh2 = explode('</td>',"$pesh[1]");
$pеshin = str_replace("$pesh[1]"," ","$pesh2[0]");
//asr
$as= explode('<td><b>Asr</b></td> <td>',"$sayt");
$as2 = explode('</td>',"$as[1]");
$asr = str_replace("$as[1]"," ","$as2[0]");
//shom
$sho= explode('<td><b>Shom (iftor)</b></td> <td>',"$sayt");
$sho2 = explode('</td>',"$sho[1]");
$shom = str_replace("$sho[1]"," ","$sho2[0]");
//xufton
$xuf= explode('<td><b>Xufton</b></td> <td>',"$sayt");
$xuf2 = explode('</td>',"$xuf[1]");
$xufton = str_replace("$xuf[1]"," ","$xuf2[0]");
$yil = date("Y",strtotime("5 hour"));
$Y = str_replace(["2021","2021","2022"],["2021","2021","2022"], $yil);
$kun = date("d",strtotime("2 hour"));
$d = str_replace(["0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31"],["0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31"], $kun);
$okun=date("n");
$oynoms = "1Yᴀɴᴠᴀʀ1 2Fᴇᴠʀᴀʟ2 3Mᴀʀᴛ3 4Aᴘʀᴇʟ4 5Mᴀʏ5 6Iʏᴜɴ6 7Iʏᴜʟ7 8Aᴠɢᴜsᴛ8 9Sᴇɴᴛᴀʙʀ9 11Oᴋᴛᴀʙʀ10 11Nᴏʏᴀʙʀ11 12Dᴇᴋᴀʙʀ12";
$ex2 = explode("$okun",$oynoms);
$oy = "$ex2[1]";
$haf = date('N',strtotime('2 hour'));
$haft="1Dᴜsʜᴀɴʙᴀ1 2Sᴇsʜᴀɴʙᴀ2 3Cʜᴏʀsʜᴀɴʙᴀ3 4Pᴀʏsʜᴀɴʙᴀ4 5Jᴜᴍᴀ5 6Sʜᴀɴʙᴀ6 7Yᴀᴋsʜᴀɴʙᴀ7";
$ex=explode("$haf",$haft);
$hafta="$ex[1]";


bot('sendPhoto',[
'chat_id'=>$cid,
'photo'=>"https://t.me/TARIINISG/130",
'caption'=>"Namoz vaqtlari
=========================
📌 《 🏙 Samarqand 》 vaqti bilan
--------------------------------------------
🌓  Tong:          -  $bobdod
🌞  Quyosh:     -  $quyosh

🕰  Bomdod:   -  $bobdod 
🕰  Peshin:      -  $pеshin 
🕰  Asr:            -  $asr 
🕰  Shom:        -  $shom 
🕰  Xufton:       -  $xufton
--------------------------------------------

📅 $Y yil $d $oy, $hafta",
'parse_mode'=>'html',
'reply_markup'=>$namooz,
]);
}
if($text == "🏙Termiz"){
$sayt = file_get_contents('http://uzsmart.ru/namoz-vaqtlari/shahar/Denov.html');
//bobdod
$bob = explode('<td><b>Tong (sahar)</b></td> <td>',"$sayt");
$bob2 = explode('</td>',"$bob[1]");
$bobdod = str_replace("$bob[1]"," ","$bob2[0]");
//quyosh
$quy = explode('<td><b>Quyosh</b></td> <td>',"$sayt");
$quy2 = explode('</td>',"$quy[1]");
$quyosh = str_replace("$quy[1]"," ","$quy2[0]");
//peshin
$pesh= explode('<td><b>Pеshin</b></td> <td>',"$sayt");
$pesh2 = explode('</td>',"$pesh[1]");
$pеshin = str_replace("$pesh[1]"," ","$pesh2[0]");
//asr
$as= explode('<td><b>Asr</b></td> <td>',"$sayt");
$as2 = explode('</td>',"$as[1]");
$asr = str_replace("$as[1]"," ","$as2[0]");
//shom
$sho= explode('<td><b>Shom (iftor)</b></td> <td>',"$sayt");
$sho2 = explode('</td>',"$sho[1]");
$shom = str_replace("$sho[1]"," ","$sho2[0]");
//xufton
$xuf= explode('<td><b>Xufton</b></td> <td>',"$sayt");
$xuf2 = explode('</td>',"$xuf[1]");
$xufton = str_replace("$xuf[1]"," ","$xuf2[0]");
$yil = date("Y",strtotime("5 hour"));
$Y = str_replace(["2021","2021","2022"],["2021","2021","2022"], $yil);
$kun = date("d",strtotime("2 hour"));
$d = str_replace(["0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31"],["0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31"], $kun);
$okun=date("n");
$oynoms = "1Yᴀɴᴠᴀʀ1 2Fᴇᴠʀᴀʟ2 3Mᴀʀᴛ3 4Aᴘʀᴇʟ4 5Mᴀʏ5 6Iʏᴜɴ6 7Iʏᴜʟ7 8Aᴠɢᴜsᴛ8 9Sᴇɴᴛᴀʙʀ9 11Oᴋᴛᴀʙʀ10 11Nᴏʏᴀʙʀ11 12Dᴇᴋᴀʙʀ12";
$ex2 = explode("$okun",$oynoms);
$oy = "$ex2[1]";
$haf = date('N',strtotime('2 hour'));
$haft="1Dᴜsʜᴀɴʙᴀ1 2Sᴇsʜᴀɴʙᴀ2 3Cʜᴏʀsʜᴀɴʙᴀ3 4Pᴀʏsʜᴀɴʙᴀ4 5Jᴜᴍᴀ5 6Sʜᴀɴʙᴀ6 7Yᴀᴋsʜᴀɴʙᴀ7";
$ex=explode("$haf",$haft);
$hafta="$ex[1]";


bot('sendPhoto',[
'chat_id'=>$cid,
'photo'=>"https://t.me/TARIINISG/130",
'caption'=>"Namoz vaqtlari
=========================
📌 《 🏙 Termiz 》 vaqti bilan
--------------------------------------------
🌓  Tong:          -  $bobdod
🌞  Quyosh:     -  $quyosh

🕰  Bomdod:   -  $bobdod 
🕰  Peshin:      -  $pеshin 
🕰  Asr:            -  $asr 
🕰  Shom:        -  $shom 
🕰  Xufton:       -  $xufton
--------------------------------------------

📅 $Y yil $d $oy, $hafta",
'parse_mode'=>'html',
'reply_markup'=>$namooz,
]);
}
if($text == "🏙Urganch"){
$sayt = file_get_contents('http://uzsmart.ru/namoz-vaqtlari/shahar/Jonboy.html');
//bobdod
$bob = explode('<td><b>Tong (sahar)</b></td> <td>',"$sayt");
$bob2 = explode('</td>',"$bob[1]");
$bobdod = str_replace("$bob[1]"," ","$bob2[0]");
//quyosh
$quy = explode('<td><b>Quyosh</b></td> <td>',"$sayt");
$quy2 = explode('</td>',"$quy[1]");
$quyosh = str_replace("$quy[1]"," ","$quy2[0]");
//peshin
$pesh= explode('<td><b>Pеshin</b></td> <td>',"$sayt");
$pesh2 = explode('</td>',"$pesh[1]");
$pеshin = str_replace("$pesh[1]"," ","$pesh2[0]");
//asr
$as= explode('<td><b>Asr</b></td> <td>',"$sayt");
$as2 = explode('</td>',"$as[1]");
$asr = str_replace("$as[1]"," ","$as2[0]");
//shom
$sho= explode('<td><b>Shom (iftor)</b></td> <td>',"$sayt");
$sho2 = explode('</td>',"$sho[1]");
$shom = str_replace("$sho[1]"," ","$sho2[0]");
//xufton
$xuf= explode('<td><b>Xufton</b></td> <td>',"$sayt");
$xuf2 = explode('</td>',"$xuf[1]");
$xufton = str_replace("$xuf[1]"," ","$xuf2[0]");
$yil = date("Y",strtotime("5 hour"));
$Y = str_replace(["2021","2021","2022"],["2021","2021","2022"], $yil);
$kun = date("d",strtotime("2 hour"));
$d = str_replace(["0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31"],["0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31"], $kun);
$okun=date("n");
$oynoms = "1Yᴀɴᴠᴀʀ1 2Fᴇᴠʀᴀʟ2 3Mᴀʀᴛ3 4Aᴘʀᴇʟ4 5Mᴀʏ5 6Iʏᴜɴ6 7Iʏᴜʟ7 8Aᴠɢᴜsᴛ8 9Sᴇɴᴛᴀʙʀ9 11Oᴋᴛᴀʙʀ10 11Nᴏʏᴀʙʀ11 12Dᴇᴋᴀʙʀ12";
$ex2 = explode("$okun",$oynoms);
$oy = "$ex2[1]";
$haf = date('N',strtotime('2 hour'));
$haft="1Dᴜsʜᴀɴʙᴀ1 2Sᴇsʜᴀɴʙᴀ2 3Cʜᴏʀsʜᴀɴʙᴀ3 4Pᴀʏsʜᴀɴʙᴀ4 5Jᴜᴍᴀ5 6Sʜᴀɴʙᴀ6 7Yᴀᴋsʜᴀɴʙᴀ7";
$ex=explode("$haf",$haft);
$hafta="$ex[1]";


bot('sendPhoto',[
'chat_id'=>$cid,
'photo'=>"https://t.me/TARIINISG/130",
'caption'=>"Namoz vaqtlari
=========================
📌 《 🏙 Urganch 》 vaqti bilan
--------------------------------------------
🌓  Tong:          -  $bobdod
🌞  Quyosh:     -  $quyosh

🕰  Bomdod:   -  $bobdod 
🕰  Peshin:      -  $pеshin 
🕰  Asr:            -  $asr 
🕰  Shom:        -  $shom 
🕰  Xufton:       -  $xufton
--------------------------------------------

📅 $Y yil $d $oy, $hafta",
'parse_mode'=>'html',
'reply_markup'=>$namooz,
]);
}
if($text == "🏙Toshkent"){
$sayt = file_get_contents('http://uzsmart.ru/namoz-vaqtlari/');
//bobdod
$bob = explode('<td><b>Tong (sahar)</b></td> <td>',"$sayt");
$bob2 = explode('</td>',"$bob[1]");
$bobdod = str_replace("$bob[1]"," ","$bob2[0]");
//quyosh
$quy = explode('<td><b>Quyosh</b></td> <td>',"$sayt");
$quy2 = explode('</td>',"$quy[1]");
$quyosh = str_replace("$quy[1]"," ","$quy2[0]");
//peshin
$pesh= explode('<td><b>Pеshin</b></td> <td>',"$sayt");
$pesh2 = explode('</td>',"$pesh[1]");
$pеshin = str_replace("$pesh[1]"," ","$pesh2[0]");
//asr
$as= explode('<td><b>Asr</b></td> <td>',"$sayt");
$as2 = explode('<td><b>Asr</b></td> <td>',"$sayt");
$as2 = explode('</td>',"$as[1]");
$asr = str_replace("$as[1]"," ","$as2[0]");
//shom
$sho= explode('<td><b>Shom (iftor)</b></td> <td>',"$sayt");
$sho2 = explode('</td>',"$sho[1]");
$shom = str_replace("$sho[1]"," ","$sho2[0]");
//xufton
$xuf= explode('<td><b>Xufton</b></td> <td>',"$sayt");
$xuf2 = explode('</td>',"$xuf[1]");
$xufton = str_replace("$xuf[1]"," ","$xuf2[0]");
$yil = date("Y",strtotime("5 hour"));
$Y = str_replace(["2021","2021","2022"],["2021","2021","2022"], $yil);
$kun = date("d",strtotime("2 hour"));
$d = str_replace(["0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31"],["0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31"], $kun);
$okun=date("n");
$oynoms = "1Yᴀɴᴠᴀʀ1 2Fᴇᴠʀᴀʟ2 3Mᴀʀᴛ3 4Aᴘʀᴇʟ4 5Mᴀʏ5 6Iʏᴜɴ6 7Iʏᴜʟ7 8Aᴠɢᴜsᴛ8 9Sᴇɴᴛᴀʙʀ9 11Oᴋᴛᴀʙʀ10 11Nᴏʏᴀʙʀ11 12Dᴇᴋᴀʙʀ12";
$ex2 = explode("$okun",$oynoms);
$oy = "$ex2[1]";
$haf = date('N',strtotime('2 hour'));
$haft="1Dᴜsʜᴀɴʙᴀ1 2Sᴇsʜᴀɴʙᴀ2 3Cʜᴏʀsʜᴀɴʙᴀ3 4Pᴀʏsʜᴀɴʙᴀ4 5Jᴜᴍᴀ5 6Sʜᴀɴʙᴀ6 7Yᴀᴋsʜᴀɴʙᴀ7";
$ex=explode("$haf",$haft);
$hafta="$ex[1]";


bot('sendPhoto',[
'chat_id'=>$cid,
'photo'=>"https://t.me/TARIINISG/130",
'caption'=>"Namoz vaqtlari
=========================
📌 《 🏙 Toshkent 》 vaqti bilan
--------------------------------------------
🌓  Tong:          -  $bobdod
🌞  Quyosh:     -  $quyosh

🕰  Bomdod:   -  $bobdod 
🕰  Peshin:      -  $pеshin 
🕰  Asr:            -  $asr 
🕰  Shom:        -  $shom 
🕰  Xufton:       -  $xufton
--------------------------------------------

📅 $Y yil $d $oy, $hafta",
'parse_mode'=>'html',
'reply_markup'=>$namooz,
]);
}
if($text == "📃Siyrat Darslari"){
    bot('sendMessage',[
    'chat_id'=>$cid,
    'text'=>"<b> 📃Siyrat Darslari </b> <i>boʻlimiga xush kelibsiz Marhamat o'zingizga kerakli darslikni tanlang</i>",
    'parse_mode'=>"html",
    'reply_markup'=>$siyrat,
]);
}
if($text == "Siyrat ilmi va ahamiyati"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/141",
       'caption'=>"<b>Siyrat ilmi va ahamiyati
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$siyrat,
]);
}
if($text == "Payg‘ambarimizga muhabbat iymondandir"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/142",
       'caption'=>"<b>Payg‘ambarimizga muhabbat iymondandir
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$siyrat,
]);
}
if($text == "Siyrat ilmi manbalari, adabiyotlari va siyrat ulamolari"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/143",
       'caption'=>"<b>Siyrat ilmi manbalari, adabiyotlari va siyrat ulamolari
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$siyrat,
]);
}
if($text == "Siyratni tadqiq va tahqiq qilib o‘rganish ahamiyati"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/144",
       'caption'=>"<b>Siyratni tadqiq va tahqiq qilib o‘rganish ahamiyati
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$siyrat,
]);
}
if($text == "Payg‘ambarimizning naslu nasablari"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/145",
       'caption'=>"<b>Payg‘ambarimizning naslu nasablari
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$siyrat,
]);
}
if($text == "Payg‘ambarimizning tavalludlari"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/146",
       'caption'=>"<b>Payg‘ambarimizning tavalludlari
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$siyrat,
]);
}
if($text == "Payg‘ambarimizning bolalik davrlari"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/147",
       'caption'=>"<b>Payg‘ambarimizning bolalik davrlari
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$siyrat,
]);
}
if($text == "Payg‘ambarimizning yigitlik davrlari"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/148",
       'caption'=>"<b>Payg‘ambarimizning yigitlik davrlari
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$siyrat,
]);
}
if($text == "Payg‘ambarimizning Xadicha onamizga uylanishlari va Kaʼbaning qayta qurilishi"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/149",
       'caption'=>"<b>Payg‘ambarimizning Xadicha onamizga uylanishlari va Kaʼbaning qayta qurilishi
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$siyrat,
]);
}
if($text == "Payg‘ambarlik arafasida"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/150",
       'caption'=>"<b>Payg‘ambarlik arafasida
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$siyrat,
]);
}
if($text == "Birinchi vahiyning nozil bo‘lishi"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/151",
       'caption'=>"<b>Birinchi vahiyning nozil bo‘lishi
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$siyrat,
]);
}
if($text == "Nubuvvatdan risolat sari"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/152",
       'caption'=>"<b>Nubuvvatdan risolat sari
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$siyrat,
]);
}
if($text == "Makka davrining 1-bosqichi Fatratul vahiy va maxfiy daʼvat"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/153",
       'caption'=>"<b>Makka davrining 1-bosqichi Fatratul vahiy va maxfiy daʼvat
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$siyrat,
]);
}
if($text == "Makka davrining 2-bosqichi Islom diniga oshkora daʼvat"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/154",
       'caption'=>"<b>Makka davrining 2-bosqichi Islom diniga oshkora daʼvat
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$siyrat,
]);
}
if($text == "📃Siyrat Darslari 2-QISM"){
    bot('sendMessage',[
    'chat_id'=>$cid,
    'text'=>"<b> 📃Siyrat Darslari 2 </b> <i>boʻlimiga xush kelibsiz Marhamat o'zingizga kerakli darslikni tanlang</i>",
    'parse_mode'=>"html",
    'reply_markup'=>$siyrat2,
]);
}
if($text == "Payg‘ambarimizga qarshi tashviqot"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/155",
       'caption'=>"<b>Payg‘ambarimizga qarshi tashviqot
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$siyrat2,
]);
}
if($text == "Payg‘ambarimizga qarshi qo‘llangan yangi uslublari"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/156",
       'caption'=>"<b>Payg‘ambarimizga qarshi qo‘llangan yangi uslublari
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$siyrat2,
]);
}
if($text == "Sahobalar zulm iskanjasida"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/157",
       'caption'=>"<b>Sahobalar zulm iskanjasida
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$siyrat2,
]);
}
if($text == "Payg‘ambarimizga aziyatlarning boshlanishi"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/158",
       'caption'=>"<b>Payg‘ambarimizga aziyatlarning boshlanishi
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$siyrat2,
]);
}
if($text == "Sahobalarning Habashistonga ilk hijrati"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/159",
       'caption'=>"<b>Sahobalarning Habashistonga ilk hijrati
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$siyrat2,
]);
}
if($text == "Sahobalarning Habashistonga ikkinchi hijrati"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/160",
       'caption'=>"<b>Sahobalarning Habashistonga ikkinchi hijrati
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$siyrat2,
]);
}
if($text == "Aziyatlarning kuchayishi va hazrati Hamzaning musilmon bo’lishi"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/161",
       'caption'=>"<b>Aziyatlarning kuchayishi va hazrati Hamzaning musilmon bo’lishi
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$siyrat2,
]);
}
if($text == "Hazrati Umarni musulmon bo'lishi"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/162",
       'caption'=>"<b>Hazrati Umarni musulmon bo'lishi
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$siyrat2,
]);
}
if($text == "Quraysh mushriklarining behuda urinishlari"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/163",
       'caption'=>"<b>Quraysh mushriklarining behuda urinishlari
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$siyrat2,
]);
}
if($text == "Qamal davri"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/164",
       'caption'=>"<b>Qamal davri
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$siyrat2,
]);
}
if($text == "Mahzunlik yili"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/165",
       'caption'=>"<b>Siyrat ilmi va ahamiyati
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$siyrat2,
]);
}
if($text == "Madinalik ilk musulmonlar"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/166",
       'caption'=>"<b>Siyrat ilmi va ahamiyati
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$siyrat2,
]);
}
if($text == "Isro va Me'roj hodisasi"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/167",
       'caption'=>"<b>Isro va Me'roj hodisasi
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$siyrat2,
]);
}
if($text == "Isro va Me'roj hodisasiga oid masalalar"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/168",
       'caption'=>"<b>Isro va Me'roj hodisasiga oid masalalar
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$siyrat2,
]);
}
if($text == "📖Fiqh fani"){
    bot('sendMessage',[
    'chat_id'=>$cid,
    'text'=>"<b> 📖Fiqh darslari</b> <i>boʻlimiga xush kelibsiz marhamat ozingizga kerakli bolimni tanlang</i>",
    'parse_mode'=>"html",
    'reply_markup'=>$fiqh,
]);
}
if($text == "1-Dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/190",
       'caption'=>"<b>Fiqh fanidan 1-dars: Fiqh fani uning mazmun-mohiyati undagi ayrim istilohlar
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$fiqh,
]);
}
if($text == "2-Dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/192",
       'caption'=>"<b> Fiqh fani | 2-dars | Tahoratning farz va sunnatlari
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$fiqh,
]);
}
if($text == "3-Dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/191",
       'caption'=>"<b>Fiqh fani | 3-dars | Tahoratni sindiruvchi amallar
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$fiqh,
]);
}
if($text == "4-Dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/193",
       'caption'=>"<b>Fiqh fani | 4-dars | G'uslga doir muhim masalalar va suvlarning turlari
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$fiqh,
]);
}
if($text == "5-Dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/194",
       'caption'=>"<b>Fiqh fani | 5-dars | Hasan domla Qodirov
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$fiqh,
]);
}
if($text == "🔵Hadis ilmini o'rganamiz"){
    bot('sendMessage',[
    'chat_id'=>$cid,
    'text'=>"<b> 🔵Hadis ilmini o'rganamiz</b> <i>boʻlimiga xush kelibsiz Marhamat O'zingizga kerakli darsliklarni tanlang</i>",
    'parse_mode'=>"html",
    'reply_markup'=>$hadis,
]);
}
if($text == "Niyat"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/131",
       'caption'=>"<b>1. Hadis ilimini o'rganamiz - Niyat
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$hadis,
]);
}
if($text == "Ixlos"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/132",
       'caption'=>"<b>2. Hadis ilimini o'rganamiz - Ixlos
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$hadis,
]);
}
if($text == "Tavba fazilati"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/133",
       'caption'=>"<b>3. Hadis ilimini o'rganamiz - Tavba fazilati
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$hadis,
]);
}
if($text == "Sabr fazilati"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/134",
       'caption'=>"<b>4. Hadis ilmini o'rganamiz - Sabr fazilati
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$hadis,
]);
}
if($text == "Rost so'zlash fazilati"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/135",
       'caption'=>"<b>5. Hadis ilimini o'rganamiz - Rost so'zlash fazilati
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$hadis,
]);
}
if($text == "Taqvo"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/136",
       'caption'=>"<b>6. Hadis ilimini o'rganamiz - Taqvo
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$hadis,
]);
}
if($text == "Tavakkul"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/137",
       'caption'=>"<b>7. Hadis ilimini o'rganamiz - Tavakkul
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$hadis,
]);
}
if($text == "Yahshi amallarga shoshilish"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/138",
       'caption'=>"<b>8. Hadis ilimini o'rganamiz - Yahshi amallarga shoshilish
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$hadis,
]);
}
if($text == "Umr oxirida yaxshiliklarni ko‘paytirishga targ‘ib"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/139",
       'caption'=>"<b>9-dars: Hadis ilmini o'rganamiz (Umr oxirida yaxshiliklarni ko‘paytirishga targ‘ib)
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$hadis,
]);
}
if($text == "Yaxshilikning yo'llari ko'p"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/140",
       'caption'=>"<b>10-dars: Hadis ilmini o'rganamiz (Yaxshilikning yo'llari ko'p)
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$hadis,
]);
}
if($text == "📒Aqida Darslari"){
    bot('sendMessage',[
    'chat_id'=>$cid,
    'text'=>"<b> 📒Aqida Darslari</b> <i>bo'limiga xush kelibsiz marhamat ozingizga kerakli darslikni tanlang</i>",
    'parse_mode'=>"html",
    'reply_markup'=>$aqida,
]);
}
if($text == "Muqaddima"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/248",
       'caption'=>"<b>Islomiy aqida darslari: 1-dars Muqaddima
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$aqida,
]);
}
if($text == "Tavhid masalasi"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/249",
       'caption'=>"<b>2-dars Alloh taoloning vahdoniyatini isbotlash (Tavhid masalasi)
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$aqida,
]);
}
if($text == "Alloh taolo qadim va boqiydir"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/246",
       'caption'=>"<b>3-dars Alloh taolo qadim va boqiydir (Har bir narsa uning irodasi bilan bo‘lur)
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$aqida,
]);
}
if($text == "Alloh taoloning zoti va sifatlari maxluqotlarning zot va sifatlariga muxolifdir"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/250",
       'caption'=>"<b>4-dars Alloh taoloning zoti va sifatlari maxluqotlarning zot va sifatlariga muxolifdir
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$aqida,
]);
}
if($text == "Alloh Ta’olo doimiy barhayotdir va U zot yaratuvchidir"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/253",
       'caption'=>"<b>5-dars Alloh Ta’olo doimiy barhayotdir va U zot yaratuvchidir
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$aqida,
]);
}
if($text == "Alloh taolo hech qanday mashaqqatsiz Rizq beruvchidir"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/251",
       'caption'=>"<b>6-dars Alloh taolo hech qanday mashaqqatsiz Rizq beruvchidir
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$aqida,
]);
}
if($text == "Alloh Ta’olo o'ldiruvchi va qayta tiriltiruvchidir"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/247",
       'caption'=>"<b>7-dars Alloh Ta’olo o'ldiruvchi va qayta tiriltiruvchidir 
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$aqida,
]);
}
if($text == "Аллоҳ таолонинг зотий ва феълий барча сифатлари азалий  ва абадийдир"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/muslimuzportal/24071",
       'caption'=>"<b>Islomiy aqida darslari: 8-dars Аллоҳ таолонинг зотий ва феълий барча сифатлари азалий  ва абадийдир
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$aqida,
]);
}
if($text == "Тақдир - қазо қадар нима ўзи?"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/muslimuzportal/24201",
       'caption'=>"<b>9-dars Тақдир - қазо қадар нима ўзи?
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$aqida,
]);
}
if($text == "Тақдирга тўлиқ розимиз. Муқаддаргачи?"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/muslimuzportal/24312",
       'caption'=>"<b>10-dars Тақдирга тўлиқ розимиз. Муқаддаргачи?
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$aqida,
]);
}
if($text == "Аллоҳ ҳоҳлаганини ҳидоят қилиб, ҳоҳлаганини адаштиради буни қандай тушунамиз?"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/muslimuzportal/24381",
       'caption'=>"<b>11-dars Аллоҳ ҳоҳлаганини ҳидоят қилиб, ҳоҳлаганини адаштиради буни қандай тушунамиз?
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$aqida,
]);
}
if($text == "Пайғамбарга иймон келтириш"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/muslimuzportal/24476",
       'caption'=>"<b>12-dars Пайғамбарга иймон келтириш
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$aqida,
]);
}
if($text == "Қуръон махлуқми ёки махлуқ эмасми ? Шу масалани қандай тушунамиз?"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/muslimuzportal/24562",
       'caption'=>"<b>13-dars Қуръон махлуқми ёки махлуқ эмасми ? Шу масалани қандай тушунамиз?
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$aqida,
]);
}
if($text == "Аллоҳ таолони дунёда, охиратда, тушда кўриш жоизми?"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/muslimuzportal/24676",
       'caption'=>"<b>14-dars Аллоҳ таолони дунёда, охиратда, тушда кўриш жоизми?
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$aqida,
]);
}
if($text == "Меърож ҳақ ва Ҳавзи кавсар ҳақдир"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/muslimuzportal/24772",
       'caption'=>"<b>15-dars Меърож ҳақ ва Ҳавзи кавсар ҳақдир
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$aqida,
]);
}
if($text == "Шафоат нима ва у неча тур бўлади? Ал-мийсоқ нима дегани?"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/muslimuzportal/24910",
       'caption'=>"<b>16-dars Шафоат нима ва у неча тур бўлади? Ал-мийсоқ нима дегани?
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$aqida,
]);
}
if($text == "Фаришталар ҳақида ақидангиз қандай?"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/muslimuzportal/25011",
       'caption'=>"<b>17-dars Фаришталар ҳақида ақидангиз қандай?
       
Videodarslik yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$aqida,
]);
}
if($text == "☪Suralar🤲"){
    bot('sendMessage',[
    'chat_id'=>$cid,
    'text'=>"<b> ☪Suralar🤲 </b> <i>boʻlimiga xush kelibsiz Marhamat O'zingizga kerakli surani tanlang</i>",
    'parse_mode'=>"html",
    'reply_markup'=>$sura,
]);
}

if($text == "☪Namoz"){
bot('sendPhoto',[
'chat_id'=>$cid,
'photo'=>"https://t.me/TARIINISG/130",
'caption'=>"Siz Namoz bo‘limidasiz. 
O‘zingizga kerakli bo‘limni tanlang..!
Diqqat Namozni O'rganish bo'limi hozircha ishlamayapti. Yaxshisi Namoz ilovasini yuklab oling!",
'parse_mode'=>'html',
'reply_markup'=>$namoz,
]);
}
if($text == "🛐Namoz haqida📝"){
bot('sendPhoto',[
'chat_id'=>$cid,
'photo'=>"https://t.me/TARIINISG/130",
'caption'=>"O‘zingizga kerakli bo‘limni tanlang..!",
'parse_mode'=>'html',
'reply_markup'=>$namozh,
]);
}
if($text == "Namoz Bu.."){
bot('sendPhoto',[
'chat_id'=>$cid,
'photo'=>"https://t.me/TARIINISG/130",
'caption'=>"NAMOZ
Oldin ibodat nimaligini bilib olaylik. «Ibodat» soʻzi «toat», «itoat qilish» va «Parvardigorni ulugʻlash» ma‘nolarini oʻzida jamlagan. Shariatda bajarilgani uchun savob bеriladigan va niyatga bogʻliq boʻlgan amal «ibodat» dеyiladi. Alloh taolo amr-farmonlari va Uning Paygʻambari koʻrsatmalarini bajarish, Parvardigor roziligini topish va Unga bandalikni ado etish uchun buyurilgan namoz oʻqish, roʻza tutish, zakot bеrish, haj qilish, duo va zikrlar aytish, yaxshilik va ehsonlar qilish kabi toat va amallar ibodatdir.",
'parse_mode'=>'html',
'reply_markup'=>$namozh,
]);
}
if($text == "Namoz Bu.."){
bot('sendMessage', [
'chat_id'=>$cid,
'text'=>"Ibodatlarning eng asosiysi, eng ulugʻi, eng ahamiyatlisi namozdir. Namoz arabchada «solat» dеyiladi, lugʻatda «yaxshilikka duo» dеgan ma‘noni anglatadi. Shariatda esa talab qilingan shartlar asosida takbir bilan boshlanib, salom bеrish bilan tugaydigan ibodat «namoz» dеyiladi. 

Namoz Isro kеchasida Paygʻambarimiz sollallohu alayhi vasallam hijratlaridan (Yasrib, ya‘ni Madina shahriga koʻchishlaridan) bir yarim yil oldin farz boʻlgan. Bеsh vaqt (bomdod, pеshin, asr, shom, xufton) namozning farzligi Qur‘on, sunnat, ijmo‘ bilan sobit (joriy) boʻlgan.

Namoz balogʻatga еtgan har bir musulmonga farz (majburiy)dir. Namozning farzligini inkor qilgan kishi kofir boʻladi. Namoz – Islom dinining ikkinchi rukni, kalimai shahodatdan kеyingi eng ulugʻ farz sanaladi. Namozni masjidlarda jamoat bilan oʻqishning alohida fazilati va afzalligi bor. 

U musulmon banda Allohning son-sanoqsiz nе‘matlariga shukr kеltirishi uchun shariatga kiritilgan boʻlib, uning diniy, tarbiyaviy, shaxsiy, sihhiy, ijtimoiy va boshqa qator foydalari koʻp. Avvalo, namoz bandaning Alloh bilan bogʻlanish vositasidir. Namozda banda Alloh bilan yolgʻiz qolib, unga munojot qiladi. Shu ibodat yordamida ruhiy, ma‘naviy lazzat oladi. Namoz oʻqish bilan banda oʻzining barcha ishlarini Alloh taologa topshiradi. Shu namozi ila oʻziga omonlik, xotirjamlik va najot tilaydi. 

Ikkinchidan, namoz yutuq va najot yoʻlidir. Namoz xato va gunohlarni yuvishning eng ishonchli yoʻli boʻlib, u doimo oʻz egasiga koʻplab shaxsiy foydalar kеltiradi. Namoz insonni Allohga yaqin qiladi, uning irodasini mustahkamlaydi, bu dunyo matohlaridan oʻzini yuqori tutishga oʻrgatadi va oʻz egasiga mislsiz nafsoniy rohat va ruhiy farogʻat baxsh etadi.

Namoz oʻqiydigan odam gʻaflat uyqusidan uygʻonib, hayotga tеranroq nazar solishni oʻrganadi. U kishiga intizomli boʻlishni, hamma ishlarni tartibli ravishda yoʻlga qoʻyishni, vaqtni tеjash va tartibga solishni oʻrgatadi. Namozxon odam hilm, xotirjamlik, shoshilmaslik, viqorli boʻlish, sabr kabi koʻplab shaxsiy va yuksak insoniy fazilatlarga ega boʻladi. 

Namoz insonning kundalik hayoti uchun har tomonlama zarur amal ekani ilmiy ravishda ham isbotlanmoqda. Namoz oʻzining son-sanoqsiz foydalari bilan inson hayotini hamma sohalarda tartibga solib turuvchi vosita ekani tobora ayon boʻlmoqda. Hozirgi kunda ilmiy yoʻl bilan hayot kеchirish uslubini izlagan moddiy taraqqiy etgan yurtlar aholisining koʻpchiligi namoz tufayli Islomga kirmoqda. Kishining har taraflama pokligini, sogʻligini ta‘minlovchi, uni Alloh bilan, Paygʻambar sollallohu alayhi vasallam bilan, moʻmin birodarlari bilan doimiy aloqada ushlab turuvchi namozning ahamiyatini endi kim ham inkor qila oladi?",
'parse_mode'=>'html',
'reply_markup'=>$namozh,
]);
}
if($text == "Namoz Bu.."){
bot('sendMessage', [
'chat_id'=>$cid,
'text'=>"Islom dinida namozdan muhimroq, undan ulugʻroq va ahamiyatliroq boshqa ibodat yoʻq. Qur‘oni Karimning juda koʻp oʻrinlarida insonlar namoz oʻqishga targʻib qilingan, namoz musulmonlikning asosiy bеlgilaridan, Islomning muhim ruknlaridan ekani zikr etilgan. Qur‘oni Karimning oltmish bеsh oyatida namoz kishi iymonining dalili ekani zikr etilib, moʻminlar namozni toʻkis ado etishga, namozlarini muhofaza qilishga buyurilgan. Qolavеrsa, namoz poklik ramzi. Namozxon odamning eng avvalo, qalbi pok boʻladi. Uning nainki qalbi, badani, kiyim-boshi va makoni ham pok boʻladi. Namoz kishining ruhiy, ma‘naviy va jismoniy sogʻligi uchun nihoyatda zarur narsa ekani hozirda hеch kimga sir emas. 

Namoz moʻminga najot va panohdir, dardiga malhamdir. Sahih hadislarda kеltirilishicha, qachon Rasululloh sollallohu alayhi vasallamning boshlariga biror tashvishli ish tushsa, kеchada kuchli shamol boʻlsa, quyosh yoki oy tutilsa, biror hodisa yuz bеrsa, boshpanalari masjid, ibodatlari namoz boʻlib qolardi. 

Namoz ruh ozuqasi, qalb jarohatining shifosi, Nafsning jilovidir. Namoz qiynalganlarga yordam, xavfdagilarga omonlik, zaiflarga quvvat, qurolsizlarga qalqondir. Namoz iymonning alomati, qabrni purnur etuvchi ziyo, oxiratda doʻzaxdan panoh boʻluvchi, bandani yomonlik, gunohlardan qaytaruvchi eng yaxshi davodir. Chunki dunyo hayotida namozdan jiddiyroq, muhimroq bir ish, biror vazifa yoʻqdir. Namoz Allohga bandalik qilishning, Unga ishonishning e‘tirofidir. Allohni sеvishning, Uni ehtirom qilishning ifodasidir. Namoz kibr va nafs choponini otib, qullik libosini kiyish kayfiyatidir. Musulmonni gʻayrimuslimdan ayiradigan eng katta alomatdir. Shuning uchun har qanday holatda ham uning tark etilishiga izn bеrilmagan.",
'parse_mode'=>'html',
'reply_markup'=>$namozh,
]);
}


if($text == "Namozning Farzi.."){
bot('sendPhoto',[
'chat_id'=>$cid,
'photo'=>"https://t.me/TARIINISG/130",
'caption'=>"Namozda o‘n ikkita farz amal bor. Namozdan tashqarida oltita farz amal bo‘lib, ular “namoz shartlari”, namoz ichidagi olti farz esa “namoz ruknlari” deyiladi.",
'parse_mode'=>'html',
'reply_markup'=>$namozh,
]);
}
if($text == "Namozning Farzi.."){
bot('sendMessage', [
'chat_id'=>$cid,
'text'=>"Namoz shartlari quyidagilar:

1. Tana pok bo‘lishi (Tahoratsiz bo‘lsa, tahorat olish, junub bo‘lsa, g‘usl qilish).

2. Kiyim pok, avratni berkitadigan bo‘lishi.

3. Namoz o‘qiladigan joy pok bo‘lishi.

4. Namoz vaqti kirishi (Vaqti kirmay turib o‘qilgan namoz farz o‘rniga o‘tmaydi).

5. Namozni qiblaga yuzlanib o‘qish.

6. Namoz o‘qishga niyat qilish.

Namoz ruknlari quyidagilar:

1. Takbiri tahrima (“Allohu akbar” deb namozga kirish).

2. Qiyom (namozda tik turish. Sog‘lom kishi tik turishi farz. Agar bemor bo‘lsa, o‘tirib, bunga ham qodir bo‘lmasa, yonboshlab o‘qish mumkin).

3. Qiroat (namozda Qur’on suralari yoki oyatlarini o‘qish).

4. Ruku’ qilish (ikki qo‘l tirsaklarini bukmasdan tizzalarini ushlagan holda boshni egish. Bunda bel to‘g‘ri qilinishi, bosh bilan bel bir tekisda bo‘lishi kerak).

5. Sajda qilish (peshonani yerga qo‘yish. Bunda ham bel to‘g‘ri bo‘lishi shart).

6. Qa’dai oxir (oxirgi qa’dada tashahhud miqdoricha o‘tirish).

Agar bu amallardan birontasi tark etilsa yoki noto‘g‘ri bajarilsa, namoz buziladi, uni qaytadan o‘qish lozim bo‘ladi.",
'parse_mode'=>'html',
'reply_markup'=>$namozh,
]);
}
if($text == "Namozning Vojiblari.."){
bot('sendPhoto',[
'chat_id'=>$cid,
'photo'=>"https://t.me/TARIINISG/130",
'caption'=>"Namozning vojiblari.",
'parse_mode'=>'html',
'reply_markup'=>$namozh,
]);
}
if($text == "Namozning Vojiblari.."){
bot('sendMessage', [
'chat_id'=>$cid,
'text'=>"1. Farz namozlarining ikki rakatida, vitr, nafl (jumladan, ta’kidlangan sunnat) namozlarining hamma rakatida Fotiha surasini qiroat qilish.

2. Farz namozlarining avvalgi ikki rakatida, vitr, nafl (jumladan, ta’kidlangan sunnat) namozlarining har bir rakatida Fotiha surasidan so‘ng zam sura o‘qish. Zam sura kamida qisqa uch oyat yoki uzun bir oyatdan iborat bo‘ladi.

3. Zam surani Fotihadan keyin o‘qish.

4. Imom namozga o‘tganda ovoz chiqarib o‘qiladigan namozlarni (bomdod, shom, xuftonni) jahriy, ovoz chiqarmay o‘qiladigan namozlarni (peshinni, asrni) maxfiy o‘qishi.

5. Qiyom, ruku’, sajda kabi ruknlarni o‘z o‘rnida, tartib bilan bajarish.

6. Ruku’da, sajdada, qolgan barcha arkonlarda a’zolar taskin topishi, mazkur ruknlarni xotirjamlik bilan bajarish.

7. Sajdada burun bilan peshonaning baravar yerga tegib turishi.

8. Uch, to‘rt rakatli namozlarning ikkinchi rakatida hamda namoz oxiridagi o‘tirishda “Attahiyot” o‘qish.

9. Avvalgi qa’dada tashahhudni o‘qib bo‘lgach, kechiktirmay uchinchi rakatga turish.

10. Namozdagi vojib amallardan birontasi esdan chiqib tark etilsa, sajdai sahv qilish.

11. Namoz oxirida “Assalaamu alaykum va rohmatulloh” deb salom lafzi bilan chiqish. Salom yelkaga to‘la yuzlangandan keyin beriladi.

12. Vitr namozining oxirgi rakatida “Qunut” duosini o‘qish.

13. Ramazon va Qurbon hayiti namozlarining har rakatida uchtadan qo‘shimcha takbir aytish.

Mazkur vojib amallardan birontasini esdan chiqarib tark etgan kishi namoz oxirida sajdai sahv qilishi vojib. Sajdai sahv qilish tartibi bunday: imom oxirgi qa’dada tashahhudni o‘qigandan so‘ng o‘ng tomoniga salom beradi1. Keyin ikki marta sajda qilib, yana tashahhudni, salavotni o‘qiydi. Shundan so‘ng ikki tomonga salom berib namozdan chiqadi.

1 Agar kishi yolg‘iz o‘zi namoz o‘qiyotgan bo‘lsa, tashahhuddan keyin ikki tarafiga salom beradi. Keyin ikki marta sajda qilib, tashahhudni, salavotni o‘qiydi, o‘ng va so‘l tarafga salom berib namozdan chiqadi. Jamoat namozida imom sahv sajdasi qilish uchun faqat o‘ng tomonga salom beradi.",
'parse_mode'=>'html',
'reply_markup'=>$namozh,
]);
}
if($text == "Namozning Sunnatlar.."){
bot('sendPhoto',[
'chat_id'=>$cid,
'photo'=>"https://t.me/TARIINISG/130",
'caption'=>"Quyidagilar namozning sunnatlaridir:",
'parse_mode'=>'html',
'reply_markup'=>$namozh,
]);
}
if($text == "Namozning Sunnatlar.."){
bot('sendMessage', [
'chat_id'=>$cid,
'text'=>"1. Takbiri tahrimada qo‘l barmoqlarini o‘z holida ochiq tutib quloqqa tekkazish (Ayollar takbiri tahrima aytishda qo‘llarini yelka baravarida ko‘taradilar).

2. Iqtido qiluvchi takbiri imom takbiri bilan oldinma-ketin bo‘lishi.

3. Erkaklarning o‘ng kaftlarini chap kaftlari ustiga qo‘yib, ikkisini kindik ostida tutib turishlari (Ayollar o‘ng kaftlarini chap kaftlari ustiga qo‘yib, ko‘kraklari ustida ushlab turadilar).

4. “Allohu akbar” deb takbir aytgandan keyin sanoni maxfiy (ichida) o‘qish.

5. Sanodan keyin “Auvzu”, har rakatda Fotihadan oldin “Bismillaah” aytish (Taavvuz ham, basmala ham maxfiy – ovoz chiqarmay, pichirlab aytiladi).

6. Faqat birinchi rakatda Fotihadan oldin “auvzu”ni aytish.

7. Fotiha surasini o‘qib bo‘lgach, ichida “Omin” deyish (Buni imom ham, muqtadiy ham, yolg‘iz namoz o‘quvchi ham aytadi).

8. Imomning ruku’dan keyin “Samiallohu liman hamidah”, iqtido qilganlarning esa “Robbanaa lakal hamd”, deyishi (Namozni bir o‘zi o‘qigan kishi ikkalasini ham aytadi).

9. Bir rukndan boshqa ruknga o‘tayotganda “Allohu akbar”, deb takbir aytish.

10. Imom takbirlarni ovoz chiqarib aytishi. Iqtido qiluvchilar eshitishi uchun takbirlarni jahriy aytiladi.

11. Qiyomda ikki oyoq orasini to‘rt barmoq kengligida ochib turish.

12. Ruku’da qo‘l barmoqlarini ochib, ikki tizza ko‘zini mahkam ushlash, boshni orqa bilan bir tekis qilish, belini to‘g‘ri tutish, kamida uch marta “Subhaana robbiyal aziym”, deyish.

13. Ruku’dan bosh ko‘targach, a’zolar halovat topguncha biroz turish.

14. Qiyomdan sajdaga borishda avval tizzani, keyin kaftni, keyin burunni, oxirida peshonani qo‘yish. Sajdadan qiyomga turishda buning teskarisi qilinadi: avval peshona, keyin burun, keyin kaftlar, oxirida tizza yerdan ko‘tariladi.

15. Sajdada peshonani qo‘llar orasiga olish, barmoqlarni jipslab, bosh barmoqni qulog‘i to‘g‘risida ushlash, kamida uch marta “Subhaana robbiyal a’laa” deyish.

16. Sajdada erkaklar oyoqlari, tizzalari, qo‘llari, peshonasi, burni yerga tegib turishi, bilaklarini yerga ham, qorniga ham tekkazmay tutishi (Ayollar sajdada qorinlarini sonlariga, qo‘llarini yerga tekkazib turishadi).

17. Ikki sajda orasida o‘tirish. Bunda ikki kaft xuddi tashahhuddagidek tizzalar ustiga qo‘yiladi.

18. Erkaklarning chap oyoq ustiga o‘tirishi, o‘ng oyog‘ini tik qilib, barmoq uchlarini qiblaga qaratishi (Ayollar esa ikki oyog‘ini o‘ng tomonga chiqarib, chap dumbasiga o‘tiradi).

19. Tashahhuddan so‘ng salavot aytish, keyin Qur’onda, hadislarda kelgan duolarni o‘qish.

20. Namozdan chiqayotganda avval o‘ng, keyin chap tomonga salom berish.

21. Imomning har ikki tomonga salom berayotganida jamoatni, himoya qiluvchi farishtalarni, solih jinlarni niyat qilishi.

22. Iqtido qilgan kishining, imom o‘ng tomonda bo‘lsa, o‘ngga bergan, chapda bo‘lsa, chapga bergan, oldida bo‘lsa, har ikki tomonga bergan salomida imomni, jamoatdagi birodarlarini, himoya qiluvchi farishtalarni, solih jinlarni niyat qilishi.

23. Yolg‘iz namoz o‘qigan kishi salom berayotganda faqat farishtalarni niyat qilishi.

24. Jamoat salomini imom salomiga ergashtirishi.

25. To‘rt yoki uch rakatli farz namozlarining uchinchi, to‘rtinchi rakatlarida Fotiha surasini qiroat qilish. Lekin nafl (jumladan, ta’kidlangan sunnat) namozlarining uchinchi, to‘rtinchi rakatlarida Fotiha surasi bilan zam sura o‘qish vojibdir.

26. Farz namozlarini jamoat bo‘lib o‘qish.

Mazkur sunnat amallarni tark etish bilan namoz buzilmaydi, lekin go‘zal suratda ado etilmagan bo‘ladi. Demak, namozni xushu’ bilan o‘qishda, ulug‘ ajr-savoblar olishda namozdagi sunnat amallar o‘rni katta.",
'parse_mode'=>'html',
'reply_markup'=>$namozh,
]);
}
if($text == "Namozning Mustahablari.."){
bot('sendPhoto',[
'chat_id'=>$cid,
'photo'=>"https://t.me/TARIINISG/130",
'caption'=>"Quyidagilar Namozning mustahablaridir:",
'parse_mode'=>'html',
'reply_markup'=>$namozh,
]);
}
if($text == "Namozning Mustahablari.."){
bot('sendMessage', [
'chat_id'=>$cid,
'text'=>"1. Erkaklarning takbiri tahrima aytishda qo‘llarini ko‘ylak yengidan chiqarishlari.

2. Namoz o‘qiyotganda esnoq yoki yo‘tal kelsa, kuchi yetganicha qaytarish, iloji boricha yo‘talmaslikka harakat qilish.

3. Beixtiyor esnoq kelganida o‘ng qo‘l orqasi bilan og‘izni berkitish, Payg‘ambarimiz sollallohu alayhi va sallam biron marta esnamaganlarini yodga olish.

4. Muqim kishining bomdod namozida Fotiha surasidan so‘ng uzunroq, shom namozida qisqaroq, boshqa namozlarda o‘rtacha suralarni o‘qishi.

5. Sajdada barmoq oralarini zichlash, boshni ikki qo‘l orasiga, bosh barmoqni quloq to‘g‘risiga qo‘yish, qo‘l barmoqlari uchini, oyoq panjalarini qiblaga qaratish.

6. Namozni yolg‘iz o‘qiganda ruku’larda, sajdalarda tasbehni 3 martadan ko‘p (5, 7, 9 yoki 11 marta) aytish.

7. Qiyomda sajda o‘rniga, ruku’da oyoq barmoqlariga, sajdada burunga, qa’dada ko‘krakka, salom berayotganda yelkaga qarash.

8. Namozda tavoze’ bilan, o‘zini xokisor tutib turish.

Yuqorida sanalgan amallar namoz odoblari ham deyiladi. Ularga amal qilinsa, namoz yanada mukammal bo‘ladi.",
'parse_mode'=>'html',
'reply_markup'=>$namozh,
]);
}
if($text == "Namozni buzuvchi amallar.."){
bot('sendPhoto',[
'chat_id'=>$cid,
'photo'=>"https://t.me/TARIINISG/130",
'caption'=>"Quyidagilar Namozni buzuvchi amallardir:",
'parse_mode'=>'html',
'reply_markup'=>$namozh,
]);
}
if($text == "Namozni buzuvchi amallar.."){
bot('sendMessage', [
'chat_id'=>$cid,
'text'=>"1. Namozda gapirish (qasddan yoki adashib bo‘lsa ham).
2. Kishiga salom berish.
3. Salomga alik olish.
4. Uzrsiz tomoq qirish, yo‘talish.
5. ‘Uh‘, ‘uf‘, ‘ohkabi tovushlar chiqarish.
6. Og‘riq yoki musibatga ovoz chiqarib yig‘lash (ammo oxiratni o‘ylab yig‘lasa joiz).
7. O‘zi eshitadigan darajada kulish (qahqaha bilan qattiq kulsa, tahorati ham ketadi).

8. Aksa urganga javob qaytarish (ya’ni ‘Yarhamukalloh‘, deyish).
9. Savolga yoki xabarga oyatlar bilan bo‘lsa-da, javob berish.
10. Biror narsani yeb-ichish (labidagi, tishidagi ovqatni ham).
11. Namozni jamoat bilan o‘qiyotganda yonidagi odamga joy berish uchun surilish.
12. Qiroatni Mushafga qarab qilish.
13. ‘Amali kasir‘ qilish (ya’ni ko‘rgan odam ‘Namoz o‘qimayapti‘ deb o‘ylaydigan darajadagi amallarni qilish).
14. Najosat ustiga sajda qilish.
15. Ko‘krakni qibladan boshqa tarafga burish.

16. Sajdadagi holida ikki oyoq panjalarini yerdan ko‘tarish.
17. Qiroatni ma’no o‘zgaradigan darajada buzish.
18. Namoz farzlaridan birortasini uzrsiz qoldirish.
19. Namozning to‘la bir ruknida avratning ochiq bo‘lishi.
20. Tahoratning (tayammum, mashning ham) ketishi.
21. Bomdod namozida quyosh chiqib qolishi.
22. Namoz asnosida hushidan ketishi.",
'parse_mode'=>'html',
'reply_markup'=>$namozh,
]);
}
if($text == "Namozning Makruhlari.."){
bot('sendPhoto',[
'chat_id'=>$cid,
'photo'=>"https://t.me/TARIINISG/130",
'caption'=>"Namoz o‘qiyotganda quyidagi ishlarni qilish man etiladi:

1. Yuzni o‘ng yoki chap tarafga qaratish.

2. Osmonga qarash.

3. Farz namozlarida biron narsaga uzrsiz suyanish.

4. Ruku’da, sajdada oyoq yoki qo‘l barmoqlarini yerdan ko‘tarish.

5. Qa’dada ikki oyoqni tik qilib tovon ustida o‘tirish.

6. Badani yoki kiyimini ko‘p o‘ynash.

7. Salomni faqat bir tarafga berish.

8. Namoz vojiblaridan birini qasdan tark etish. Masalan, farz namozlarining birinchi, ikkinchi rakatida Fotihani qiroat qilmaslik, qa’dada tashahhudni o‘qimaslik va hokazo.",
'parse_mode'=>'html',
'reply_markup'=>$namozh,
]);
}
if($text == "Namozning Makruhlari.."){
bot('sendMessage', [
'chat_id'=>$cid,
'text'=>"NAMOZDAGI MAKRUH AMALLAR

 
1. Namoz sunnatlaridan birini atayin tark etish. Masalan, takbiri tahrimadan keyin sanoni o‘qimaslik, ruku’da, sajdada tasbeh aytmaslik va hokazo.

2. Mushaf tartibiga teskari qiroat qilish. Masalan, birinchi rakatda Ixlos, ikkinchi rakatda Masad surasini o‘qish.

3. Qisqa suralar o‘qiganda orada bir surani tashlab ketish. Misol uchun, birinchi rakatda Quraysh, ikkinchisida Kavsar surasini o‘qish.

4. Farz namozlarining bir rakatida bir surani ikki marta o‘qish.

5. Doim bir surani o‘qish, boshqalarini tark etish (Lekin, “Payg‘ambarimiz sollallohu alayhi va sallam namozda ko‘proq shu suralarni qiroat qilganlar”, degan niyati bo‘lsa, makruh emas).

6. Namozni xushu’siz, beparvo o‘qib qo‘yish.

7. Namoz o‘qiyotgan odamning sajda qilishga xalaqit bermaydigan mayda toshlarni surib tashlashi (Hadisda aytilganidek, bir marta sursa bo‘ladi).

8. Agar sajda o‘rni tuproq bo‘lsa, namozdan chiqqach peshonani tozalab artish.

9. Erkaklar sajda qilayotganda ikki bilagini yerga, qornini tizzasiga tekkazishi.

10. Erkaklar namoz vaqtida sochni turmaklab olishi.

11. Qiyomda qo‘lni belga qo‘yish.

12. Namoz o‘quvchi kiyimini osiltirib yoki yelkasiga tashlab yoxud yig‘ishtirib, yengini shimarib olishi.

13. Amali kasir qilmagan holda kiyimni uzrsiz to‘g‘rilash (Jumladan, sajdaga borayotganda qo‘li bilan shimini ko‘tarish), barmoqlarini bir-birining ichiga kirgizish, tanasining ayrim joylarini behuda o‘ynash. Chunki bu narsa xushu’ga xalal beradi.

14. Dangasalik yoki kibr tufayli bosh kiyimsiz namoz o‘qish (Ammo, Alloh huzurida o‘zini xor tutish niyatida boshyalang o‘qish makruh emas).

15. Qorin juda och paytda namoz o‘qish. Bunda avval ozroq taom yeb, nafs qondiriladi. Keyin xotirjam holda namoz o‘qiladi.

16. Fikrni chalg‘ituvchi narsalar qarshisida namoz o‘qish.

17. Hojatxonaga borish zarurati tug‘ilganda yoki yel chiqishi tang qilib turganda o‘zini majburlab ushlab turish.

18. Ko‘zini behuda yumib olish. Agar xushu’ hosil qilish uchun yumsa, hechqisi yo‘q.

19. Janoza namozida takbir aytilganida boshini ko‘tarish.

20. Imomning jamoatdan farqli darajada balandda turishi.

21. Namoz o‘quvchining – safda bo‘sh joy bo‘la turib – keyingi safda turishi.

22. Namozxon oldida, yon tarafida, kiyimida, sajdagohida jonli narsalar surati bo‘lishi (Agar surat orqada bo‘lsa, juda kichik yoki boshi o‘chirilgan bo‘lsa yoki jonsiz narsalar surati bo‘lsa, zarari yo‘q).

23. Olovga qarab namoz o‘qish. Chunki bunda namozxon majusiyga o‘xshab qoladi (Biroq, mehrobda chiroq turishining zarari yo‘q)

24. Namozxon oldidan birov o‘tishi ehtimoli bor joyda sutra qo‘ymasdan namoz o‘qish.

25. Kir, eski ish kiyimida namoz o‘qish.

26. Namozda oyatlarni, tasbehlarni barmoq bilan sanash.

Mazkur amallar bilan namoz buzilmaydi, lekin qusurli bo‘lib qoladi. Shuning uchun namozxon bunday ishlardan saqlangani ma’qul.",
'parse_mode'=>'html',
'reply_markup'=>$namozh,
]);
}
if($text == "Namozning mubohlari"){
bot('sendPhoto',[
'chat_id'=>$cid,
'photo'=>"https://t.me/TARIINISG/130",
'caption'=>"Quyidagilar Namozning mubohlaridir:",
'parse_mode'=>'html',
'reply_markup'=>$namozh,
]);
}
if($text == "Namozning mubohlari"){
bot('sendMessage', [
'chat_id'=>$cid,
'text'=>"1. Sajda qiladigan joyni zarurat uchun qo‘l bilan bir ikki marta surish

2. Ilon va chayonga o‘xshash chaqadigan hayvonlarni o‘ldirish

3. Nafl namozlarda bir rakatda bir surani takror o‘qish

4. Imom yanglishganda muqtadiylar takbir yoki tasbeh orqali imomni ogohlantirish

5. Ruku‘da badaniga yopishmasligi uchun kiyimlarini silkitish

6. Namozda ixtiyorsiz tahorati buzilgan kishi hech so‘zlamasdan tahorat qilib, kelgan joyidan boshlab, qolgan namozini o‘qish.",
'parse_mode'=>'html',
'reply_markup'=>$namozh,
]);
}
if($text == "Erkak va ayollar namozining farqlar"){
bot('sendPhoto',[
'chat_id'=>$cid,
'photo'=>"https://t.me/TARIINISG/130",
'caption'=>"Erkak va ayol kishi namozi o‘rtasidagi farqlar quyidagilardir:",
'parse_mode'=>'html',
'reply_markup'=>$namozh,
]);
}
if($text == "Erkak va ayollar namozining farqlar"){
bot('sendMessage', [
'chat_id'=>$cid,
'text'=>"1. Ayol takbiri tahrimada qo‘llarini yengidan chiqarmaydi.

2. Takbirda qo‘llarini ko‘kragi barobarigacha ko‘taradi.

3. Ayol qiyomda o‘ng qo‘l kaftini chap qo‘l kafti ustida qilib ko‘kragiga qo‘yadi.

4. Ruku‘da panjalarini ochmay, jamlab tizzaga qo‘yadi.

5. Ruku‘da o‘tirmoqchi bo‘lgan kishi kabi sal egiladi.

6. Ruku‘da tirsak (chig‘anoq)larini sonlariga, bilaklarini yonboshiga yopishtirib turadi.

7. Sajdada qornini soniga, qo‘l bilaklarini yerga yopishtirib turadi.

8. Qa‘dada dumbasi bilan o‘ng tomonidan ikki oyog‘ini chiqarib, chap iligi ustiga o‘ng iligini qo‘yib o‘tiradi.

9. Jahriy namozlarni ham maxfiy (ichida) o‘qiydi.",
'parse_mode'=>'html',
'reply_markup'=>$namozh,
]);
}
if($text == "Namozni buzish joiz bo‘lgan o‘rinlar"){
bot('sendPhoto',[
'chat_id'=>$cid,
'photo'=>"https://t.me/TARIINISG/130",
'caption'=>"Quyidagi holatlarda namozni buzish joiz hisoblanadi:",
'parse_mode'=>'html',
'reply_markup'=>$namozh,
]);
}
if($text == "Namozni buzish joiz bo‘lgan o‘rinlar"){
bot('sendMessage', [
'chat_id'=>$cid,
'text'=>"1.  Halokatning oldini olish uchun, garchi farz namozi bo‘lsa-da, buzishlik vojib bo‘ladi. 

Misol uchun bir kishi suvga cho‘kayotganligini bilsa yoki bir hayvon hujum qilsa, xoh u 
o‘ziga, xoh boshqa kishiga, xoh namoz o‘qiyotgan odamga, xoh tashqaridagiga bo‘lsin, 

shu halokatning oldini olish uchun namozini buzadi. 

2.   Bir dirham miqdoridagi molini o‘g‘ridan himoya qilish uchun, garchi farz namozini 

bo‘lsa ham, buzishlik joizdir. Bir dirham Suriyaning pulida o‘ttiz besh qirsh miqdoricha 

keladi. (Bizning O’zbek so‘mimizda 3250 so‘mga to‘g‘ri keladi. 2005-yil...- tarj.) 

3.   Ota yoki ona farzandini namoz o‘qiyotganini sezmay turib chaqirsa, farzand agar 

nafl namoz o‘qiyotgan bo‘lsa, faqat shu nafl namozni buzishlik joizdir. Ammo ota yoki 

ona farzandni namoz o‘qiyotganini bilib turib chaqirsa, farzand namozini buzishi joiz emas.",
'parse_mode'=>'html',
'reply_markup'=>$namozh,
]);
}
if($text == "🛐Namoz o‘qishni o‘rganamiz🤲"){
bot('sendPhoto',[
'chat_id'=>$cid,
'photo'=>"https://t.me/TARIINISG/130",
'caption'=>"O‘zingizga kerakli bo‘limni tanlang..!",
'parse_mode'=>'html',
'reply_markup'=>$namozo,
]);
}
if($text == "☑️Bomdod namozi☑️"){
bot('Sendvideo',[
'chat_id'=>$cid,
'video'=>"https://t.me/SACOLJFTUHV/135",
'caption'=>"Bomdod namozi o‘qilish tartibi.(Erkaklar uchun)",
'parse_mode'=>'html',
'reply_markup'=>$namozo,
]);
}
if($text == "☑️Bomdod namozi☑️"){
bot('Sendvideo',[
'chat_id'=>$cid,
'video'=>"https://t.me/SACOLJFTUHV/136",
'caption'=>"Bomdod namozi o‘qilish tartibi.(Ayollar uchun)",
'parse_mode'=>'html',
'reply_markup'=>$namozo,
]);
}
if($text == "☑️Peshin namozi☑️"){
bot('Sendvideo',[
'chat_id'=>$cid,
'video'=>"https://t.me/SACOLJFTUHV/137",
'caption'=>"Peshin namozi o‘qilish tartibi.(Erkaklar uchun)

Peshin namozining sunnati ham shu tartibda o‘qiladi, faqat niyatda 《...peshin namozining...》 deyiladi. 3-4 rakatlarda ham zam sura o‘qiladi",
'parse_mode'=>'html',
'reply_markup'=>$namozo,
]);
}
if($text == "☑️Peshin namozi☑️"){
bot('Sendvideo',[
'chat_id'=>$cid,
'video'=>"https://t.me/SACOLJFTUHV/138",
'caption'=>"Peshin namozi o‘qilish tartibi.(Ayollar uchun)",
'parse_mode'=>'html',
'reply_markup'=>$namozo,
]);
}
if($text == "☑️Asr namozi☑️"){
bot('Sendvideo',[
'chat_id'=>$cid,
'video'=>"https://t.me/SACOLJFTUHV/139",
'caption'=>"Asr namozi o‘qilish tartibi.(Erkaklar uchun)",
'parse_mode'=>'html',
'reply_markup'=>$namozo,
]);
}
if($text == "☑️Asr namozi☑️"){
bot('Sendvideo',[
'chat_id'=>$cid,
'video'=>"https://t.me/SACOLJFTUHV/140",
'caption'=>"Asr namozi o‘qilish tartibi.(Ayollar uchun)",
'parse_mode'=>'html',
'reply_markup'=>$namozo,
]);
}
if($text == "☑️Shom namozi☑️"){
bot('Sendvideo',[
'chat_id'=>$cid,
'video'=>"https://t.me/SACOLJFTUHV/143",
'caption'=>"Shom namozi o‘qilish tartibi.(Erkaklar uchun)

Shom namozining 2 rakat sunnati ovoz chiqarmay o‘qiladi, huddi Bomdod namozi sunnati kabi, faqst niyyatda 《...shom namozi...》 deyiladi.",
'parse_mode'=>'html',
'reply_markup'=>$namozo,
]);
}
if($text == "☑️Shom namozi☑️"){
bot('Sendvideo',[
'chat_id'=>$cid,
'video'=>"https://t.me/SACOLJFTUHV/144",
'caption'=>"Shom namozi o‘qilish tartibi.(Ayollar uchun)",
'parse_mode'=>'html',
'reply_markup'=>$namozo,
]);
}
if($text == "☑️Xufton namozi☑️"){
bot('Sendvideo',[
'chat_id'=>$cid,
'video'=>"https://t.me/SACOLJFTUHV/141",
'caption'=>"Xufton namozi o‘qilish tartibi.(Erkaklar uchun)",
'parse_mode'=>'html',
'reply_markup'=>$namozo,
]);
}
if($text == "☑️Xufton namozi☑️"){
bot('Sendvideo',[
'chat_id'=>$cid,
'video'=>"https://t.me/SACOLJFTUHV/142",
'caption'=>"Xufton namozi o‘qilish tartibi.(Ayollar uchun)",
'parse_mode'=>'html',
'reply_markup'=>$namozo,
]);
}
if($text == "☑️Namozdan keyin o‘qiladigan duolar☑️"){
bot('sendPhoto',[
'chat_id'=>$cid,
'photo'=>"https://t.me/SACOLJFTUHV/133",
'caption'=>"Alloh duolaringizni ijobat qilsin..!",
'parse_mode'=>'html',
'reply_markup'=>$namozo,
]);
}
if($text == "☑️Namozdan keyin o‘qiladigan duolar☑️"){
bot('sendMessage', [
'chat_id'=>$cid,
'text'=>"NAMOZDAN KEYINGI ZIKRLAR

Namoz salom bilan tugaydi. Salomdan keyingi amallar (tasbehotu duolar) majburiy emas, ammo nihoyatda savoblidir.
Farz namozlaridan keyin quyidagi duoni o‘qish sunnatdir:
Allohumma antas-salam va minkas-salam. Tabarokta ya zaljalali val ikrom.
Mazmuni:
Ey Allohim, Sen barcha ayb-nuqsonlardan poksan. Barcha salomatlik va rahmat Sendandir. Ey azamat va qudrat egasi bo‘lgan Allohim, Sening shoning ulug‘dir.
Umuman, har vaqt namozni tugatgandan so‘ng Oyatal kursi o‘qilsa, tasbehot qilinsa, savobi ulug‘ bo‘ladi.",
'parse_mode'=>'html',
'reply_markup'=>$namozo,
]);
}
if($text == "☑️Musofirning namozi☑️"){
bot('sendPhoto',[
'chat_id'=>$cid,
'photo'=>"https://t.me/TARIINISG/130",
'caption'=>"Qayerda bo‘lsangiz ham joningiz sog‘-salomat bo‘lsin. Ilohim eson-omon o‘z uyingizga qayting.!",
'parse_mode'=>'html',
'reply_markup'=>$namozo,
]);
}
if($text == "☑️Musofirning namozi☑️"){
bot('sendMessage', [
'chat_id'=>$cid,
'text'=>"Musofir namozi
Bizning dinimiz qulaylik, insonlarga marhamat dinidir. Chunonchi, u musofirlarga ham ancha yengilliklarni muhayyo qilib qo‘ygan. Yashab turgan joyidan o‘rtacha yurishda kamida 18 soatlik (90 chaqirim) masofaga o‘n besh kundan oz muddatni niyat qilib yo‘lga chiqqan kishi qishlog‘i yoki shahrining oxirgi uylari ko‘rinmay qolgan daqiqadan boshlab musofir hisoblanadi. O‘n besh kunga yo bundan ko‘pga niyat qilib chiqilsa, yo‘ldagina musofir sanaladi, borayotgan manzilining dastlabki uylari ko‘ringandan boshlab esa, muqim hukmiga o‘tadi va namozlarini to‘liq o‘qiydi.

Musofir odam to‘rt rakatlik farz namozlarini ikki rakatga qisqartirib (bomdod namozining farzi kabi) o‘qiydi. Biroq shom namozining uch rakat farzi va uch rakatlik vitr namozlarini to‘liq ado etadi. Agar musofir kishi muqim kishiga ergashib namoz o‘qisa, to‘rt rakatlik farzlarni ham to‘liq o‘qiydi. Muqim kishi musofir kishiga iqtido qilib namoz o‘qiyotgan bo‘lsa, unda imom ikki rakatdan so‘ng salom bergach, ergashuvchi salom bermaydi, ichida «Allohu akbar» deb qiyomga turadi-da, qolgan ikki rakatni mustaqil o‘zi o‘qib tugatadi.",
'parse_mode'=>'html',
'reply_markup'=>$namozo,
]);
}
if($text == "☑️Qazo namozlar☑️"){
bot('sendMessage', [
'chat_id'=>$cid,
'text'=>"QAZO NAMOZLARI

Mo‘min-musulmonlar namozlarini doimo vaqtida o‘qishga harakat qilishlari lozim. Lekin biror sabab bilan o‘qilmay qolsa, u namozning qazosi o‘qilishi kerak. Farz namozlar va vitr namozi qoldirilsa, qazo qilib o‘qiladi.
Qazo namozi va umuman har qanday namoz o‘qish makruh hisoblangan uch vaqt borki, bular kun chiqish, kun botish va kun tikkaga kelgan (qiyom) paytlaridir.
Namozni o‘tkazib yuborish katta gunohdir. Binobarin, qazo namozi o‘qilgach, Alloh taolodan mag‘firat tilash va har namozni o‘z vaqtida, qazo qilmay o‘qishni nasib etishini so‘rab duo qilish kerak.


SAJDAI SAHV

Namozning farz yo vojiblaridan biri vaqtidan kechiktirib bajarilsa yoki vojib amali unutilib, bajarilmasa, qa‘dai oxirada (oxirgi o‘tirishda) faqat «Attahiy- yat» o‘qilib, o‘ng tomonga salom beradi va «Allohu akbar», deb ikki marta sajda qiladi va yana o‘tirgan holda «Attahiyyat», «Salovot», «Robbana» duolarini o‘qib, o‘ng va chap tomonga salom berib namozni tugallaydi. Bu ikki sajda «sajdai sahv» (xatoni o‘nglaydigan sajda) deyiladi.",
'parse_mode'=>'html',
'reply_markup'=>$namozo,
]);
}
if($text == "☑️Juma namozi☑️"){
bot('sendPhoto',[
'chat_id'=>$cid,
'photo'=>"https://t.me/TARIINISG/130",
'caption'=>"Juma namozi - haftaning har juma kuni peshin namozi vaqtida masjidda ko‘pchilik o‘qiydigan namozdir",
'parse_mode'=>'html',
'reply_markup'=>$namozo,
]);
}
if($text == "☑️Juma namozi☑️"){
bot('sendMessage', [
'chat_id'=>$cid,
'text'=>"Tartibi 

Juma namozi ikki rakat farz boʻlib, undan oldin va keyin toʻrt rakat sunnat oʻqiladi. Ilk va oxirgi sunnatlar peshin namozining sunnatlari kabi oʻqiladi. Imomga iqtido qilib oʻqiladigan ikki rakat farz esa, bomdod namozining farzi kabi oʻqiladi. Juma namozida ikki rakat farz oʻqilmasdan oldin imom minbarda xutba qiladi. Juma namozi hur, ozod, muqim, salomatligi joyida, oyoqlari sogʻ kishiga farzdir.

Shartlari

peshin namozi oʻqiladigan vaqtda oʻqish;
namozdan oldin xutba oʻqish;
juma oʻqiladigan joy hammaga ochiq boʻlishi;
imomdan tashqari kamida uch kishidan iborat jamoat boʻlishi;
imom juma namozini oʻqishi uchun rasman ruxsatli boʻlishi;
juma oʻqiladigan joy shahar yoxud shahar hukmida boʻlishi kerak.",
'parse_mode'=>'html',
'reply_markup'=>$namozo,
]);
}
if($text == "☑️Ikki hayit namozlari☑️"){
bot('sendMessage', [
'chat_id'=>$cid,
'text'=>"Hayit namozlari ikki rakat vojib namoz bo‘lib, quyidagicha o‘qiladi: jamoat namoz o‘qishga hozir bo‘lib, saf tortganidan so‘ng hayit namozi o‘qishga niyat qilib, takbiri tahrima aytiladi (hayit namozlari uchun iqomat aytilmaydi). Va qo‘llar bog‘lanib, kindik ostida tutiladi. Hayit namozlariga bunday niyat qilinadi: «Shu vaqtda vojib bo‘lgan ro‘za (qurbon) hayiti namozini barcha takbirlari bilan shu imomga iqtido qilib, yuzimni Ka‘baning bir tarafiga qaratib, xolis Alloh uchun o‘qishni niyat qildim». Niyatdan so‘ng sano o‘qiladi. So‘ng imom eshittirib (qavm ichlarida) uch bor takbir («Allohu akbar») aytadi. Har takbirda qo‘llar quloqlar to‘g‘risigacha ko‘tariladi. Takbirlar orasida qo‘llar bog‘lanmaydi, yonda tutiladi. Bu holda uch bor takbir aytilgach, qo‘llar bog‘lanadi. So‘ng imom eshittirib qiroat qiladi, qavm jim eshitadi. Qiroatdan so‘ng ruku‘ va sajda qilinib, ikkinchi rakatga turiladi. Ikkinchi rakatda imom qiroatni tugatganidan so‘ng, rukudan oldin birinchi rakatda aytilgan tarzda uch bor takbir aytiladi. Va yana bir to‘rtinchi takbir aytilib, ruku‘ga boriladi va sajda qilinadi. Sajdadan so‘ng o‘tirib tashahhud, salovot va duo o‘qib salom beriladi.

Salomdan so‘ng imom minbarga chiqib, ikki xutba o‘qiydi. Imom birinchi xutbani ketma-ket to‘qqiz takbir, ikkinchi xutbani yetti takbir aytib boshlashi va ikkinchi xutbani o‘n to‘rt takbir aytib tugatishi mustahabdir.

Ikki hayit namoziga g‘usl qilib, eng yaxshi kiyimlarini kiyib, xushbo‘y bo‘lib borish sunnatdir. Ro‘za hayiti namozini ado qilishga borishdan oldin biror narsa yeb olish sunnat bo‘ladi. Qurbon hayiti namozini o‘qib bo‘lguncha esa hech narsa yemaslik sunnatdir. Qurbon hayiti namozini o‘qishga borishda yo‘lda ovoz chiqarib takbiri tashriq aytiladi.",
'parse_mode'=>'html',
'reply_markup'=>$namozo,
]);
}
if($text == "☑️Janoza namozi☑️"){
bot('Sendvideo',[
'chat_id'=>$cid,
'video'=>"https://t.me/TARIINISG/130",
'caption'=>"Janoza namozining o‘qilish tartibi.",
'parse_mode'=>'html',
'reply_markup'=>$namozo,
]);
}
if($text == "❌Gunohi kabiralar🚫"){
    bot('sendMessage',[
    'chat_id'=>$cid,
    'text'=>"<b> ❌Gunohi kabiralar🚫 </b> <i>boʻlimiga xush kelibsiz Marhamat o'zingizga kerakli bo'lgan bo'limni tanlang</i>",
    'parse_mode'=>"html",
    'reply_markup'=>$gunoh,
]);
}
if($text == "Shirk"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Birinchi gunohi kabira KATTA SHIRK 
Katta shirk – Allohga biron bir narsani sherik qilish, teng bilish va u zot bilan birga tosh, daraxt, quyosh kabi boshqa narsalarga ibodat qilishdir. U gunohi kabiralarning eng kattasidir. Allohning O‘zi saqlasin.  
«Albatta, Alloh O‘ziga (biron narsaning) sherik qilinishini kechirmas. Shundan boshqa gunohlarni O‘zi xohlagan kishilar uchun kechirur...» (Niso surasi, 48). Ya’ni shirkni kechirmaydi. O‘zi xohlagan bandalarining shirkdan boshqa gunohlarini kechiradi. Shirk Alloh taoloning:  
«...Albatta, Alloh (O‘zi xohlagan bandalarining) barcha gunohlarini mag‘firat qilur. Albatta, Uning o‘zigina mag‘firatli, mehribondir» (Zumar surasi, 53), oyati karimasidagi «barcha gunohlar» sirasiga kirmaydi.  
«...Chunki shirk keltirish katta zulmdir» (Luqmon surasi, 13).  
Ya’ni, shirk qabih amal va yaqqol zulmdir, bir narsani o‘z o‘rnidan boshqa o‘ringa qo‘yish, haqqini poymol qilishdir. Kimki yaratuvchi bilan yaralmish – maxluqni, iloh bilan but-sanamni barobar deb bilsa, shak-shubhasiz, u aqlsiz, ahmoqdir. «Zolim» deb nomlanishga, hayvonlar qatorida sanalishga loyiqdir.",
'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Shirk"){
bot ('sendMessage',[
'chat_id'=> $cid,
'text'=>"«Albatta, kimda-kim Allohga shirk keltirsa, Alloh unga jannatni harom qilur».  Kimki Allohdan boshqani iloh deb e’tiqod qilsa, hech qachon jannatga kirmaydi, degan ma’nolarni uqib olish mumkin. Chunki jannat Allohni bir deb biluvchi muvahhidlar makonidir.  
«...uning borar joyi do‘zaxdir. Zulm qilguvchilar uchun biron yordamchi bo‘lmas» (Moida surasi, 72). Ya’ni, uning uchun Allohning azobidan qutqaruvchi ham, yordamchi ham bo‘lmas. Bu haqda ko‘plab oyatlar mavjud.  
Kimki Allohga iymon keltirib, mo‘min holida vafot etsa, garchi do‘zaxda gunohiga yarasha azoblansa-da, aniq jannatiy bo‘lganidek, Allohga shirk keltirib mushrik holida o‘lgan kimsa, shak-shubhasiz do‘zaxiydir.  
Buxoriy va Muslim rivoyatida kelgan hadisi nabaviyyada shunday deyiladi: «Rasululloh sollallohu alayhi vasallam «Sizlarga gunohi kabiralarning eng kattalari haqida xabar beraymi?» deb uch bor so‘radilar. Biz: «Ha», dedik. «Allohga shirk keltirish, ota-onaga oq bo‘lish», dedilar. Suyangan holda edilar, shundan so‘ng o‘tirib oldilar-da: «Ogoh bo‘linglar, yolg‘on gapirish va yolg‘on guvohlik berish», deya takrorlayverdilar. Hattoki, biz qaniydi, sukut qilsalar, dedik» (Muttafaqun alayh).  
Rasululloh sollallohu alayhi vasallam: «Halok etuvchi yettita gunohdan saqlaninglar», dedilar-da, birinchi navbatda Allohga shirk keltirishni zikr qildilar.  
Rasululloh sollallohu alayhi vasallam aytdilar: «Ey Ibn Xattob, bor, odamlarga «jannatga faqatgina mo‘minlar kiradi», deb jar sol» (Muslim, Ahmad rivoyati).",
'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Riyo"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Ikkinchi gunohi kabira RIYO 
Alloh taolo munofiqlar haqida xabar bera turib: «Insonlarga riyo qiladilar», deydi. Ya’ni, ularning namoz o‘qishdan ko‘zlagan maqsadlari – Allohning yuzi emas, balki odamlar ko‘rib, eshitishlari – xo‘jako‘rsin uchundir. «Albatta, munofiqlar Allohni aldamoqchi bo‘ladilar. – Holbuki, Alloh ularni «aldab» qo‘yguvchidir.– Va ular qachon namozga tursalar dangasalik bilan, odamlar ko‘rsin, deb turadilar va Allohni kamdan-kam eslaydilar» (Niso surasi, 142).  
«Namozlarini «unutib» qo‘yadigan «namozxon»larga vayl bo‘lsin» (Mo’un surasi, 4-oyat). Namozlariga beparvo, yengiltaklik qilib uni o‘z vaqtidan kechiktirib o‘qiydigan kimsalarga halokat, azob bo‘lsin. «... ular riyokorlik qiladigan kimsalardir». Ular odamlar ko‘z o‘ngida «solih» deb aytishlari uchun namoz o‘qiydilar, «taqvodor» deb nom qozonish uchun xushu’li va huzu’li bo‘lib ko‘rinadilar va «saxiy» degan nom olish uchun ehson-sadaqa qiladilar. Ularning har bir amallari riyo va nom qozonish uchundir.  
«Bas, namozlarini «unutib» qo‘yadigan kimsalar bo‘lgan «namozxon»larga halokat bo‘lgayki; Ular riyokorlik qiladigan va ro‘zg‘or buyumlarini ham (kishilardan) man’ qiladigan (ya’ni, biron kishiga foydalari tegmaydigan) kimsalardir!» (Mo’un surasi, 4-7). Odamlarga kundalik ro‘zg‘or buyumlari – bolta, arra, igna, qozon kabi narsalarni ham berib turmaydilar.  
«Ey mo‘minlar, molini odamlarga ko‘rsatish uchun beradigan, Allohga va oxirat kuniga ishonmaydigan kimsaga o‘xshab, bergan sadaqalaringizni minnat va ozor bilan yo‘qqa chiqarmang...» (Baqara surasi, 264). Ya’ni, riyokor riyo qilgani sababli infoq-ehsonlarini yo‘qqa chiqargani singari, sizlar ham minnat va ozor bilan qilgan sadaqotlaringiz ajridan mahrum bo‘lib qolmang, deyilmoqda.  
«Bas, kim Parvardigoriga ro‘baro‘ bo‘lishidan umidvor bo‘lsa, u holda yaxshi amal qilsin va Parvardigoriga bandalik qilishda (riyokorlik bilan) biron kimsani (Unga) sherik qilmasin! (Ya’ni, qiladigan barcha amallarini Yolg‘iz Alloh uchun qilsin)» (Kahf surasi, 110).  
Abu Hurayra roziyallohu anhudan rivoyat qilinadi: «Rasululloh sollallohu alayhi vasallam aytdilar: «Qiyomat kunida birinchi bo‘lib hukm (hisob-kitob) qilinadigan kimsa – shahid kishi. Uni keltirishadi, so‘ng Alloh taolo unga ne’matlarini tanitadi, u tan oladi. «Bular evaziga nima qilding?» deb so‘raydi. «Sening yo‘lingda jang qildim, hattoki shahid bo‘ldim», deydi. «Yolg‘on aytding, sen «falonchi jur’atli» deb aytishlari uchun jang qilding. Sen istagan narsa aytildi», deydi. So‘ng buyuradi va u yuzi bilan sudralib, do‘zaxga uloqtiriladi. Keyin ilm o‘rganib, o‘rgatgan va Qur’on o‘qigan kishini keltirishadi. Alloh taolo unga ne’matlarini tanitadi, u tan oladi. «Bular evaziga nima qilding?» deb so‘raydi undan. «Sen uchun ilm o‘rganib, uni (boshqalarga) o‘rgatdim va Qur’on o‘qidim», deydi. «Yolg‘on aytding, sen olim, deb aytishlari uchun ilm o‘rganding va qori deb aytishlari uchun Qur’on o‘qiding. Bu gap aytildi», deydi. So‘ng buyuradi va u yuzi bilan sudralib, do‘zaxga uloqtiriladi. Keyin Alloh rizqini keng qilib qo‘ygan, turli tuman mol-dunyo ato etgan kishini keltiradilar. Alloh taolo unga ne’matlarini tanitadi, u tan oladi. «Bular evaziga nima qilding?» deb so‘raydi. «Sen infoq-ehson qilinishini yaxshi ko‘rgan biror yo‘lni qoldirmasdan Sen uchun infoq qildim», deydi. «Yolg‘on aytding, sen saxiy, deb aytishlari uchun shunday qilding. Bu narsa aytildi», deydi. So‘ng buyuradi va u yuzi bilan sudralib, do‘zaxga uloqtiriladi» (Muslim, Nasoiy va boshqalar rivoyat qilishgan).  
Rasululloh sollallohu alayhi vasallam aytadilar: «Riyoning ozginasi ham shirkdir!»  
Yana: «Sizlar xususingizda qo‘rqadigan narsalarimning eng qo‘rqinchlisi kichkina shirk», dedilar. «Kichkina shirk nima?» deyishdi. «Riyo» dedilar.  
Yana: «Insonlar amallariga yarasha jazo-mukofot olgan vaqtida Alloh taolo (riyokorlarga): «Dunyoda kimlar uchun riyo qilgan bo‘lsangiz, o‘shalarga boringlar. Qaranglar-chi, ularning huzurida biron mukofot toparmikansiz?!» deydi», deganlar (Imom Ahmad rivoyati).  
Rasululloh sollallohu alayhi vasallam aytganlarki: «Alloh taolo: «Men sheriklarning shirkdan behojatrog‘iman. Kimki Men uchun biron amalni qilsa, unda boshqani Menga sherik qilsa, Men undan behojatman. U o‘sha «sherik» uchundir», dedi» (Ibn Moja rivoyati).",
'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Riyo"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Yana aytadilar: «Kimki (odamlar) eshitsin desa, Alloh eshittirib qo‘yadi va (odamlar) ko‘rsin desa, Alloh ko‘rsatib qo‘yadi» (Muttafaqun alayh).  
Ya’ni, kimki odamlar ko‘rishi yoki eshitishi uchun biron amalni qilsa, qiyomat kunida Alloh taolo uning buzuq niyatini fosh etadi va guvohlar huzurida sharmanda qiladi.  
Ibn Umar roziyallohu anhudan rivoyat qilinadi: «Rasululloh sollallohu alayhi vasallam aytdilar: «Ko‘p ro‘zadorlar borki, ularning ro‘zasidan oladigan «ulush»lari faqat ochlik va tashnalikdir, ko‘plab kechalari qoim bo‘luvchilar borki, ularning qoimlikdan oladigan «ulush»lari faqat bedorlik, xolos» (Tabaroniy rivoyati).  
Ya’ni, agar namoz va ro‘za Alloh taoloning roziligi uchun bo‘lmas ekan, unga savobi berilmaydi.  
Ba’zi hukamolar aytishgan ekan: «Riyo va sum’a (odamlar eshitishi) uchun amal qilgan kimsa hamyonini toshlar bilan to‘ldirib olgan kishiga o‘xshaydi. U bozorga bir narsa sotib olish uchun kirib, sotuvchining oldida hamyonini ochsa, ichi to‘la tosh bo‘ladi va sotuvchi toshlarni uning yuziga otadi. Insonlarning: «Hamyoni juda to‘la ekanmi?» degan so‘zlaridan boshqa unga hech bir manfaat yo‘q va unga hech vaqo berilmaydi».  
Xuddi shunga o‘xshab riyo va odamlar eshitsin, deb qilingan amallardan zarracha foyda yo‘q, oxiratda unga savob ham berilmaydi.  
«(Zotan), Biz ular qilgan har bir (yaxshi) amalga kelib, uni sochilgan to‘zon (kabi) qilib qo‘ygandirmiz» (Furqon surasi, 23).  
Ya’ni, Allohning roziligidan boshqa narsa uchun qilgan amallarini savobsiz qoldiramiz va ularni quyosh nurida ko‘rinadigan g‘ubor kabi qilib qo‘yamiz, deyilmoqda.  
Adiy ibn Xotim roziyallohu anhudan rivoyat qilinadi: «Bir toifa odamlarni do‘zaxdan jannatga olib borish buyuriladi. Ular jannatga yaqinlashib, uning bo‘ylarini hidlab, undagi qasrlar va Alloh jannat ahli uchun hozirlab qo‘ygan narsalarni ko‘rishgach, «Ularni jannatdan burib yuboringlar, u yerda ularga nasiba yo‘q», deb nido qilinadi. Shunda ular: «Parvardigoro, bizga jannatingni va u yerda do‘stlaring uchun hozirlab qo‘ygan narsalaringni (noz-ne’matlaringni) ko‘rsatmasdan turib do‘zaxga kiritganingda, bizga osonroq bo‘lardi», deyishadi. «Men sizlarga shuni iroda qildim, – deydi. – Chunki sizlar yolg‘iz qolganingizda, ulkan gunohlar bilan Menga qarshi chiqdingiz va odamlarga yo‘liqsangiz, ularga itoatkor – taqvodor bo‘lib ko‘rindingiz. Insonlarga qalbingizdan Men uchun bergan narsalaringizning teskarisini ko‘rsatdingiz. Odamlardan qo‘rqdingiz, Mendan qo‘rqmadingiz. Odamlarni ulug‘ladingiz, Meni ulug‘lamadingiz. Odamlarni deb (biron gunoh ishni) tark etdingiz, Men uchun tark etmadingiz. Mana bugun sizlarni savobdan mahrum etganimdek, alamli azobga giriftor qilaman».",
'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Riyo"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Ba’zi hukamolardan: «Muxlis (ixlosli odam, riyokorning ziddi) kim?» deb so‘ralganida: «Muxlis – yomonliklarni yashirgani singari, yaxshiliklarini ham yashirgan kishi», deya javob berishgan.  
Ayrim zotlardan: «Ixlosning g‘oyasi-mag‘zi nima?» deb so‘rashganida, «Odamlar maqtashini yomon ko‘rishing», deya javob berishgan. Alloh taoloning:  
«... (Chunki u Kunda) ularga Alloh tomonidan ular o‘ylab ham ko‘rmagan narsalar – azoblar ko‘rindi» (Zumar surasi, 47), oyati haqida shunday deyilgan: «Ular dunyoda ayrim amallarni qilib, ularni yaxshi ish, deb o‘ylab yurishardi. Qiyomat kunida esa, bu amallarning yomon ekani ma’lum bo‘lib qoldi». Ayrim salafi solihlar bu oyatni o‘qigan vaqtlarida: «Riyokorlarga vayl bo‘lsin», der edilar.  
Riyokorlar qiyomat kunida to‘rtta nom bilan chaqiriladi: «Ey riyokor, xiyonatkor, ey fojir, ey ziyonkor, bor, kim uchun amal qilgan bo‘lsang, o‘shandan ajr-mukofotingni olaver. Bizning huzurimizda sen uchun ajr yo‘q».  
Hasan (rahmatullohi alayh) aytganlarki: «Riyokor o‘zi haqidagi Allohning taqdiridan g‘olib bo‘lishni xohlaydi. U o‘zini «solih» deb atashlarini istaydi. Uni qanday qilib solih desinlar, holbuki, u Parvardigori tomonidan tuban o‘ringa tushib qolgan bo‘lsa. Mo‘minlarning qalblari uni tanib, ajratib olishlari shart».  
Qatoda roziyallohu anhu shunday deydilar: «Agar banda riyo qilsa, Alloh: «Bandam Meni qanday masxara qilayotganini qaranglar», deydi.  
Rivoyat qilinishicha, Umar roziyallohu anhu bo‘ynini egib olgan kishini ko‘rdilar va unga: «Ey bo‘yin egasi, bo‘yningni ko‘tar. Xushu’ bo‘yinlarda emas, qalblarda bo‘ladi», dedilar.  
Abu Umoma Bohiliy roziyallohu anhu masjidda sajda qilgan holida yig‘lab duo qilayotgan kishining oldiga keldi-da: «Sen yaxshisan (ya’ni, bu ishing yaxshi), faqat bu ishni uyingda qilganingda edi», dedilar.  
Muhammad ibn Muborak Suvariy aytadilar: «Xushxulqingni tunda izhor qil, bu ish kunduzi izhor qilganingdan yaxshiroqdir. Chunki kunduzgi xushxulqliliging maxluqlar uchun, kechqurungi intilish olamlar Parvardigori uchundir».  
Ali ibn Abu Tolib roziyallohu anhu riyokorning uchta alomati bo‘lishini bayon qilganlar: «Yolg‘iz o‘zi bo‘lsa, dangasalik qiladi, odamlar davrasida serg‘ayrat bo‘ladi, odamlar maqtagan ishni ko‘paytirib, qoralagan ishni kamaytiradi».  
Fuzayl ibn Iyoz aytganlar: «Odamlar sababli bir ishni tark etish – riyo, odamlar sababli bir ishni qilish – shirkdir. Alloh seni shu ikkisidan omon saqlashi esa ixlosdir».  
Alloh taolodan bizni amallarimiz, so‘zlarimiz va barcha holatlarimizda ixlosli etmog‘ini so‘raymiz.",
'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Kibr"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Uchinchi gunohi kabira 
KIBR, MANMANLIK, G'URUR 
Alloh taolo aytadi:  
«Men yerda nohaq kibru havo qilib yuradigan, agar barcha oyat- mo‘’jizalarni ko‘rsalar ham, ularga iymon keltirmaydigan, To‘g‘ri yo‘lni ko‘rsalar uni (o‘zlari uchun) yo‘l qilib olmaydigan, agar zalolat – noto‘g‘ri yo‘lni ko‘rsalar, uni yo‘l qilib oladigan kimsalarni O‘z oyat-mo‘’jizalarimdan burib yuborurman (ya’ni, anglab yetmaydigan qilib qo‘yurman)» (A’rof surasi, 146).  
Ya’ni, takabbur kimsalarni oyatlarimni fahmlash, u haqda fikr yuritib, tadabbur qilishdan mahrum qilaman va kibru havo qilganlariga jazo sifatida qalblarini muhrlab qo‘yaman. 
«Muso aytdi: «Albatta men, Parvardigorim va Parvardigoringiz (bo‘lmish Alloh)dan hisob-kitob Kuniga iymon keltirmaydigan barcha mutakabbir (kimsalarning yomonligi)dan panoh so‘raganman» (Fofir surasi, 27).  
«Albatta, U Zot mutakabbir kimsalarni sevmas» (Nahl surasi, 23). Ya’ni, haqqa quloq solib, unga bo‘ysunishdan kibr qilgan kimsalarni sevmaydi.  
«Odamlardan (mutakabbirlik bilan) yuzingni o‘girma va yerda kibru havo bilan yurma. Chunki Alloh barcha kibr-havoli, maqtanchoq kimsalarni suymas» (Luqmon surasi, 18).  
Abdulloh ibn Umar roziyallohu anhudan rivoyat qilinadi: «Rasululloh sollallohu alayhi vasallam aytdilar: «Sizlardan ilgari yashab o‘tgan bir kishini takabburlik bilan izorini sudrab yurganida yer yutdi. U qiyomat kunigacha yer (qa’ri)ga kirib ketaverdi» (Buxoriy, Nasoiy va boshqalar rivoyati).  
Amr ibn Shu’aybning bobosidan rivoyat qilinadi: «Rasululloh sollallohu alayhi vasallam aytdilar: «Qiyomat kunida mutakabbir kimsalar kishi suratidagi chumolilarga o‘xshash holda qayta tiriladilar. Ularni har tomondan xorlik egallab oladi. Ular jahannamdagi «Bulis» deb nomlanadigan zindonga haydaladilar» (Nasoiy, Termiziy rivoyati).  
Ibn Mas’ud roziyallohu anhudan rivoyat qilinadi: «Rasululloh sollallohu alayhi vasallam: «Qalbida zarra misqolicha kibr bo‘lgan kishi jannatga kirmaydi», dedilar. Shunda bir kishi: «Bir odam kiyimi va poyabzali bejirim bo‘lishini yaxshi ko‘radi, shu narsa kibrmi?» deb so‘radi. «Albatta, Alloh go‘zaldir, go‘zallikni xush ko‘radi, u kibr emas. Kibr haqqa unamaslik – rad etish va odamlarni masxara qilish – tahqirlashdir», dedilar Nabiy» (Muslim, Termiziy rivoyati).",
'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Kibr"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Abu Said va Abu Hurayra roziyallohu anhumolardan rivoyat qilinadi: «Rasululloh sollallohu alayhi vasallam aytdilar: «Alloh azza va jalla: «Azizlik izorim, kibriyo ridoimdir. Kim (bu ikkisini) Men bilan talashsa, uni azoblayman», deydi» (Muslim rivoyati).  
Abu Said Xudriy roziyallohu anhudan rivoyat qilinadi: «Payg‘ambar sollallohu alayhi vasallam aytdilar: «Jannat bilan do‘zax talashib qolishdi. Do‘zax: «Zo‘ravon va mutakabbir kimsalar menda», degan edi, jannat: «Zaif va miskin musulmonlar menda», dedi. Alloh ular orasida ajrim qilib dedi: «Jannat, sen Mening rahmatimsan, sen orqali xohlagan bandalarimga rahm qilaman. Do‘zax, sen Mening azobimsan, sen orqali xohlagan bandalarimni azoblayman. Ikkingiz ham to‘lib toshasiz» (Muslim rivoyati).  
Harisa ibn Vahb roziyallohu anhudan rivoyat qilinadi: «Rasululloh sollallohu alayhi vasallamning: «Sizlarga do‘zax ahli kimlar ekanini xabar qilaymi? (Ular) qo‘pol, yaxshiliklardan to‘suvchi va mutakabbir kimsalardir», deganlarini eshitganman» (Buxoriy va Muslim rivoyati).  
Ibn Umar roziyallohu anhumodan rivoyat qilinadi: «Rasululloh sollallohu alayhi vasallamning: «Kimki o‘zini boshqalardan afzal, deb bilsa, yoki kibr-havo bilan yursa, Alloh taborak va taoloni g‘azablangan holda uchratadi», deganlarini eshitdim» (Tabaroniy rivoyati). 
Abu Hurayra roziyallohu anhudan rivoyat qilinadi: «Rasululloh sollallohu alayhi vasallam aytdilar: «Menga do‘zaxga birinchi bo‘lib kiradigan uch toifa ko‘rsatildi. Zolim amir, molidagi Alloh haqini ado qilmaydigan boy va mutakabbir kambag‘al» (Ibn Xuzayma, Ibn Hibbon rivoyati).  
Ibn Umar roziyallohu anhumodan rivoyat qilinadi: «Payg‘ambar sollallohu alayhi vasallam aytdilar: «Kimda-kim takabburlik qilib kiyimini sudrab yursa, qiyomat kunida Alloh unga qaramaydi» (Buxoriy rivoyati).  
Salama ibn Akva’ roziyallohu anhudan: «Bir kishi Rasululloh sollallohu alayhi vasallamning huzurlarida chap qo‘li bilan taom yedi. «O‘ng qo‘lingda ye», degandilar, «Yeyolmayman», dedi. Shunda Nabiy: «Yeyolmay qol», dedilar. Uni o‘ng qo‘lda yeyishdan faqat kibr to‘sib turgan edi. Shundan keyin u o‘ng qo‘lini og‘ziga olib borolmaydigan bo‘lib qoldi» (Muslim rivoyati).  
Ayrim salafi solihlar aytganlarki, Allohga osiylik qilib sodir etilgan birinchi gunoh kibrdir. Alloh taolo aytadi:  
«(Ey Muhammad alayhissalom), eslang, Biz farishtalarga Odamga ta’zim qiling deyishimiz bilan ular sajdaga egildilar. Faqat Iblis kibr va or qilib, kofirlardan bo‘ldi» (Baqara surasi, 34).  
Kimki Iblisga o‘xshab haqdan kibr qilsa, uning iymoni befoydadir.  
Bandalardan ilmi tufayli takabburlik qiladigan va o‘zini boshqalardan afzal deb biladigan kimsa eng yomon mutakabbirdir. Uning ilmi ham befoydadir. Zero, kimki oxirat uchun ilm talab qilsa, ilmi uni bosiq – tavoze’li qilib qo‘yadi, qalbi xushu’ga to‘ladi va nafsi xotirjam bo‘ladi. Ilm uning nafsiga qo‘riqchi-posbon bo‘lib oladi va yalqovlik qilmasdan har vaqt uni nazorat qilib, hisob-kitob qilib turadi. Bordi-yu, g‘aflatda qolsa, nafs haq yo‘ldan bo‘yin tovlaydi va halok etadi.  
Kimda-kim faxrlanish, boshliq bo‘lish, musulmonlarni ahmoq qilish, masxaralash va o‘zini ustun qo‘yish uchun ilm talab qilsa, yuqoridagi oyat va hadislarda aytilganidek jannatga kirmaydi».  
Kuch va quvvat buyuk va oliy Allohnikidir.",
'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Z'oravonlik"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"To‘rtinchi gunohi kabira 
ZO‘RAVONLIK, HADDAN OSHISH 
Alloh taolo deydi:  
«Insonlarga zulm qiladigan va yerda nohaq zo‘ravonlik – kibru havo qiladigan kimsalarning – ana o‘shalarning jazosi alamli azobdir» (Sho‘ro surasi, 42).  
Ya’ni, insonlarga zulm qiladigan tajovuzkorlar, odamlarning jonlari-yu, mollariga zug‘um o‘tkazadigan zo‘ravonlarning jazosi alamli azobdir. 
Payg‘ambar sollallohu alayhi vasallam aytdilarki: «Alloh taolo menga tavoze’li bo‘lishingizni vahiy qildi. Toki bir odam boshqasiga zo‘ravonlik qilmasin, bir odam boshqasidan o‘zini ustun qo‘ymasin» (Muslim rivoyati).  
Rasululloh sollallohu alayhi vasallam aytdilar: «Alloh gunoh qilgan kimsaga ham bu dunyoda jazo berib, ham oxiratga nasiba – azob hozirlab qo‘yishi uchun zo‘ravonlik va qarindosh-urug‘chilik aloqalarini uzishdan ko‘ra loyiqroq gunoh yo‘q» (Ibn Moja, Termiziy, Hakim rivoyati).  
Asarlarda kelganki, agar bir tog‘ boshqa toqqa zo‘ravonlik qilsa, Alloh o‘sha zo‘ravon tog‘ni mayda-mayda qilib yuboradi.  
Qorun ham qavmiga zo‘ravonlik qilgani uchun Alloh uni yerga yutdirib tashladi. Alloh taolo u haqda shunday xabar qilgan:",
'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Z'oravonlik"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Albatta, Qorun o‘zi Muso qavmidan edi. Bas, u (qavmdoshlariga) kibr havo qildi... Bas, Biz (Qorunni) ham, uning hovli-joyini ham Yerga yutdirdik» (Qasos surasi, 76-81).  
Ibn Javziy aytganlarki, Qorunning haddan oshishi borasida bir qancha qarashlar bor: 1. U bir fohishaga Muso alayhissalomga tuhmat qilgin, nomini badnom etgin, deb pul beradi. U shunday qiladi. Muso alayhissalom undan aytgan gapiga qasam ichishini talab etadi. U Qorun bilan o‘rtasida bo‘lib o‘tgan gap-so‘zni xabar qiladi. Qorun shunday qilib haddidan oshgan. Bu gap Ibn Abbosning fikri. 2. U Alloh azza va jallaga kufr keltirib haddidan oshgan. Zahhok shunday degan. 3. Kibr qilib haddidan oshgan. Bu Qatodaning fikri. 4. Kiyimlarini bir qarich uzun qilib sudrab yurgan. Ato Xurosoniy shunday degan. 5. U Fir’avnning xodimi bo‘lgan va Bani Al-Isroilga zulm va tajovuz qilgan. Movardiy shu fikrni bildirgan.  
 «Bas, Biz o‘zini ham, hovli joyini ham (erga) yutdirdik» oyati karimasining sharhida shunday deyiladi: «Qorun fohishani Muso alayhissalomga tuhmat qilishga buyurgach, Muso alayhissalom darg‘azab bo‘ldilar va Qorunni duoibad qildilar. Shunda Alloh taolo: «Men yerga senga itoat etishni buyurdim. Bas, unga buyur», deb vahiy qildi. Muso alayhissalom: «Ey yer, uni yut», dedi. Yer uni yutib yubordi. Qorun buni ko‘rgach, Muso alayhissalomdan rahm qilishni o‘tinib, yolvora boshladi. U zot: «Ey yer, uni yut», degan edi, oyoqlarini yutib yubordi. Muso alayhissalom Qorunni butunlay yutib yuborgunigacha, «uni yutgin», deb buyuraverdi. Shunda Alloh taolo u zotga vahiy qildi: «Ey Muso, izzatim va ulug‘ligimga qasamki, agar Mendan yordam so‘raganida, unga najot berardim».  
Ibn Abbos roziyallohu anhumo aytdilarki, yer uni qa’riga yutib yubordi.  
Samura ibn Jundub roziyallohu anhu aytdilarki, u tunu kun bo‘yi barobar yer tagigacha kirib ketaverdi. Muqotil aytganlarki, Qorun halok bo‘lgach, Bani Isroil: «Muso uning hovlisi va hisobkitobini o‘ziniki qilib olish uchun halok etdi», deb gap tarqatdi. Alloh uning hovlisi-yu, mol-dunyosini ham yerga yuttirib yubordi. 
 «So‘ng uning uchun Allohdan o‘zga yordam beradigan biron jamoat bo‘lmadi va uning o‘zi ham g‘oliblardan bo‘lmadi» (Qasos surasi, 81). Ya’ni, hech kim uni Allohning balosidan qutqarolmadi.  
Parvardigoro, gunohlarimiz zulmatini ma’rifat va hidoyating nuri ila nurafshon et. Bizni O‘zing iqbol etgan, Sendan boshqalarga yuz burmaydigan bandalaringdan ayla. Bizni, ota-onamizni va barcha mo‘minlarni mag‘firat qil. Omin.",
'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Makr va Aldov"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Beshinchi gunohi kabira 
MAKR VA ALDOV  
Alloh taolo aytadi:  
«Yomon makr-hiyla esa faqat o‘z egalarini o‘rab halok qilur» (Fotir surasi, 43).  
Ya’ni, yomon makr-hiylaning kasofati makr qilgan, uyushtirgan kimsalarning o‘ziga uradi. Alloh taolo munofiqlar haqida shunday deydi: «Albatta munofiqlar Allohni aldamoqchi bo‘ladilar. Holbuki, Alloh ularni «aldab» qo‘yguvchidir» (Niso surasi, 142).  
Vohidiy aytganlarki, ular aldamoqchi bo‘lganlari uchun o‘zlariga yarasha muomala qilinadi. Ya’ni, xuddi mo‘minlarga berilgani singari ularga ham nur beriladi. Yo‘lga tushganlarida esa nurlari o‘chib qoladi-da, zulmatda qolib ketadilar.  
Payg‘ambar sollallohu alayhi vasallam: «Do‘zax ahli besh toifa», dedilar-da, ulardan biriga «tong otsa ham, kech kirsa ham seni ahli oilang va molu dunyoing borasida aldamoqchi bo‘ladigan kimsa», deb ta’rif berdilar (Muslim rivoyati).  
Abu Hurayra roziyallohu anhudan rivoyat qilinadi: «Rasululloh sollallohu alayhi vasallam aytdilarki: «Mo‘min sodda, ulug‘ bo‘ladi, fojir esa makkor, xor bo‘ladi» (Termiziy, Abu Dovud rivoyati).  
Ya’ni, mo‘min odam ochiqko‘ngil, sodda bo‘ladi. Birovga makr qilmaydi. Balki o‘zi ishonuvchan, ochiqko‘ngil bo‘lgani sababli aldanib qolishi mumkin. Fojir esa odamlar orasida fasod qo‘zg‘ab yuradigan aldoqchi bo‘ladi.  
Abu Bakr Siddiq roziyallohu anhudan rivoyat qilinadi: «Rasululloh sollallohu alayhi vasallam: «Aldoqchi, minnatchi va baxil jannatga kirmaydi», dedilar» (Termiziy rivoyati).",
'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Musibat paytida haddan oshish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Yigirmanchi gunohi kabira 
MUSIBAT CHOG'IDA HADDIDAN OSHISH 
Rasululloh sollallohu alayhi vasallam aytdilar: «Yuzlariga uradigan, yoqalarini yirtadigan va johiliyat da’volari bilan baqirib-chaqiradigan kimsalar bizdan emas» (Buxoriy rivoyati).  
Abu Burda roziyallohu anhu aytadilar: «Abu Muso Ash’ariy dardga chalindilar. Boshlarini ayolining tizzasiga qo‘ygan holda hushlaridan ketdilar. Ayoli zorlanib dod-voy qila ketdi. Uni biron yo‘sin bilan qaytarishga qurblari yetmadi. O‘zlariga kelgach: «Men Rasululloh sollallohu alayhi vasallam pok-begona bo‘lgan kimsalardan pokman. Rasululloh sollallohu alayhi vasallam esa, musibat chog‘ida dod-voy solib baqiradigan, sochlarini yuladigan va kiyimlarini yirtadigan ayollardan pokdirlar», dedilar» (Buxoriy va Muslim rivoyati).  
Mazkur hadisda bayon qilingan noo‘rin xatti-harakatlar harom ekanligiga ulamolar ittifoq qilishgan. Xuddi shuningdek, sochini yoyib olish, yanoqlariga shapatilash, yuzini yumdalash va o‘ziga o‘lim – halokat tilash ham haromdir.  
Ummu Atiyya (roziyallohu anho) aytadilar: «Rasululloh sollallohu alayhi vasallam bizdan bay’at chog‘ida dod-voy solib yig‘lamaslikka ahd olganlar» (Buxoriy rivoyati).  
Sarvari olam sollallohu alayhi vasallam aytdilar: «Insonlar o‘zlaridagi narsa sababli kofir bo‘ladilar, nasabga ta’na qilish va mayyitga dod-voy solib yig‘lash» (Muslim rivoyati)",
'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Musibat paytida haddan oshish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"No‘mon ibn Bashir roziyallohu anhu aytadilar: «Abdulloh ibn Ravoha hushlaridan ketdilar. Singlisi yig‘lab: «Ey tog‘im, ey falonim, ey fistonim», deya sanay ketdi. U zot hushlariga kelgach: «Sen nima degan bo‘lsang, mendan «Sen shunaqamisan?» deb so‘rashdi», dedilar».  
Rasululloh sollallohu alayhi vasallam aytdilar: «Dod-voy solib yig‘laganliklari sababli mayyit qabrida azoblanadi» (Buxoriy va Muslim rivoyati).  
Abu Muso roziyallohu anhudan rivoyat qilinadi: Rasululloh sollallohu alayhi vasallam aytdilar: «Qaysi odam o‘lsa-yu, uning yig‘lovchilari: «Ey suyangan tog‘im, ey sayyidim», desa yoki shu kabi so‘zlarni aytsa, mayyitga ikki farishta vakil qilinadi-da, ko‘kragidan itarishib: «Sen shunaqamisan?» deb so‘rashadi» (Termiziy rivoyati).  
Payg‘ambar sollallohu alayhi vasallam yana aytganlar: «Dod solib yig‘lovchi ayol agar o‘lmasidan oldin tavba qilmasa, qiyomat kunida qatrondan (qora yelimdan) ko‘ylak va qora qo‘tirdan sovut kiygan holda turg‘aziladi» (Muslim va Ibn Moja rivoyati).  
Rasululloh sollallohu alayhi vasallam aytganlar: «Men ikki ahmoqona, gunohkorona ovozdan qaytarildim: xursandchilik vaqtdagi ovoz – o‘yin-kulgi va shayton surnayi (nag‘masi) hamda musibat chog‘idagi ovoz, yuzni yumdalab, yoqani yirtish va zorlanish» (Termiziy rivoyati).  
Abu Said Xudriy roziyallohu anhu aytadilar: «Rasululloh sollallohu alayhi vasallam dod solib yig‘lovchi va unga quloq soluvchi ayollarni la’natlaganlar» (Abu Dovud rivoyati).  
Rasululloh sollallohu alayhi vasallam aytdilar: «Ikki ovoz dunyo va oxiratda la’natlangandir: ne’mat – xursandchilik vaqtidagi nag‘ma va musibat chog‘idagi zorlanish» (Bazzor rivoyati).  
Rivoyat qilinishicha, dod solib yig‘lovchilar qiyomat kuni jahannamda ikki qator qilib teriladi. Biri o‘ng tarafda, ikkinchisi chap tarafda. Ular do‘zax ahliga qarab xuddi itlar singari akillaydilar.  
Avzo’iy aytadilar: «Umar ibn Xattob roziyallohu anhu bir hovlida yig‘i ovozini eshitib, u yerga kirdilar. Yonlarida sherigi ham bor edi. U yerdagi ayollarni turtib-surib o‘tib, dod solib aytib yig‘lovchi ayolning oldiga bordilar-da, uni urdilar. Ayolning ustidan yopinchig‘i tushib ketdi. «Ur uni, – dedilar. – U dod solib yig‘lovchidir, behurmatdir. U sizlarning qayg‘ularingizga sherik bo‘lib yig‘layotgani yo‘q, balki pullaringizni olish uchun ko‘z yoshlarini to‘kyapti. U qabrlardagi o‘liklaringizga ozor beradi. Chunki u sabrdan qaytaradi, holbuki, Alloh sabrga buyurgan. U betoqatlikka buyuradi, holbuki Alloh undan qaytargan».  
Dod solib yig‘lash – ovozda mayyitning yaxshi xislatlarini sanab yig‘lashdir.",
'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Musibat paytida haddan oshish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Dod solib yig‘lovchi ayol betoqatlikka targ‘ib qilib, sabrdan qaytarganligi sababli malomat va azobga giriftordir. Holbuki, Alloh va Rasuli sollallohu alayhi vasallam sabrga va savob umid qilishga buyurib, betoqatlik va g‘azablanishdan qaytargan.  
«Ey mo‘minlar, sabr qilish va namoz o‘qish bilan (Mendan) madad so‘ranglar! Albatta Alloh sabr qilguvchilar bilan birgadir» (Baqara surasi, 153).  
Ibn Abbos roziyallohu anhumo aytganlar: «Alloh taolo: «Men sizlar bilan birgaman, sizlarga yordam beraman, o‘z holingizga tashlab qo‘ymayman», deyapti».  
«Va, albatta, sizlarni xavfu xatar, ochlik, molu jon va meva-chevalarni kamaytirish kabi narsalar bilan imtihon qilamiz. Biror musibat kelganda: «Albatta, Biz Allohning (bandalarimiz) va, albatta, biz U zotga qaytguvchilarmiz», deydigan sabrli kishilarga xushxabar bering! Ana o‘shalarga Parvardigorlari tomonidan salovot (mag‘firat) va rahmat bordir. Ana o‘shalar haq yo‘lni topguvchilardir» (Baqara surasi, 155–157).  
«Sizlarni imtihon qilamiz» jumlasining ma’nosi «sizlarga imtihon qiluvchidek muomalada bo‘lamiz», deganidir. Chunki Alloh taolo barcha ishlarning oqibatini biladi, oqibat – natijani bilish uchun imtihon qilib ko‘rishga muhtoj emas. Endi kimki sabr qilsa, sabriga yarasha savob oladi, sabr qilmasa, savobga ega bo‘lmaydi.  
«... xavfu xatar va ochlik bilan», degani dushman xavfi hamda ocharchilik va qurg‘oqchilik bilan, deganidir.  
Molga ziyon yetishi, talofatga uchrashi, chorvalarning halok bo‘lishi molni kamaytirish bo‘lsa, o‘lish, qatl etilish, kasalga chalinish va keksayish jonni kamaytirishdir. Mevachevalarni kamaytirish esa meva-chevayu, ekin-tikinlarga ofat yetishi, hosilning kamayib ketishi bilan bo‘ladi.  
Oyat musibatlarga sabr qilgan kishi Alloh taoloning savobiga musharraf bo‘lishi haqidagi xushxabar bilan xotimalangan. Ushbu baxtiyor zotlar mazkur musibatlardan birontasiga duchor bo‘lgan vaqtlarida: «Albatta, biz Allohning bandalarimiz va, albatta, biz U zotga qaytguvchilarmiz», deyishadi. Ya’ni, biz Allohning qullarimiz, bizning ustimizda xohlagandek tasarruf qiladi va biz oxir oqibat U zot huzuriga, hukmiga qaytamiz.  
Said ibn Musayyabdan rivoyat qilindiki, Umar ibn Xattob roziyallohu anhu aytdilar: «Naqadar yaxshi ikki bashorat va qanday ham yaxshi ilova. «Ana o‘shalarga Parvardigorlari tomonidan salovot (mag‘firat) va rahmat bordir» – bu ikki bashorat, «Ana o‘shalar haq yo‘lni topguvchilardir» – bu ilova».  
Said ibn Jubayr aytganlar: «Darhaqiqat, musibat chog‘ida bu ummatga ilgarigi payg‘ambarlarga berilmagan narsa – «Albatta, biz Allohning (bandalarimiz) va, albatta, biz U zotga qaytguvchilarmiz» iborasi berilgan. Mabodo payg‘ambarlarga berilganda edi, Yo’qub alayhissalomga ham berilgan bo‘lardi. U zot o‘g‘lini yo‘qotganda: «Ey bechora Yusuf-a», degan edilar (Yusuf surasi, 84).  
Ulamolar aytishganki: «Baland ovozda quyushqondan chiqib yig‘lash haromdir. Dod-voy solmasdan, qichqirmasdan yig‘lash harom emas».  
Ibn Umar roziyallohu anhumo aytadilar: «Rasululloh sollallohu alayhi vasallam Sa’d ibn Uboda roziyallohu anhuni ko‘rgani bordilar. Abdurahmon ibn Avf, Sa’d ibn Abu Vaqqos va Abdulloh ibn Mas’ud roziyallohu anhumlar ham u zot bilan birga edilar. Rasuli akram ko‘zlariga yosh oldilar. Rasululloh sollallohu alayhi vasallamning yig‘laganlarini ko‘rib, ular ham yig‘lashdi. U zot: «Eshitmayapsizlarmi? Alloh ko‘z yoshi va qalb mahzunligi sababli azoblamaydi. Lekin bu tufayli azoblaydi yoki rahm qiladi», dedilar-da, tillariga ishora qildilar (Buxoriy va Muslim rivoyati).  
Usoma ibn Zayd roziyallohu anhumo aytadilar: «Rasululloh sollallohu alayhi vasallamga qizlarining o‘g‘lini olib kelishdi. Bola o‘lim holatida edi. Rasululloh sollallohu alayhi vasallamning ko‘zlaridan yosh quyildi. Sa’d u zotdan: «Yo Rasululloh, bu nimasi?» deb so‘ragan edi: «Bu Alloh taolo bandalarining qalbiga joylab qo‘ygan rahmatdir. Alloh rahmdil bandalariga rahm qiladi», deya javob berdilar (Buxoriy va Muslim rivoyati)",
'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Musibat paytida haddan oshish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Anas roziyallohu anhu aytadilar: «Rasululloh sollallohu alayhi vasallam farzandi Ibrohimning oldiga kirdilar. U zo‘rg‘a nafas olar edi. Rasululloh sollallohu alayhi vasallamning ko‘zlaridan yosh quyildi. Abdurahmon ibn Avf u zotdan: «Yo Rasululloh, siz ham yig‘laysizmi?» deb so‘ragan edi, «Ey Ibn Avf, u rahmatdir», dedilar va yig‘lagan ko‘yi so‘zlashda davom etdilar: «Ko‘z yosh to‘kadi, qalb g‘amgin bo‘ladi, biz faqat Parvardigorimiz rozi bo‘ladigan so‘zni aytamiz, Ey Ibrohim, biz sendan judo bo‘layotganimizdan mahzunmiz» (Buxoriy rivoyati).  
«Mayyit yaqinlarining yig‘isi sababli azoblanadi», degan sahih hadisning zohiri olinmaydi, balki ta’vil qilinadi. Ulamolar uning ta’vili xususida turli fikrlarni bildirishgan. Ularning orasida asoslirog‘i – mayyitning o‘zi yig‘lashni vasiyat qilgan yoki boshqa bir sababi bo‘lgan bo‘lsagina azoblanadi.  
Mayyitning o‘lishidan oldin ham, keyin ham yig‘lash joiz. Quyidagi sahih hadisga binoan esa oldin yig‘lagan durustroq. «Agar biron kishi vafot etsa, hech kim yig‘lamasin».  
Imom Shofe’iy va ashoblari mazkur hadis karohatni ifodalaydi, deb ta’vil qilishgan va mayyit o‘lganidan keyin yig‘lashni makruh deb bilishgan.  
Fasl Ta’ziya xususida  
Amr ibn Hazm roziyallohu anhudan rivoyat qilinadi: Payg‘ambar sollallohu alayhi vasallam aytdilar: «Qaysi bir mo‘min musibat yetgan birodariga ta’ziya bildirsa, Alloh unga qiyomat kuni ulug‘lik libosini kiygazadi» (Ibn Moja rivoyati).  
Abdulloh ibn Amrdan rivoyat qilinadi: «Rasululloh sollallohu alayhi vasallam Fotima roziyallohu anhodan: «Ey Fotima, uyingdan chiqishga seni nima majbur qildi?» deb so‘ragan edilar, qizlari: «Yo Rasululloh, mana bu mayyitning ahli-yaqinlariga borib, mayyitga (Allohning) rahmatini tiladim va ularga ta’ziya izhor qildim», deya javob berdilar» (Abu Dovud rivoyati).  
Rivoyatlarda kelishicha, musibatzadaga ta’ziya bildirgan kishi musibatzadaning ajri miqdoricha ajrga ega bo‘ladi; eridan tul qolgan xotinga ta’ziya bildirgan kishiga jannat to‘ni kiydiriladi. Ta’ziya sabrga undash va musibatni yengillatadigan, qayg‘uni aritadigan so‘zlar bilan tasalli berishdir. U amri ma’ruf va nahiy munkarni o‘z ichiga olganligi bois mustahab bo‘lib, «Yaxshilik va taqvo yo‘lida hamkorlik qilingiz» (Moida surasi, 2) oyati karimasini amalda tadbiq qilishning bir ko‘rinishidir.  
Dafn marosimidan oldin ham, keyin ham ta’ziya bildirish mustahab hisoblanadi.  
Imom Shofe’iy ashoblari: «Mayyit o‘lgan paytdan dafn qilinganining uchinchi kunigacha ta’ziya bildirish lozim», deyishgan bo‘lsa, bizning ashoblarimiz: «Uch kundan keyin ta’ziya bildirish makruh. Chunki ta’ziya musibatzadaning qalbini tinchlantiruvchi vosita bo‘lib, odatda, uch kundan keyin qalb tinchlangan bo‘ladi. Uning qayg‘usini yangilashning esa keragi yo‘q», deganlar.  
Abu Abbos aytganlarki: «Uch kundan keyin ham ta’ziya bildirilsa bo‘laveradi. Uning vaqti cheklanmagan».",
'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Musibat paytida haddan oshish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Navaviy aytganlar: «Bu boradagi muxtor (tanlangan, mo‘’tabar) gap shuki, uch kundan keyin ta’ziya bildirilmaydi. Mabodo, ta’ziyachi yoki musibatzoda dafn vaqtida yo‘q bo‘lib, uch kun o‘tgandan so‘ng kelsa, unda ta’ziya bildiriladi».  
Dafn qilingandan keyin ta’ziya bildirish ma’qulroq. Chunki mayyitning yaqinlari to dafn qilinguncha, o‘likni jihozlash ishlari bilan ovora bo‘ladilar. Shuningdek, dafn qilingandan so‘ng ularning qayg‘ulari kuchayadi. Agar ular betoqat, besabr bo‘lsalar, ularni tinchlantirish uchun dafndan oldin ham ta’ziya bildirsa bo‘laveradi.  
Mayyitning yaqinlari ta’ziya bildiruvchilarni qabul qilish uchun bir uyda yig‘ilib turishlari makruh. Bu hukm erkagu ayollarga birdek tegishli. Ular o‘z ishlari bilan mashg‘ul bo‘lishlari kerak.  
Ta’ziya duosi esa mashhurdir. 
Usoma ibn Zayd roziyallohu anhumo aytadilar: «Payg‘ambar sollallohu alayhi vasallamning qizlaridan biri u zotga o‘zining go‘dagi o‘lim holatida ekanini bildirib, odam yubordi. Payg‘ambar sollallohu alayhi vasallam xabarchiga: «Borib unga ayt: «Albatta olgan narsasi Alloh taolonikidir. Bergani ham Uning O‘zinikidir. Va har bir narsa Uning huzurida aniq vaqt – o‘lchov bilandir. Unga buyurginki, sabr qilib umid etsin», dedilar» (Buxoriy va Muslim rivoyati).  
Imom Navaviy aytadilar: «Ushbu hadis din asoslari (aqida) va furu’laridan (shar’iy hukmlar) sanalib, har xil musibat, kasallik va g‘am-tashvishga mubtalo bo‘lganda o‘zini tutish va sabr qilishdan iborat juda ko‘plab muhim masalalarni o‘z ichiga olgan ulkan Islom qoidalaridan biridir. «Olgan narsasi Allohnikidir» jumlasining ma’nosi shuki, butun olam Alloh taoloning mulkidir. Binobarin, U zot sizlarga tegishli narsani olgani yo‘q. Aksincha, sizlarga omonat qo‘ygan O‘zining narsasini oldi xolos. «Bergani ham Uning O‘zinikidir», degani, sizlarga bergan narsasi Uning tasarrufidan chiqdi, degani emas. U baribir Allohniki bo‘lib qolaveradi, uning ustida xohlagan ishini qiladi. «Va har bir narsa Uning huzurida aniq vaqt – o‘lchov bilandir». Ya’ni, talvasaga tushmanglar, besabrlik qilmanglar. Zero, ajali yetgan har bir inson o‘ladi. Belgilangan ajal – vaqtni oldinga surib ham, kechiktirib ham bo‘lmaydi. Agar bularning barchasini bilgan bo‘lsangiz, u holda o‘zingizga yetgan musibatga sabr qiling va savobga umid bog‘lang. Vallohu a’lam».  
Ali roziyallohu anhu Ash’as ibn Qaysga: «Agar sen iymon keltirgan va savob umid qilgan holda sabr etsang, sabr etding. Bo‘lmasa sen ham, hayvon yupangandek yupanib qolasan», dedilar.  
Bir donishmand musibatga uchragan kishiga maktub yozdi: «Judo bo‘lgan narsang sendan ketib bo‘ldi. Endi uning o‘rniga berilgan narsa – ajrdan ham mahrum bo‘lib qolmagin».  
Bir zot aytgan ekanki: «Oqil kishi musibatning birinchi kunida johil besh kundan keyin qiladigan ishlarni qiladi».  
Ma’lumki, vaqt o‘tishi bilan musibatga uchragan kishi ko‘nikib, ovunib boradi. Shuning uchun shariatda musibatning ilk zarbasiga yo‘liqqan zahoti sabr qilishga buyurilgan.  
Abdurahmon ibn Mahdiy farzandi o‘lib, qattiq talvasaga tushib qoldi. Bu xabarni eshitgan Imom Shofe’iy rahmatullohi alayh u kishiga quyidagicha maktub yozdilar: «Ey birodar, boshqalarni yupatgan so‘zlaringiz bilan o‘zingizni yupating, o‘zgalarning xattiharakatlaridagi noma’qul deb bilgan jihatlaringizni o‘z ishlaringizda ham bema’ni deb hisoblang. Bilib olingki, eng achchiq musibat – shodlikning yo‘qolishi va ajrdan mahrum bo‘lishdir. Agar bu ikkisiga gunoh ham kelib qo‘shilsa, qanday bo‘lar ekan?! Ey birodar, siz talab qilmasdan turib, ajrning o‘zi yoningizga kelgan ekan, uni quchoq ochib kutib oling. Zero, marhumingizdan ayrilib bo‘ldingiz. Alloh musibatlar chog‘i sizga sabr bersin, sabr tufayli sizga ham, bizga ham ajr bersin».  
So‘ng quyidagi she’rni bitdilar. Ma’nosi: Hayotga unchalik ishonchim yo‘g‘-u, Lek sunnat, deb qildim, ta’ziya izhor. Mayyitdan so‘ng uning yaqinlari-yu Ta’ziya aytgan ham o‘limga duchor.",
'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Musibat paytida haddan oshish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Bir kishi o‘g‘li o‘lgan birodariga ta’ziya bildirib xat yozdi: «...Farzand, modomiki hayot ekan, otasi uchun g‘am-tashvish va fitnadir. Agar otasi qarib qolsa, u duo va rahmatdir. Uning g‘am-tashvishi-yu, fitnasidan ayrilib qolganingizdan ko‘p siqilmang. Alloh taolo uning duosi va rahmatining o‘rniga bergan narsasidan (ya’ni ajrdan) mahrum bo‘lib qolmang».  
Muso ibn Mahdiy o‘g‘li vafot etgan Ibrohim ibn Salamaga ta’ziya bildirib dedi: «Balo va fitnadan qutilganingizga xursand, duo va rahmatdan mahrum bo‘lganingizga esa xafa bo‘ling».  
Bir kuni boshqa kishiga ta’ziya bildirib dedi: «Oxiratda ajr beriladigan kishi dunyoda shodlik va quvonch beriladigan kishidan ko‘ra yaxshiroqdir».  
Rivoyat qilinishicha, Abdulloh ibn Umar roziyallohu anhumo o‘g‘lini dafn qilib, so‘ngra kuldilar. U kishidan: «Qabr tepasida ham kulasizmi?» deb so‘rashgan edi: «Shaytoning burnini yerga ishqalashni xohladim», deya javob berdilar.  
Ibn Jurayj roziyallohu anhu dedilar: «Musibat chog‘ida ajr va savob umidida tasalli topmagan kimsa xuddi hayvonlar tinchlangandek tinchlanadi».  
Hamid A’rojdan naql qilinadi: Said ibn Jubayr roziyallohu anhu o‘g‘liga qarab turib: «Men sendagi yaxshi xususiyatni bilaman», dedilar. O‘sha yerdagilar: «U nima?» deb so‘rashgan edi, «U vafot etib, savobini umid qilishim», deya javob berdilar.  
Bir kishi o‘g‘lidan xafa bo‘lib Hasan Basriyga shikoyat qildi. Hasan roziyallohu anhu u kishidan: «O‘g‘lingiz g‘oyib bo‘lib turadimi?» deb so‘ragan edi, u: «Ha, ko‘pincha g‘oyib bo‘ladi», deya javob berdi. U zot: «O‘g‘lingiz sizdan uzoqda yuraversin. Zero, u g‘oyib bo‘lgan sayin sizning ajringiz ziyodalashaveradi», deya maslahat berdilar. Haligi kishi: «Ey Abu Said, o‘g‘limga nisbatan saqlagan kekimni tarqatib yuborayozdingiz», deb minnatdor bo‘ldi.     Umar ibn Abdulaziz roziyallohu anhu bemor yotgan o‘g‘lining oldiga kirib: «Ey o‘g‘ilginam, o‘zingni qanday his qilyapsan?» deb so‘ragan edi, o‘g‘li: «Haq yo‘lda barqarorman», deya javob berdi. U zot roziyallohu anhu: «Ey o‘g‘ilginam, men uchun mening mezonimda bo‘lishing, sening mezoningda bo‘lishimdan ko‘ra suyukliroq», dedilar. Shunda o‘g‘li: «Ey otajon, men uchun siz yaxshi ko‘rgan narsa bo‘lishi men suygan narsa bo‘lishidan ko‘ra suyumliroq», deb javob berdi.  
Imom Shofe’iy hazratlari o‘g‘li vafot etganda, quyidagi baytni o‘qigan ekanlar: Dunyo shunday ekan, sabr qil, Yo moldan judolik, yo habibingdan.  
Urva ibn Zubayr roziyallohu anhu Muhammad ismli, xushsurat o‘g‘li bilan Valid ibn Abdumalikning huzuriga yo‘l oldi. Valid olachipor kiyimda, qo‘llari bilan kiyim bog‘ichlarini o‘ynayotgan bolaga qarab: «Quraysh yigitlari mana shunday bo‘ladi», deb unga suqlandi va ko‘zi tegdi. O‘g‘lon uning oldidan behol bo‘lib chiqdi. Chorvalar bog‘langan joyda yiqilib, podaning tagida qolib ketdi. Bola o‘ldi.  
Urvaning bir oyog‘i qorason bo‘lib, boldiridan kesib tashlandi. U ancha qarib qolgan edi. Shu kechasi u zorlanib duo qilmadi. Faqatgina: «Bu safarimizdan nasib qilgani shu ekan», deb qo‘ydi xolos va quyidagi misralarni o‘qidi:  
Qasamki, shu yengil kaftlarim meni Shubhali ishlarga tortqilagan yo‘q.  Guvohlik bersinlar oyoqlarim ham, Zino-yu, faxshlarga yetaklagan yo‘q. Qulog‘im-u ko‘zim, fikrim-u aqlim, Ma’siyat va gunoh birla olishgan. Menga va o‘g‘limga yetgan musibat Qancha yigitlarning boshiga tushgan.  
So‘ngra u zot roziyallohu anhu munojot qilib dedilar: «Ey Allohim, meni sinagan ekansan, aslida salomat qilibsan. Olgan ekansan, yana qoldiribsan. Bir a’zoni olib ko‘p a’zolar qoldirding. Bir farzandni olib, ko‘p farzandlar qoldirding».  
Xuddi shu kechasi Validning oldiga Bani Abaslik ko‘r kishi keldi. Undan qanday qilib ko‘r bo‘lib qolgani haqida so‘ragan edi, boshidan o‘tganini so‘zlab berdi:  
«Dunyoda o‘zimdan ko‘ra badavlatroq abaslik kishi yo‘q edi. Bir kechasi darada tunab qoldim. Tunda sel kelib, butun ahlim, bola-chaqam, mol-holimni oqizib ketdi. Faqat bir bolam bilan, bir tuyam qoldi. Tuya qaysarlik qilib qochib ketdi. Uning ortidan quvlay boshladim. Bir oz yurgan edim, bolamning chinqirgani qulog‘imga chalindi. Qaytib kelib ne ko‘z bilan ko‘rayki, bir bo‘ri jigarbandimni g‘ajib tashlabdi. Bo‘rini o‘ldirdim. Keyin tuyani ushlash uchun orqasidan borgan edim, qo‘qqisdan yuzimga tepdi. Ko‘zim ko‘r bo‘lib qoldi. Shunday qilib butun ahli oilam va mol-mulkimdan ayrildim».  
Shunda Valid: «Buni Urvaning oldiga olib boringlar. Toki u yer yuzida o‘zidan ko‘ra qattiqroq musibatga uchragan kishi ham borligini bilib qo‘ysin», deb buyurdi.  
Usmon roziyallohu anhuga hamla qilib, jarohat yetkazganlarida, soqollari qonga bo‘yalgan holda shunday degan edilar: «Sendan o‘zga hech qanday iloh yo‘q. Sen barcha aybu nuqsonlardan poksan. Men zolimlardan bo‘lib qoldim. Ey Allohim, ularga qarshi O‘zingdan madad tilayman, barcha ishlarimda yordamingga muhtojman va bu sinovlaringda O‘zing meni sabrli qilgin».  
Madoiniy aytadilar: «Men sahroda (sahroiy arablar maskanida) bir ayolni uchratib qoldim. Uningdek go‘zal va rangi tiniq ayolni sira ko‘rmagan edim. Undan: «Shodlik sababli shu qadar go‘zalmisan?» deb so‘ragan edim, u: «Yo‘q, Allohga qasamki, bunday emas. Men g‘am va qayg‘uga nishonman. Boshimdan o‘tganini senga so‘zlab beraman. Mening erim va ikki o‘g‘lim bor edi. Otasi qurbonlik kunida bir qo‘yni qurbonlikka so‘ydi. Bolalar nariroqda o‘ynab yurishgan edi. Kattasi kichigidan: «Otam qo‘yni qanday qilib so‘yganini ko‘rsataymi?» deb so‘ragan edi, u: «Ha», dedi. U bilmay ukasini so‘yib qo‘ydi va qonni ko‘rib qo‘rqib toqqa qochib ketdi. U yerda bo‘riga yem bo‘ldi. Otasi uni qidirib ketdi va adashib, tashnalikdan vafot etdi. Shunday qilib men erim va ikki farzandimdan ayrildim», deya javob berdi. Undan: «Qanday qilib sabr qilyapsan?» deb so‘ragan edim, u: «Agar musibat to‘xtamasdan davom etsa ham, men sabr qilaveraman. Jarohatim bitib ketgan», dedi.",
 'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Allohning makr sinovidan hotirjam bolish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Oltinchi gunohi kabira 
ALLOHNING MAKR-SINOVIDAN XOTIRJAM BO‘LISH 
Alloh taolo aytadi:  
«Qachonki o‘zlariga berilgan narsalar bilan shod turganlarida, ularni to‘satdan (azob bilan) ushladik» (An’om surasi, 44).  
Ya’ni, ularga o‘ylamagan taraflaridan azobimiz yetdi.   
Hasan Basriy: «Alloh kimning rizqini keng qilib qo‘ygan bo‘lsa-yu, «Alloh menga makr qilyapti», deb bilmas ekan, u aqlsizdir. Kimga rizqini qatra-qatra qilib tor qilib qo‘ygan bo‘lsa-yu, «Alloh menga qarab turibdi», deb bilmas ekan, u ham aqlsizdir», deb so‘ng quyidagi: «Qachonki, o‘zlariga berilgan narsalar bilan shod turganlarida, ularni to‘satdan ushladik. Bas, butunlay noumid – mublis bo‘ldilar», oyatni o‘qigan edilar.  
Yana aytdilar: «Ka’baning Rabbiga qasamki, qavmga makr qilishi ularga hojatlarini berishi va so‘ng ularni ushlashidir».  
Mublis – falokatga uchragan paytda najot topishdan umidini uzgan kimsa.  
Ibn Abbos roziyallohu anhumo: «Mublis barcha yaxshilikdan umidlarini uzgan kimsa», deganlar.  
«Bilinglarki, shubhasiz, Alloh har bir kishi bilan uning qalbi o‘rtasini egallab turur va shubhasiz, sizlar Uning huzuriga to‘planursizlar» (Anfol surasi, 24).",
 'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Allohning makr sinovidan hotirjam bolish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Mujohid aytganlarki: «Buning ma’nosi, Alloh banda bilan uning aqli orasini egallab – to‘sib turadi. Hattoki, banda barmoqlari nima qilayotganini ham bilmay qoladi».  
Tabaroniy: «Bu oyat Alloh taoloning bandalar qalbiga ularning o‘zlaridan ko‘ra molikroq ekanini, U agar xohlasa, banda bilan uning qalbi orasini egallab – to‘sib olishini va inson Allohning xohishi bilangina biron narsani idrok etishini xabar qiladi», deydilar.  
Sahih hadisda keladi: «Albatta, sizlardan bir kishi jannat ahli amallarini qiladi. Hattoki, u bilan jannat orasida bir ziro’ masofa qoladi. Shunda unga kitob (taqdir) yetib keladi-da, do‘zax ahli amalini qiladi va do‘zaxga kiradi» (Muttafaqun alayh).  
«Jannat ahlining amalini qiladi», degani, insonlarga shunday ko‘rinadi. Aslida esa u amalning yashirin bir illati bo‘ladi. Agar u rostdan ham solih, maqbul amal bo‘lganida edi, Alloh uni yaxshi ko‘rgan va rozi bo‘lgan, uning amalini botil qilmagan bo‘lardi. Shuning uchun, oxiri nima bilan tugashini bilmasdan turib, amalning zohiri bilan g‘ururlanmaslik kerak. Chunki amallar xotimasi bilan e’tiborlidir.  
Abdulloh ibn Umar roziyallohu anhumo rivoyat qiladilar: «Rasululloh sollallohu alayhi vasallam ko‘pincha: «Yo‘q, qalblarni o‘zgartiruvchi zotga qasamki», deb ont ichardilar» (Buxoriy rivoyati).  
Sahl ibn Sa’d Saidiy roziyallohu anhudan rivoyat qilinadi: «Payg‘ambar sollallohu alayhi vasallam aytdilar: «Bir kishi do‘zax ahli amalini qiladi, holbuki, u jannat ahlidandir. Yana bir kishi jannat ahli amalini qiladi, holbuki, u do‘zax ahlidandir. Darhaqiqat, amallar xotimasi bilan e’tiborlidir» (Buxoriy rivoyati).  
Ulamolar aytishganki, yomon xotima botinda gunoh qilishga odatlangan va kezi kelganda gunohi kabira qilishdan ham tap tortmaydigan kimsalarda uchraydi. Ammo kimki zohirda haq yo‘l uzra sobit qadam bo‘lsa va botinda ham gunoh qilishga odatlanmagan bo‘lsa, uning xotimasi yomon bo‘lishini hech qachon eshitmaganmiz, bilmaymiz ham. Buning uchun Allohga hamd bo‘lsin. Endi kimki gunoh ishlarini yaxshi ko‘rsa va gunoh qilib tavba qilmasdan yuraversa, u tavba qilib ulgurmasidan, ajali yetib qolishi mumkin. Mana shunday vaqtda shayton uni vasvasaga soladi va uni dahshat qamrab oladi-da, odamlarga uning badbaxt ekani ma’lum bo‘ladi. Bundan Allohning O‘zi saqlasin. Ayrim kishilar esa butun umri mobaynida haq yo‘lda mustaqim bo‘ladilar-da, ajallari yaqinlashgach, o‘zgarib, haq yo‘ldan og‘ib ketadilar. Bu ham xotimasi yomon, oqibati xunuk bo‘lishiga olib keladi.  
Anas roziyallohu anhudan rivoyat qilinadi: «Rasululloh sollallohu alayhi vasallam: «Ey qablarni o‘zgartiruvchi Zot, qalbimni diningda sobit-mustahkam qilgin», deb ko‘p aytardilar. Men: «Ey Rasululloh, sizga va siz keltirgan narsalarga iymon keltirdik. Shunda ham bizdan xavotirlanasizmi?» deb so‘radim. «Ha, chunki qalb Alloh taoloning ikki barmog‘i orasida bo‘lib, uni xohlaganicha o‘zgartiradi», dedilar» (Termiziy rivoyati).  
Asarda kelganki, Iblisga makr qilingach, Jabroil va Mikoil yig‘lay boshlashdi. Shunda Alloh taolo ulardan: «Nima uchun yig‘layapsizlar?» deb so‘radi. Ular: «Parvardigoro, makr-sinovingizdan xotirjam bo‘lolmayapmiz», deyishgan edi, Alloh taolo: «Xuddi shunday bo‘lsin, makrimdan xotirjam bo‘lmanglar», dedi.  
Ulamolar shunday deydilar: «Agar Alloh taolo gunoh qilishga mukkasidan ketgan bandasiga o‘zi sevgan narsalarini berayotganini ko‘rsang, bilginki, bu U Zot tarafidan bir makr-sinovdir».  
Hikoya: Rivoyat qilinadiki, Misrda namoz o‘qish va azon aytish uchun masjidga bog‘lanib qolgan bir kishi bor edi. U ibodatga berilgan, taqvodor edi. Kunlardan bir kuni odatdagidek azon aytish uchun minoraga chiqdi. Minoraning yonginasida zimmiy nasroniyning hovlisi bor edi. U hovliga ko‘z tashladi va nasroniyning qizini ko‘rib qoldi. U chiroyli qiz edi. Kishi o‘zini yo‘qotib qo‘ydi va azonni tashlab, qizning oldiga tushdi. Qiz undan so‘radi: «Nima yumushing bor?» «Seni xohlayman va senga uylanaman». «Sen musulmonsan, otam meni senga bermaydi». «Nasroniy bo‘laman». «Unday bo‘lsa, mayli...»  
U qizga uylanish uchun nasoro diniga kirdi va ularning hovlisida qoldi. Xuddi shu kunning o‘zida hovlidagi bir tepalikka chiqdi-da, yerga yiqilib o‘ldi. U dini bilan muvaffaqiyat qozonmadi, qiz bilan rohatlanmadi ham.  
Allohdan makr-sinovi, xunuk oqibat va yomon xotimadan panoh berishini so‘raymiz",
 'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Allohning rahmatidan noumid bolish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Yettinchi gunohi kabira 
ALLOHNING RAHMATIDAN NOUMID BO‘LISH 
Alloh taolo shunday marhamat qiladi:  
«... Zero, Allohning rahmatidan faqat kofir qavmgina noumid bo‘lur» (Yusuf 
surasi, 87). Ya’ni, Allohning qudratini inkor qiladigan, kofir kimsalargina Alloh taoloning rahmatidan noumid bo‘ladilar.  
«Albatta, Alloh O‘ziga (biron narsaning) sherik qilinishini kechirmas. Shundan boshqa gunohlarni O‘zi xohlagan bandalari uchun kechirur» (Niso surasi, 48).  
«(Ey Muhammad alayhissalom), (turli gunoh-ma’siyatlar qilish bilan) o‘z jonlariga jinoyat qilgan bandalarimga ayting: «Allohning rahmatmarhamatidan noumid bo‘lmangiz! Albatta, Alloh (O‘zi xohlagan bandalarining) barcha gunohlarini mag‘firat qilur. Albatta, Uning O‘zigina mag‘firatli, mehribondir» (Zumar surasi, 53).  
«...Rahmatim – mehribonligim esa hamma narsadan kengdir» (A’rof surasi, 156).  
Abu Hurayra roziyallohu anhudan rivoyat qilinadi: «Payg‘ambar sollallohu alayhi vasallam aytdilar: «Allohning yuzta rahmati bo‘lib, undan bitta rahmatni jinlar, insonlar, hayvonlar va hashoratlar orasiga tushirdi. Ana o‘sha bitta rahmat bilan ular bir-biriga rahm qiladilar, shafqatli bo‘ladilar. Va shu rahmat bilan vahshiy hayvon o‘z bolasiga mehribon bo‘ladi. Alloh to‘qson to‘qqizta rahmatni olib qoldiki, ular bilan qiyomat kunida bandalariga rahm qiladi» (Muttafaqun alayh).",
 'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Allohning rahmatidan noumid bolish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Anas roziyallohu anhu rivoyat qiladilar: «Rasululloh sollallohu alayhi vasallamning shunday deganlarini eshitganman: «Alloh taolo aytdi: «Ey Odam farzandi, rahmatimdan umidvor bo‘lar ekansan, sen tarafingdan sodir bo‘lgan narsalarni kechiraman va hech parvo qilmayman. Ey Odam farzandi, agar gunohlaring osmonga yetsa-da, so‘ng mendan mag‘firat so‘rasang, seni mag‘firat qilaman va hech parvo qilmayman. Ey Odam farzandi, agar sen Menga yer qobig‘icha xato bilan kelsang, so‘ng Menga biron narsani sherik qilmagan holingda yo‘liqsang, senga yer qobig‘icha mag‘firat bilan peshvoz chiqaman» (Termiziy, Ibn Moja rivoyati).  
Anas roziyallohu anhu rivoyat qiladilar: «Payg‘ambar sollallohu alayhi vasallam o‘limi yaqinlashib qolgan bir yigitning oldiga kirib, «O‘zingni qanday his qilyapsan?» deb so‘radilar. U: «Yo Rasululloh, Allohdan umid qilyapman va gunohlarimdan qo‘rqyapman», dedi. Shunda Rasululloh sollallohu alayhi vasallam: «Mana shunday holatda banda qalbida bu ikkisi jam bo‘lsa, Alloh unga umid qilayotgan narsasini berib, qo‘rqayotgan narsasidan omon saqlaydi», dedilar» (Termiziy, Ibn Moja rivoyati).  
Abu Hurayra roziyallohu anhudan rivoyat qilinadi: «Rasululloh sollallohu alayhi vasallam aytdilar: «Alloh azza va jalla: «Men bandamning Men haqimdagi o‘yidaman va Meni zikr qilgan vaqtda Men u bilan birgaman», dedi» (Buxoriy, Muslim rivoyati).  
Payg‘ambar sollallohu alayhi vasallam aytdilar: «Yaxshi gumon ibodatning go‘zalligidandir» (Abu Dovud, Ibn Hibbon rivoyati).  
Jobir roziyallohu anhu Payg‘ambar sollallohu alayhi vasallamning o‘limlaridan uch kun oldin: «Sizlarning har biringiz Alloh azza va jalla haqida yaxshi gumon qilgan holingizdagina vafot etingiz», deganlarini eshitganini aytganlar (Muslim, Abu Dovud, Ibn Moja rivoyati).  
Rivoyat qilishlaricha, Arsh tarafdan bir jarchi «falonchi o‘g‘li falonchi qaerda?» deb nido qiladi. Bu ovozni eshitgan har bir kishining hushi boshidan uchadi. Alloh azza va jalla o‘sha kishiga: «So‘ralayotgan sensan. Osmonlaru yerning Yaratuvchisiga ro‘baro‘ bo‘lishga shoshil», deydi. Butun maxluqotlar Arsh tomonga tikilib qoladi. Haligi kishi Alloh azza va jallaning huzurida hozir qilinadi. Alloh azza va jalla unga maxluqotlardan to‘sib turadigan nurini tushiradi-da, so‘ng unga: «Bandam, dunyo hayotidagi har bir amalingni ko‘rib, kuzatib turganimni bilmasmiding?» deb so‘raydi. Banda: «Bilardim, ey Rabbim», deydi. «Bandam, Menga osiylik qilgan kimsalarga azobim va intiqomim borligini eshitmaganmiding?». «Eshitgandim, ey Rabbim». «Ey bandam, Menga osiylik qilding?» «Ey Rabbim, shunday bo‘lgan edi». «Bandam, bugun Meni nima qiladi deb o‘ylayapsan?». «Ey Rabbim meni afv etasan, deb o‘ylayapman». «Bandam, nimaga asoslanib meni afv etadi, deb o‘ylayapsan?» «Ey Rabbim, chunki Sen mening gunoh qilayotganimni ko‘rib, uni yashirgan eding». «Seni afv etdim, kechirdim. O‘ylagan narsangni ro‘yobga chiqardim. Kitobingni o‘ng tarafingdan olgin. Unda nimaiki yaxshilik bo‘lsa, uni qabul qildim va nimaiki yomonlik bo‘lsa, uni kechirdim. Men saxiy, karim zotdirman», deydi Alloh taolo.  
Parvardigoro, mag‘firat qilishni yaxshi ko‘rmaganingda edi, osiy kimsalarga muhlat bermasding. Afv va karaming bo‘lmaganda edi, dillar osoyish topmasdi.  
Ey Allohim, albatta, Sen afv qilguvchisan, bizni afv qil. Ey Allohim, bizga rizo nazari bilan boq va bizni pokiza bandalaring qatorida qil, jafokashlar orasida qilma. Ey Allohim, bizning orzu-umidlarimizni ro‘yobga chiqar, barcha holatlarda ham amallarimizni o‘ngla. Roziligingga eltuvchi yo‘llarni qulay et, bizni yaxshiliklarga yo‘lla, bizga dunyoda ham, oxiratda ham yaxshilik ato et va bizni do‘zax azobidan saqla.",
 'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Dunyo uchun ilm organish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Sakkizinchi gunohi kabira 
DUNYO UCHUN ILM O‘RGANISH VA ILMNI YASHIRISH 
Alloh taolo shunday deydi:  
«... Albatta, Allohdan bandalari orasidagi olim-bilimdonlar qo‘rqur» (Fotir surasi, 28).  
Ushbu oyat borasida aytilgan tafsirlar quyidagicha: Ibn Abbos roziyallohu anhumo: «Alloh taolo bu bilan: «Qudratim, izzatim va saltanatimni bilgan bandalarimgina Mendan qo‘rqadi», deydi», deganlar. Mujohid va Sha’biy aytadilar: «Alloh taolodan qo‘rqqan kishigina olimdir». Robe’ ibn Anas aytganlar: «Kimki Allohdan qo‘rqmas ekan, u olim emas».  
«Biz nozil qilgan hujjatlar va hidoyatdan (Muhammad alayhissalomning haq Payg‘ambar ekanligi haqidagi) narsalarni odamlarga Kitobda (Tavrotda) ravshan qilib berganimizdan keyin yashiradigan kimsalarni, shubhasiz, Alloh la’natlagay va la’natlovchi zotlar (farishtalar va mo‘minlar) la’natlagaylar» (Baqara surasi, 159). Bu oyat yahudiy ulamolari xususida nozil bo‘lgan. 
Ibn Abbos roziyallohu anhumoning aytishicha, insonlar va jinlardan boshqa barcha narsalar la’natlaydi. Ibn Mas’ud roziyallohu anhu aytganlarki, ikki musulmon bir-biriga la’nat aytadigan bo‘lsa, bu la’nat Muhammad sollallohu alayhi vasallamning haq payg‘ambar ekanliklarini va u zotning sifatlarini yashirgan yahudiy va nasroniylarga qaytadi.  
«Eslang, (ey Muhammad), Alloh Kitob berilgan kimsalardan «Albatta, u (Kitobni) odamlarga ochiq bayon qilursizlar va yashirmaysizlar!» deb ahdpaymon olgan edi. So‘ng ular bu ahd-paymonni ortlariga tashladilar va uni ozgina qiymatga sotdilar. Ularning bu oldi-sotdilari naqadar yomon ish bo‘ldi» (Oli Imron surasi, 187).  
Vohidiy aytishlaricha, bu oyat Madina yahudiylari haqida nozil bo‘lgan. Alloh Tavrotda ulardan Muhammad sollallohu alayhi vasallamning haq payg‘ambar ekanligi, sifatlari va yuborilish zamoni-yu, makonini bayon qilishga, uni yashirmaslikka ahd-paymon olib: «Uni odamlarga ochiq bayon qilursizlar va yashirmaysizlar», deb aytgan.  
Bu Alloh taoloning yahudiy ulamolaridan Kitoblaridagi narsalarni odamlarga bayon qilib berishlari xususida olgan ahdu paymonidir. Ularning Kitobida esa Rasululloh sollallohu alayhi vasallamning ham zikrlari kelgan, degan edi Hasan Basriy.",
 'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Dunyo uchun ilm organish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Uni ozgina qiymatga sotdilar», degani, ular ilmli bo‘lganlari uchun ilmsiz johil kimsalardan narsalar olardilar. Shu arzimas dunyoviy narsadan mahrum bo‘lib qolishdan qo‘rqib ahdlarini buzdilar.  
«Ularning bu oldi-sotdilari naqadar yomon ish bo‘ldi» oyati karimasi haqida Ibn Abbos roziyallohu anhumo: «Ularning savdolari jirkanchli bo‘lib, ziyon ko‘rishdi», degan edilar.  
Rasululloh sollallohu alayhi vasallam aytdilar: «Kimki Allohning Yuzi qasd qilinadigan ilmni faqat biron dunyoviy narsaga yetishish uchun o‘rganadigan bo‘lsa, qiyomat kunida jannatning hidini ham topmaydi» (Abu Dovud rivoyati).  
Do‘zaxga yuzi bilan sudraladigan uch kishi haqidagi hadis «Riyo» bo‘limida keltirilgan edi. Ulardan biriga: «Olim, deb aytishlari uchun ilm o‘rganding, bu narsa aytildi», deyiladi.  
Payg‘ambar sollallohu alayhi vasallam aytganlarki: «Kimdan bilgan narsasi haqida so‘ralsa-yu, uni yashirsa, qiyomat kuni Alloh u kimsani olovdan bo‘lgan yugan bilan yuganlab qo‘yadi» (Ibn Hibbon, Hokim rivoyati).  
Rasululloh sollallohu alayhi vasallam: «Sendan foydasiz ilmdan panoh berishingni so‘rayman», deb duo qilardilar (Muslim rivoyati).  
Usoma ibn Zayd roziyallohu anhumodan rivoyat qilinadi, u kishi Rasululloh sollallohu alayhi vasallamning shunday deganlarini eshitdi: «Qiyomat kunida bir kishi olib kelinib, do‘zaxga uloqtiriladi. Uning ichak-chovoqlari osilib, yoyilib ketadi-da, xuddi eshak tegirmon atrofida aylanganidek, ularga o‘ralashib qoladi. Do‘zax ahli uning atrofiga to‘planishadi va: «Ey falonchi, senga nima bo‘ldi? Axir sen yaxshilikka buyurib yomonlikdan qaytarmasmiding?» deb so‘rashadi. U: «Sizlarni yaxshilikka buyurardim-u, o‘zim qilmasdim. Yomonlikdan qaytarardim-u, o‘zim qaytmasdim», deydi» (Buxoriy, Muslim rivoyati).  
Ibn Mas’ud roziyallohu anhu aytadilar: «Kim ilm o‘rganib unga amal qilmasa, ilm faqat uning kibrini ziyoda qiladi».  
Hilol ibn A’lo aytganlar: «Ilm talab qilish qiyin, uni yodlash talab qilishdan qiyin, unga amal qilish yodlashdan qiyin, unda salomat qolish amal qilishdan ham qiyinroqdir».  
Alloh taolodan barcha balolardan salomat saqlashini va O‘zi yaxshi ko‘rgan, rozi bo‘lgan narsalarga muvaffaq qilishini so‘raymiz. Albatta, U saxiy va karim zotdir.",
 'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Taqdirni rad etish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"O‘ninchi gunohi kabira 
TAQDIRNI RAD ETISH 
Alloh taolo dedi:  
«Albatta, Biz har bir narsani (aniq) o‘lchov bilan yaratdik» (Qamar surasi, 49).  
Ibn Javziy tafsirlarida bu oyatning nozil bo‘lish sababi xususida ikki xil gap borligini aytganlar: Birinchisi, Makka mushriklari Rasululloh sollallohu alayhi vasallam bilan taqdir haqida tortishganlar. Shunda mazkur oyat nozil bo‘lgan (Muslim rivoyati). Abu Umoma roziyallohu anhu: «Bu oyat qadariyalar xususida», deganlar. Ikkinchisi, Najron yepiskopi Rasululloh sollallohu alayhi vasallam huzurlariga kelib: «Ey Muhammad, gunohlar ham taqdir-qadar bilan sodir etiladi, deb da’vo qilasan. Bunday emas-ku», dedi. Shunda ushbu oyatlar nozil bo‘ldi: «Albatta, jinoyatchi-osiy kimsalar gumrohlik va ahmoqlikdadirlar. Ular yuztuban hollarida do‘zaxga sudraladigan Kunda (ularga): «Do‘zax azobini totib ko‘ringlar!» (deyilur). Albatta, Biz har bir narsani aniq o‘lchov-qadar bilan yaratdik» (Qamar surasi, 47–49).  
«Holbuki, sizlarni ham, yasab olgan butlaringizni ham Alloh yaratgan-ku!» (Vas-soffot surasi, 96).  
Ibn Jarir aytganlarki, bu oyatni ikki xil tushunish mumkin. Alloh sizlarni va amallaringizni yaratgan yoki Alloh sizlarni va yasab olgan butlaringizni yaratgan.  
Bu oyat bandalarning ishlari maxluq ekaniga hujjatdir. Allohu a’lam.  
«Jonga va uni raso qilib-yaratib, unga fisq-fujurini ham, taqvosini ham ilhom qilib-o‘rgatib qo‘ygan Zotga qasamki...» (Vash-shams surasi, 8). Said ibn Jubayr aytganlar:  «Alloh nafsga fujurini ham, taqvosini ham yuklab qo‘ydi».  
Abdulloh ibn Umar roziyallohu anhumo: «Qadar-taqdir yo‘q, ishlar endi sodir bo‘ladi – ular taqdir qilinmagan», deb da’vo qiladigan qavm haqida: «Agar ularga yo‘liqsang, men ulardan begonaligimni, ular mendan begona ekanliklarini ularga aytib qo‘y. Mabodo ulardan birining Uhudchalik tillasi bo‘lsa-yu, uni infoq qilsa, to qadarga iymon keltirmagunicha Alloh uni qabul qilmaydi», dedilar-da, so‘ng Jabroil alayhissalom hadisini zikr qildilar. Jabroil Payg‘ambar sollallohu alayhi vasallamdan: «Iymon nima?» deb so‘raganida, u zot sollallohu alayhi vasallam: «Allohga, farishtalariga, kitoblariga, payg‘ambarlariga va oxirat kuniga, yaxshilik va yomonlik qadardan ekaniga ishonmog‘ing!» deya javob berganlar (Muslim rivoyati).  
Allohga iymon keltirish – Alloh taolo mavjud, ulug‘ va mukammal sifatlar bilan sifatlangan nuqsonlardan pok, yolg‘iz, behojat, barcha maxluqotlarni yaratgan, ular ustida xohlaganidek tasarruf etadigan va O‘z mulki-saltanatida istagan narsasini qiladigan zot, deb tasdiqlashdir. 
 Farishtalarga iymon keltirish ularni Allohning bandalari deb tasdiqlashdir.  
«...Yo‘q (farishtalar aslo Allohning bolalari emas, balki) ulug‘ bandalardir. (Farishtalar) U zotdan ilgari biron so‘z aytmaydilar (ya’ni, Alloh buyurmagan biron ishni qilmaydilar). Ular (Allohning) amr-farmoni bilangina amal qilurlar. U zot ularning oldilaridagi (qiladigan) va orqalaridagi (qilib o‘tgan) barcha ishamallarini bilur. Ular (Qiyomat qoyim bo‘lgan Kunda) faqat (Alloh) rozi bo‘lgan kishilarnigina shafoat qilurlar – qo‘llay olurlar. Ularning o‘zlari (Allohdan) qo‘rqib xafvu xatarda tururlar» (Anbiyo surasi, 26–28).  
Kitoblarga iymon keltirish – Alloh taolo O‘zining tanlab olgan elchilariga vahiy qilgan kalomini tasdiqlashdir. Bu kalomlar jamlanib, devon qilinib, pokiza sahifalar va qiymatli kitoblarga aylangan. Mo‘min ulardan bilganiga batafsil, bilmaganiga umumiy suratda iymon keltiradi.  
Payg‘ambarlarga iymon keltirish – ularning Alloh taolo nomidan bergan xabarlariga ishonishdir. Alloh ularni rostgo‘yliklariga dalolat qiladigan mo‘’jizalar bilan qo‘llab quvvatlagan, ular Allohning risolatini yetkazganlar, mukallaf bandalarga Allohning buyruqlarini bayon qilib berganlar. Ularni ehtirom qilish va ulardan birontasini ajratib qo‘ymaslik vojib bo‘ladi.",
 'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Taqdirni rad etish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Oxirat kuniga iymon keltirish – Qiyomat kunini va u kunda ro‘y beradigan qayta tirilish, mahshargohga to‘planish, hisob-kitob, mezon, pulsirot, jannat va do‘zax, bu ikkisi muhsinlarga savob, nobakorlarga jazo diyori ekanini va bulardan boshqa sahih naqlda kelgan narsalarni tasdiqlashdir.  
Taqdirga iymon keltirish quyidagi oyati karimalar ifodalaydigan ma’nolalarni tasdiqlashdir:  
«... Holbuki, sizlarni ham, yasab olgan butlaringizni ham Alloh yaratgan-ku!» (Vas-soffat surasi, 96).  
«Albatta, Biz har bir narsani (aniq) o‘lchov bilan yaratgandik» (Qamar surasi,  49).  
«Na yerga va na o‘zlaringizga biron musibat yetmas, magar (etsa), Biz uni paydo qilishimizdan ilgari Kitobda (Lavhul-Mahfuzda bitilgan) bo‘lur. Albatta, bu Allohga osondir» (Hadid surasi, 22).  
Ibn Abbos roziyallohu anhu rivoyat qiladilar: «Rasululloh sollallohu alayhi vasallam shunday deganlar: «Bilginki, agar senga biron narsada foyda berish uchun butun ummat to‘plansa ham, faqat Alloh taolo sen uchun yozib qo‘ygan narsa bilangina foyda beradi. Agar senga biron zarar yetkazish uchun to‘plansa ham, faqat Alloh taolo yozib qo‘ygan narsa bilangina zarar yetkazadi. Qalamlar ko‘tarilgan, sahifalar qurigan» (Termiziy rivoyati).  
Salaflar va xalaf imomlarining mazhabi-fikri shuki, kimda-kim bu ishlarni hech shubhalanmasdan va ikkilanmasdan qat’iy tasdiqlasa, mo‘min bo‘ladi. Bu tasdiq yorqin hujjatlar orqali bo‘ladimi yoki qat’iy e’tiqodlar yordamidami, farqi yo‘q. Vallohu a’lam.  
Abdulloh ibn Amr roziyallohu anhu rivoyat qiladilar: «Payg‘ambar sollallohu alayhi vasallam aytdilar: «Alloh maxluqotlar taqdirini osmonlaru yerni yaratishidan ellik ming yil oldin yozib qo‘ygan» (Muslim rivoyati).  
Jobir roziyallohu anhudan rivoyat qilinishicha, bir kishi: «Yo Rasululloh, bugungi amallar nimaga bog‘liq? Qalamlar qurib, taqdirda belgilangan narsagami yoki biz endi qiladigan, endi sodir bo‘ladigan narsagami?» deb so‘radi. «Qalamlar qurib, taqdirda belgilangan narsaga bog‘liq», dedilar Rasululloh sollallohu alayhi vasallam. «Unda amal qilishning nima keragi bor?» deb so‘ragan edi, «Amal qilinglar, har bir kishi muyassar bo‘lguvchidir», dedilar Nabiy. (Muslim rivoyati).  
Payg‘ambar sollallohu alayhi vasallam aytdilar: «Har bir narsa qadar-taqdir bilandir. Hattoki ojizlik va ziyraklik ham» (Ahmad va Muslim rivoyati).  
Anas roziyallohu anhudan rivoyat qilinadi, Rasululloh sollallohu alayhi vasallam aytdilar: «Qadariyalar va murjialar bu ummatning majusiylaridir. Agar ular kasal bo‘lsalar, ziyorat qilmanglar va agar o‘lsalar, (janozalarida) qatnashmanglar» (Taboroniy rivoyati).  
Rivoyat qilishadiki, Alloh qiyomat kunida avvalgilaru oxirgilarni to‘plagan vaqtda bir jarchiga buyuradi, u: «Allohning xusumatchilari qani?» deb nido qiladi. Bu nidoni avvalgilaru oxirgilar eshitadi. Shunda qadariyalar o‘rinlaridan turadilar va ularga do‘zaxga kirish buyuriladi. Alloh taolo aytadi: «Do‘zax azobini totib ko‘ringlar. Albatta, Biz har bir narsani aniq o‘lchov – qadar bilan yaratdik».  
Alloh bandaga ma’siyat-gunoh ishni taqdir qilib, so‘ng u sababli azoblashi joiz emas, deb tortishganlari uchun ularga: «Allohning xusumatchilari», deyiladi",
   'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Taqdirni rad etish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Rivoyat qilinadiki, Alloh qaysi payg‘ambarni yuborgan bo‘lsa, uning ummatida qadariyalar va murjialar bo‘lgan. «Alloh yetmishta payg‘ambar tilida qadariya va murjialarni la’natladi».  
Xabarda keltirilishicha, «Qadariyalar bu ummatning majusiylaridir».  
Yana aytiladiki: «Har bir ummatning majusiylari bo‘ladi. Bu millatning majusiylari esa taqdir-qadar yo‘q, ishlar endi sodir bo‘ladi, deb da’vo qiladigan kimsalardir».  
Hasan Basriy hazratlari aytganlar: «Allohga qasamki, agar bir qadariy arqonday bo‘lib qolguncha ro‘za tutsa, so‘ng simday bo‘lib qolguncha namoz o‘qisa ham, Alloh uni do‘zaxga yuztuban uloqtiradi. Keyin unga: «Do‘zax azobini totib ko‘r. Albatta, Biz har bir narsani aniq o‘lchov – qadar bilan yaratdik», deyiladi».  
Fasl  
Tobe’inlar, musulmon imomlari, salaflar va fuqaholardan yetmish kishi quyidagi ishlar Rasululloh sollallohu alayhi vasallamdan qolgan sunnat ekanligiga ijmo’ qilganlar: «Allohning qazo va qadariga rozi bo‘lish, buyrug‘iga taslim bo‘lish, hukmi ostida sabr qilish, buyurgan narsalarini bajarish, qaytargan narsalaridan tiyilish, Alloh uchun xolis amal qilish, yaxshi-yu yomon taqdirga iymon keltirish, din xususidagi tortishuvmunozara va xusumatni tark etish, mahsiga mash tortish, vafot etgan ahli qiblaga janoza o‘qish.  
Iymon – so‘z, amal va niyatdir, toat bilan ziyodalashadi, osiylik bilan kamayadi. (Izoh: Bu fikr Shofe’iy mazhabinikidir. Hanafiy mazhabi ulamolari fikriga ko‘ra esa, iymon – til bilan iqror bo‘lish, qalb bilan tasdiqlashdir. Shuningdek, iymon ziyoda yoki kam bo‘lmaydi, balki uning nuri ko‘payib ozayadi. – Muharrir.)     Qur’on Allohning kalomidir. Uni Jabroil Allohning payg‘ambari Muhammad sollallohu alayhi vasallamga olib tushgan. U maxluq emas.  
Sulton tarafidan adolat yoki zulm sodir bo‘lsa-da, uning bayrog‘i ostida sabr qilinadi. Amirlar jabr-zulm qilsalar ham, ularga qarshi qilich ko‘tarmaymiz.  
Ahli qibladan birontasini, garchi gunohi kabira qilsa ham, kofir hisoblamaymiz. Faqat o‘sha gunohni halol deb bilsa, kofir deymiz.  
Ahli qibladan birontasiga qilgan yaxshi amali sababli jannatiy deb guvohlik bermaymiz. Payg‘ambar sollallohu alayhi vasallam jannatiy deb guvoh bergan zotlar bundan mustasno.  
Rasululloh sollallohu alayhi vasallam sahobalari orasida bo‘lib o‘tgan narsalar xususida tilimizni tiyamiz, bahslashmaymiz.  
Rasululloh sollallohu alayhi vasallamdan keyin maxluqotlarning eng afzali Abu Bakr, so‘ng Umar, so‘ng Usmon, so‘ng Ali ibn Abu Tolibdir (Alloh barchasidan rozi bo‘lsin).  
Payg‘ambar sollallohu alayhi vasallamning barcha azvoji mutohharolari (ayollari), avlodlari va ashoblariga Allohning rahmatini so‘raymiz.",
 'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Hiyonat va ahdga vafo qilmaslik"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"O‘n birinchi gunohi kabira 
XIYONAT VA AHDGA VAFO QILMASLIK 
Alloh taolo aytadi:  
«Ahdga vafo qilinglar! Zero, ahd-paymon (Qiyomat kuni) mas’ul bo‘linadigan ishdir» (Al-Isro surasi, 34).  
Zajjoj aytadilar: «Alloh buyurgan va qaytargan barcha narsalar ahddandir».  
«Ey mo‘minlar, bitimlarga (Alloh taolo bilan o‘rtalaringizdagi bitimlarga – U zotga bandalik qilish haqida bergan ahd-paymonlaringizga ham, o‘zaro birbiringiz bilan kelishib olgan bitimlaringizga ham) vafo qilingiz!» (Moida surasi, 1).  
Ibn Abbos roziyallohu anhumo aytganlarki: «Ahdlar Qur’onda halol-harom, farz qilingan va had belgilangan narsalardir». 
Zahhok aytadilar: «Alloh taolo bu ummatdan halol-harom qilingan, namoz kabi farz etilgan narsalarga va boshqa ahdlarga vafo qilishga ahd-paymon olgan. Ahdlar ham xuddi shu kabi bo‘lib, Alloh farz qilgan muhkam narsalardandir. Biron bir holatda ham uni buzishga yo‘l yo‘q».  
Muqotil ibn Hayyon aytadilar: «Alloh Qur’onda buyurgan Uning O‘zigagina itoat etishingiz va qaytargan narsalardan qaytishingiz xususida sizlarning zimmangizga yuklagan ahdlarga, mushriklar bilan sizlarning orangizdagi ahdlar – bitimlarga va insonlar o‘rtasidagi ahdu paymonlarga vafo qilinglar». Vallohu a’lam.  
Payg‘ambar sollallohu alayhi vasallam aytdilar: «Kimda to‘rt xislat bo‘lsa, haqiqiy munofiq bo‘ladi. Kimda ulardan bittasi bo‘lsa, to uni tashlamaguniga qadar unda munofiqlikning bitta xislati bo‘ladi. Ular gapirsa, yolg‘on gapiradi, ahdlashsa, ahdida turmaydi va agar bahslashsa, fojirlik qiladi (haddidan oshadi)» (Buxoriy, Muslim rivoyati).  
Rasululloh sollallohu alayhi vasallam aytdilar: «Qiyomat kunida har bir (ahdini buzgan) xiyonatchini tanitib turadigan bayrog‘i bo‘ladi. Bu falonchining xiyonati, deyiladi» (Muslim rivoyati).  
Rasululloh sollallohu alayhi vasallam aytdilar: «Alloh taolo: «Men qiyomat kuni uch kishining – mening nomimni o‘rtaga qo‘yib (biron narsa) olib, so‘ng xiyonat qilgan kishining, hur-ozod odamni sotib, so‘ngra pulini yegan kishining va mardikorni ijaraga olib, ishlatib, haqini to‘liq bermagan kishining dushmanidirman», dedi» (Buxoriy rivoyati).  
Rasululloh sollallohu alayhi vasallam aytdilar: «Kim itoatdan bo‘yin tovlasa, qiyomat kuni Allohga yo‘liqqanida uning hech bir hujjati bo‘lmaydi. Kimki bo‘ynida bay’at bo‘lmagan holda o‘lsa, johiliyat o‘limida o‘libdi» (Muslim rivoyati).  
Payg‘ambar alayhisalom aytdilar: «Kim do‘zaxdan yiroq bo‘lib, jannatga kirishni yoqtirsa, Allohga va oxirat kuniga iymon keltirgan holda o‘ziga berilishini yaxshi ko‘rgan narsani odamlarga bersin. Kim bir imomga bay’at qilib, unga qo‘lining bitimini va qalbining mevasini bersa, agar qodir bo‘lsa, unga itoat etsin. Mabodo boshqasi kelib, u bilan talashib-tortishsa, o‘sha boshqa kimsaning bo‘yniga uringlar (ya’ni, o‘ldiringlar)» (Muslim rivoyati).",
 'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Siydikdan poklanmaslik"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"O‘n uchinchi gunohi kabira 
SIYDIKDAN POKLANMASLIK 
Alloh taolo aytadi:  
«Liboslaringizni pok tuting» (Muddassir surasi, 4).  
Ibn Abbos roziyallohu anhudan rivoyat qilinadi: «Payg‘ambar sollallohu alayhi vasallam ikki qabr yonidan o‘tdilar-da: «Bu ikkisi (ya’ni, qabrdagilar) azoblanmoqda. Gunohi kabira sababli azoblanayotganlari yo‘q. Ha, u gunohi kabiradir. Ulardan biri chaqimchilik qilib yurardi, boshqasi esa siydigidan saqlanmasdi», dedilar» (Buxoriy, Muslim va boshqalar rivoyati).  
Rasululloh sollallohu alayhi vasallam aytdilar: «Qabr azobining ko‘pchiligi siydik sababli bo‘ladi. Bas, siydikdan pok bo‘linglar!» (Doriqutniy rivoyati). Kimki badani va kiyimlarini siydikdan pok saqlamasa, uning namozi maqbul bo‘lmaydi.  
Hofiz Abu Nua’ym «Hil’a» kitoblarida Shafiy ibn Mati’dan rivoyat qiladi: «To‘rt toifa kimsalar o‘zi azoblanayotgan do‘zax ahliga yana ozor beradilar. Ular «Hamim» (qaynoq suv) va «jahim» (do‘zax olovi) orasida sarson bo‘ladilar, o‘zlariga o‘lim va halokat tilaydilar. Do‘zax ahli bir-birlariga: «Bularga nima bo‘lganki, o‘zimiz azoblanayotganimiz yetmaganiday, yana bizga ozor berishyapti?» deyishadi. Ulardan biri cho‘g‘dan bo‘lgan tobutga qamalgan bo‘ladi. Boshqasi ichak-chavoqlarini tortayotgan bo‘ladi. Yana birining og‘zidan yiring va qon oqayotgan bo‘ladi. Va oxirgisi o‘z go‘shtini yeyotgan bo‘ladi. Tobutdagi kishiga: «Bunga nima bo‘lganki, o‘zimiz azoblanayotgan bo‘lsak-da, bizga ozor berdi?» deyiladi. Aytadiki: «Bu kishi o‘lib, bo‘ynida odamlarning moli qolgan-da, unga vafo qilmagan». Keyin ichak chavog‘ini tortayotgan kimsaga: «Bunga nima bo‘lganki, o‘zimiz azoblanayotgan bo‘lsak-da, bizga ozor berdi?» deyiladi. Aytadiki, bu kishi siydik qaeriga tegayotganiga parvo ham qilmasdi, o‘sha yerini yuvib ham tashlamasdi. So‘ng og‘zidan yiring va qon oqayotgan kimsaga: «Bunga nima bo‘lganki, o‘zimiz azoblanayotgan bo‘lsak-da, bizga ozor berdi?» deyiladi. Aytadiki, bu kishi har bir fahsh va uyatsiz so‘zlarga nazar solib (eshitib), undan rohatlanardi, behayolikdan lazzatlanardi. Oxiri go‘shtini yeyotgan kimsaga: «Bunga nima bo‘lganki, o‘zimiz azoblanayotgan bo‘lsak-da, bizga ozor berdi?» deyiladi. Aytadiki, bu kishi g‘iybat qilib odamlarning go‘shtini yer va chaqimchilik qilib yurar edi».  
Allohdan afv va ofiyat so‘raymiz. Albatta, U rahmlilarning rahmlirog‘idir.",
  'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Namozni qasddan tark etish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"O‘n to‘rtinchi gunohi kabira
NAMOZNI QASDDAN TARK ETISH 
Alloh taolo aytadi:  
«Ey mo‘minlar, mol-dunyolaringiz va bola-chaqalaringiz sizlarni Allohning zikridan (ya’ni, Allohga ibodat qilishdan) yuz o‘girtirib qo‘ymasin! Kimki shunday qilsa, bas, ana o‘shalar ziyon ko‘rguvchi kimsalardir!» (Munofiqun surasi, 9).  
Mufassirlar aytganlarki, oyatdagi Allohning zikridan murod besh vaqt namozdir. Kimki namozni vaqtida o‘qishdan tijoratdagi, oldi-sotdidagi, kundalik hayotidagi mol-dunyosi yoki farzandlari sababli mashg‘ul bo‘lib qolsa, u ziyonkorlardandir.  
Payg‘ambar sollallohu alayhi vasallam aytadilar: «Bandaning qiyomat kunida birinchi hisob-kitob qilinadigan narsasi namozdir. Agar (namozi) durust bo‘lsa, boshqa amallari ham durust bo‘ladi. Bordi-yu, (namozi) yaroqsiz bo‘lsa, qolgan amallari ham yaroqsiz bo‘ladi» (Tabaroniy rivoyati).  
Alloh taolo do‘zax egalari haqida xabar qilib deydi:  
«(Ular do‘zax ahliga): «Sizlarni nima Saqarga kiritdi?» (deganlarida): Ular ayturlar: «Bizlar namoz o‘qiguvchilardan bo‘lmadik. Miskin-bechoraga taom berguvchi ham bo‘lmadik. Bizlar (botil-behuda so‘zlarga) sho‘ng‘uvchi kimsalar bilan birga sho‘ng‘ir edik (ya’ni, Qur’on va Payg‘ambar xususida tuhmatyolg‘onlar to‘qir edik). To bizlarga aniq (o‘lim) kelgunicha bizlar Jazo – Qiyomat kunini yolg‘on der edik». Endi qo‘llaguvchilarning qo‘llovi ularga foyda bermas!» (Muddassir surasi, 42–48).  
«Sahihul Buxoriy»da rivoyat qilinishicha, Rasululloh sollallohu alayhi vasallam shunday deganlar: «Kimki asr namozini tark etsa, uning amali aniq habata bo‘libdi (ya’ni, behuda ketibdi)».  
Rasululloh sollallohu alayhi vasallam aytdilar: «Namozni tark etmagin. Zero, kimki namozni qasddan tark etsa, darhaqiqat, undan Allohning zimmasi (himoyasi) soqit bo‘ladi» (Tabaroniy rivoyati).  
Rasululloh sollallohu alayhi vasallam aytdilar: «Insonlarga qarshi ular to Allohdan o‘zga iloh yo‘q va Muhammad Allohning elchisidir, deb guvohlik bermagunlaricha, namozni qoim qilmagunlaricha va zakotni bermagunlaricha jang qilishga buyurildim. Agar shuni qilsalar, mendan qonlari-yu mollarini saqlagan bo‘ladilar. Biroq, islom haqi bundan muntasno. Ularning hisobi Allohga havola» (Muttafaqun alayh).  
Payg‘ambar sollallohu alayhi vasallam aytdilar: «Kimki namozni muhofaza qilsa, qiyomat kunida u uchun (namozi) nur, hujjat va najot bo‘ladi. Kimda-kim uni muhofaza qilmasa, unga nur ham, hujjat ham, najot ham bo‘lmaydi va u qiyomat kunida Qorun, Fir’avn, Homon hamda Ubay ibn Xalaflar bilan birga bo‘ladi» (Imom Ahmad rivoyati).  
Ayrim ulamolar aytishlaricha, «Namozni tark etgan kimsa ana shu to‘rt mal’un bilan birga qayta tiriladi. Chunki uni namozdan yo molu davlati, yo mulk-saltanati, yo vazirlikmansabi va yo tijorati mashg‘ul qilgan. Kimki namozdan molu davlati sababli mashg‘ul bo‘lsa, u Qorun bilan birga tiriladi.  
Kimki namozdan mulk-saltanati sababli mashg‘ul bo‘lsa, u Fir’avn bilan birga tiriladi.  
Kimki namozdan vazirlik – mansabi sababli mashg‘ul bo‘lsa, u Homon bilan birga tiriladi",
   'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Namozni qasddan tark etish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Kimki namozdan tijorati sababli mashg‘ul bo‘lsa, u Makkadagi kofirlarning tijoratchisi bilan birga tiriladi».  
Umar ibn Xattob roziyallohu anhu jarohatlangan vaqtlarida: «Ey amiral mo‘minin, namoz (ya’ni, namozni o‘qib oling)», deyishdi. Shunda u zot roziyallohu anhu: «Ha, to‘g‘ri. Namozni zoe qilgan biron bir kishi uchun Islomda nasiba yo‘q», dedilar-da namozni o‘qidilar. Jarohatlaridan esa qon oqib turardi.  
Abdulloh ibn Shaqiq Tobi’iy roziyallohu anhu deydilar: «Muhammad sollallohu alayhi vasallamning sahobalari namozdan boshqa hech bir amalni tark etishni kufr deb hisoblamasdilar» (Termiziy rivoyati).  
Ibrohim Naxa’iy va Ayyub Sahtiyoniylar ham shu gapni aytishgan. Avn ibn Abdulloh deganlar: «Agar banda qabriga qo‘yilsa, birinchi bo‘lib so‘raladigani – namozdir. Agar namozi yaroqli topilsa, uning boshqa amallariga qaraladi. Bordi-yu, yaroqli deb bo‘lmasa, undan keyin boshqa biron amaliga qaralmaydi».  
Ibn Hazm: «Shirkdan keyin namozni vaqtidan kechiktirish va mo‘minni nohaq o‘ldirishdan ko‘ra ulkanroq gunoh yo‘q», deganlar. 
Rivoyat qilinishicha, qiyomat kunida birinchi bo‘lib namozni tark etguvchilarning yuzlari qorayadi. Jahannamda «Lam-lam» nomli ilonlar darasi bo‘lib, har bir ilonning yo‘g‘onligi tuyaning bo‘ynidek, uzunligi bir oylik masofaga teng bo‘ladi. Ular namozni tark etguvchilarni chaqadilar. Uning zahari namozni tark etguvchining jismida yetmish yil qaynaydi-da, so‘ng uning go‘shtlari erib tushadi.  
Hikoyat  
Rivoyat qilinishicha, bani Isroillik bir ayol Muso alayhissalom huzurlariga kelib: «Ey Allohning elchisi, men ulkan gunoh qilib qo‘yib, so‘ng bu gunohimdan Alloh taologa tavba qildim. Allohdan tavbamni qabul qilib, gunohimni mag‘firat etishini so‘rab duo qiling», dedi. Muso alayhissalom undan: «Nima gunoh qilding?» deb so‘ragan edi, u: «Ey Allohning payg‘ambari, men zino qilib, bola tug‘dim-da, so‘ng uni o‘ldirdim», dedi. Shunda Muso unga: «Chiq bu yerdan, ey fojira! Yana kafosating tufayli osmondan olov tushib, bizni yondirib yubormasin», dedi.  
Ayol payg‘ambar huzuridan qalbi o‘ksigan holda chiqib ketdi. Jabroil alayhissalom tushib: «Ey Muso, Alloh taolo: «Nima uchun tavba qilgan ayolni qaytarib yubording? Undan ko‘ra yomonroq kimsa borligini bilmaysanmi?» deyapti», dedi. Muso alayhissalom: «Ey Jabroil, undan ham yomonroq kimsa kim?» deb so‘ragan edi, «Namozni qasddan tark etgan kishi», deb javob berdi.  
Fasl  
Alloh taolo namozni vaqtidan kechiktirib o‘qishdan ogohlantirib aytadi:  
«So‘ng, ularning ortidan namozni zoe qiladigan va shahvatlarga beriladigan kimsalar o‘rinbosar bo‘ldilar. Endi u (o‘rinbosarlar) albatta yomonlikka (ya’ni, yomon jazoga) yo‘liqurlar. Magar tavba qilib, iymon keltirgan va yaxshi amallar qilgan zotlargina (azobga duchor qilinmaslarlar). Bas, ular jannatga kirurlar va ularga biron zulm qilinmas» (Maryam surasi, 59–60).  
Ibn Abbos roziyallohu anhumo: «Namozni zoe qilgan degani, uni butunlay tark etgani degani emas, balki namozni o‘z vaqtidan kechiktirib o‘qigan deganidir», deganlar.  
Tobe’inlar imomi Said ibn Musayyab rahmatullohi alayh aytganlarki: «U to asr bo‘lmaguncha peshinni o‘qimaydi. Asrni shomgacha, shomni xuftongacha, xuftonni bomdodgacha, bomdodni to quyosh chiqquncha o‘qimaydi",
   'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Namozni qasddan tark etish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Shu holatga odatlangan ko‘yi vafot etgan va tavba qilmagan kimsaga Alloh «g‘oyy» bilan tahdid soldi. Foyy – jahannamdagi juda chuqur, o‘ta badbo‘y vodiydir.  
Alloh taolo boshqa bir oyatda:  
Bas, namozlarini «unutib» qo‘yadigan kimsalar bo‘lgan «namozxon»larga halokat bo‘lgayki», deydi (Mo’uvn surasi, 4–5).  
Sa’d ibn Abu Vaqqos roziyallohu anhudan namozlarini «unutib» qo‘yadigan kimsalar haqida so‘raganlarida: «Vaqtini kechiktiradiganlar», deya javob berganlar.  
Ular «namozxon», deb nomlandi. Biroq namozga beparvoliklari va vaqtidan kechiktirganlari sababli ularga vayl bilan tahdid solindi. Vayl – shiddatli azobdir. Yana aytiladiki, Vayl jahannamdagi vodiy bo‘lib, agar unga dunyodagi tog‘lar tushirilsa, harorati yuqoriligidan toshlari erib ketardi. U namozga beparvo bo‘lgan va uni vaqtidan kechiktirib o‘qigan kimsalarning maskanidir. Faqat Allohga tavba qilib, ilgarigi e’tiborsizligiga nadomat chekkanlar bundan mustasno.  
Alloh taolo yana bir oyatda:  
«Ey iymon keltirganlar, mol-dunyolaringiz ham, farzandlaringiz ham sizlarni Allohning zikridan chalg‘itib qo‘ymasin. Kim shunday qilsa, bas, ana o‘shalar ziyon ko‘rguvchilardir», deydi (Munofiqun surasi, 9).  
Oisha roziyallohu anho aytadilar: «Rasululloh sollallohu alayhi vasallam to Alloh jonlarini olgunicha, (biror marta) namozni oxirgi vaqtiga qadar kechiktirganlari yo‘q» (Hokim rivoyati).  
Rasululloh sollallohu alayhi vasallamdan eng afzal amal qaysi, deb so‘ralganlarida: «Eng afzal amal – namozni vaqtida o‘qish, ota-onaga yaxshi munosabatda bo‘lish va jihod», deya javob berganlar (Imom Ahmad rivoyati).  
Rivoyat qilinishicha, kimki namozni vaqtida o‘qisa, tahoratni mukammal olgan, qiyomi, xushu’si, ruku’ va sajdalarini komil qilgan bo‘lsa, namoz oppoq, nurafshon bo‘lib ko‘tariladi va: «Meni saqlaganingdek, Alloh ham seni saqlasin», deydi.  
Kimda-kim namozini vaqtidan boshqa paytda o‘qisa, tahoratni to‘liq olmasa, xushu’, ruku’ va sajdalarini komil qilmasa, namoz qop-qora, zulmatli bo‘lib ko‘tariladi va «Meni zoe qilganingdek, Alloh ham seni zoe qilsin», deydi. Hatto Alloh xohlagan joyga yetgach, xuddi eski kiyimga o‘xshab o‘raladi-da, uning yuziga uriladi.  
Abdulloh ibn Amr roziyallohu anhudan rivoyat qilinadi: «Rasululloh sollallohu alayhi vasallam aytdilar: «Uch toifa odamning namozini Alloh qabul qilmaydi: qavm uni yoqtirmasa-da, ularga imomlik qiladigan kishining, namozga orqa tomondan keladigan ya’ni, namozni vaqti o‘tganidan keyin o‘qiydigan kishining va o‘zi ozod qilgan odamni qul qilib olgan kishining» (Abu Dovud, Ibn Moja rivoyati).  
Rivoyat qilinishicha, kimda-kim ikki namozni uzrsiz jam qilib o‘qiydigan bo‘lsa, u gunohi kabira eshiklaridan birini ochgan bo‘ladi.  
Ibn Abbos roziyallohu anhumo aytganlar: «Agar qiyomat kuni bo‘lsa, bir kishini Alloh azza va jallaning huzurida hozir qilishadi. Shunda uni do‘zaxga tashlashni buyuradi. «Ey Rabbim, nima uchun?» deb so‘raganida, Alloh taolo: «Namozni vaqtidan kechiktirganing va Mening nomim bilan yolg‘on qasam ichganing uchun», deydi.     Hikoyat  
Salaflardan birining singlisi vafot etib, uni lahadga qo‘ydi. Shunda pul solingan hamyoni mayyitning qabriga tushib qoldi va buni hech kim sezmadi. U qabrdan ketgach, hamyonini esladi va iziga qaytdi. Odamlar tarqab ketganlaridan keyin qabrni kavladi. Bir payt qarasa, unda olov alangalanib turibdi, darhol qaytadan ko‘mib ortiga qaytdi. Keyin onasining oldiga yig‘lab keldi-da: «Ey onajon, singlim nima ish qilardi, menga aytib bering», dedi. «Nima edi?» deb so‘ragan onasiga: «Uning qabrida olov ko‘rdim», deya javob berdi. Shunda onasi yig‘ladi va: «Ey o‘g‘lim, singling namozga beparvo edi va uni vaqtidan kechiktirib o‘qirdi», dedi.  
Namozni vaqtidan kechiktirib o‘qigan kishining holi shu bo‘lsa, umuman namoz o‘qimaydigan kimsaning ahvoli ne kechar ekan?!  
Alloh taolodan namozni vaqtida ado etishga yordam berishini so‘raymiz. Albatta, U saxiy, muruvvatli zotdir.",
   'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Namozni qasddan tark etish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Bola necha yoshdan namozga buyuriladi?  
Rasululloh sollallohu alayhi vasallam aytganlar: «Bolani yetti yoshga yetganida namozga buyuringlar. O‘n yashar bo‘lganida (namoz o‘qimasa) uringlar» (Abu Dovud, Termiziy rivoyati).  
Boshqa bir rivoyatda shunday deyiladi: «Farzandlaringizni yetti yashar bo‘lganlarida namozga buyuringlar. O‘n yashar bo‘lganlarida (namoz o‘qimasa) uringlar va yotoqlarini alohida-alohida qilinglar» (Abu Dovud rivoyati).  
Fasl  
Namozni chala o‘qiydigan, uning ruku’ va sajdalarini to‘liq qilmaydigan kimsaning uqubati  
«Bas, namozlarini «unutib qo‘yadigan» «namozxonlarga vayl bo‘lsin» oyatining tafsirida shunday deyilgan: «U namozni chala o‘qiydigan, ruku’ va sajdalarini to‘liq qilmaydigan kimsadir».  
Abu Hurayra roziyallohu anhudan rivoyat qilinadi: «Bir kishi masjidga kirib keldi. Rasululloh sollallohu alayhi vasallam masjidning chekkasida o‘tirgan edilar. U kishi namoz o‘qidi-da, kelib u zotga salom berdi. Rasululloh sollallohu alayhi vasallam unga: «Senga ham salom bo‘lsin, qaytib borib, namoz o‘qi, sen namoz o‘qiganing yo‘q», dedilar. U yana namoz o‘qidi-da, kelib salom berdi. «Senga ham salom bo‘lsin, qaytib borib boshqatdan o‘qi, sen namoz o‘qiganing yo‘q», dedilar. U namoz o‘qidi-da, kelib salom berdi. Nabiy: «Senga ham salom bo‘lsin, qaytib borib boshqatdan o‘qi, sen namoz o‘qiganing yo‘q», dedilar. Haligi kishi keyingi marotaba aytilganida: «Yo Rasululloh, menga o‘rgatib qo‘ying», dedi. «Agar namozga tursang, tahoratni mukammal ol. Qiblaga yuzlangach, takbir ayt va o‘zing bilgan Qur’on sura-oyatlarni o‘qi. Keyin to qanoat hosil qilguningcha ruku’da tur. So‘ngra to‘la tik bo‘lguningcha qaddingni rostla. So‘ng qanoat hosil etguningcha sajda qil. So‘ngra to‘la o‘tirguningcha qaddingni rostla. Keyin qanoat hosil etguningcha sajda qil. So‘ngra to‘la tik bo‘lguningcha qaddingni rostla. Xullas, butun namozingda shunday qil», dedilar» (Buxoriy va Muslim rivoyati). 
Abu Mas’ud Badriydan rivoyat qilinadi: «Rasululloh sollallohu alayhi vasallam aytdilar: «Ruku’ va sajdadan umurtqasini tik qilib ko‘tarmagan kishining namozi namoz hisoblanmaydi» (Ahmad, Abu Dovud va Termiziy rivoyati).  
Boshqa bir rivoyatda: «Ruku’ va sajdalardan belini rostlamaguncha...» deyilgan.  
Bu hadis namoz o‘qiganda ruku’ va sajdalardan keyin belini rostlamagan kishining namozi botil ekaniga hujjat. Chunki har bir a’zo o‘rnida qaror topishi namozdagi farzlardandir. (Izoh: Hanafiy mazhabida bu ish vojib sanaladi. – Muharrir.)  
Payg‘ambar sollallohu alayhi vasallam: «Odamlar orasidagi eng yomon o‘g‘ri namozidan o‘g‘irlaydigan kimsa», dedilar. «Yo Rasululloh, qanday qilib kishi namozidan o‘g‘irlaydi?» deb so‘rashganda, «Ruku’ va sajdalarini to‘liq qilmasdan», deya javob berdilar» (Ibn Xuzayma, Hokim rivoyati).  
Abu Hurayra roziyallohu anhudan rivoyat qilinadi: «Rasululloh sollallohu alayhi vasallam aytdilar: «Ruku’ va sajdalari orasida umurtqasini rostlamaydigan bandaga Alloh qaramaydi» (Imom Ahmad rivoyati).  
Payg‘ambar sollallohu alayhi vasallam aytdilar: «Munofiqning namozi bunday: u quyoshni kuzatib o‘tiradi, o‘tiradi-da, u shaytonning ikki shohi orasiga kelgach, turib (qush donni cho‘qigandek) to‘rt marta yotib turadi va unda Allohni kamdan-kam eslaydi» (Muslim rivoyati).",
   'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Namozni qasddan tark etish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Rasululloh sollallohu alayhi vasallam ruku’ va sajdalarni to‘liq qilmasdan namoz o‘qiyotgan kishini ko‘rdilar va: «Agar bu kimsa mana shu holatda o‘lib ketsa, Muhammad sollallohu alayhi vasallam millatidan boshqasida o‘lgan bo‘ladi», dedilar (Tabaroniy va Ibn Huzayma rivoyati).  
Ibn Abbos roziyallohu anhudan rivoyat qilinadi: «Rasululloh sollallohu alayhi vasallam: «Yettita a’zo bilan sajda qilishga buyurildim: Peshona (qo‘llari bilan burunlariga ham ishora qildilar), ikki qo‘l, ikki tizza va ikki oyoq bilan», dedilar» (Muttafaqun alayh).  
Boshqa bir rivoyatda: «Yettita (a’zo) bilan sajda qilishga, soch va kiyimni yig‘ib olmaslikka buyurildim: peshona va burun, ikki qo‘l, ikki tizza hamda ikki oyoq», deyilgan (Muslim, Nasoiy rivoyati).  
Kishi namoz o‘qiyotganda, qaysi a’zosining namozdagi haqini ado etmasa, to namoz o‘qib bo‘lgunicha o‘sha a’zo unga la’nat aytib turadi.  
Rivoyat qilinadiki, har bir namozxonning o‘ng tomonida bir farishta, chap tomonida bir farishta bo‘ladi. Agar u namozni to‘liq o‘qisa, namozni olib chiqib ketadilar. Agar to‘liq o‘qimasa, namoz bilan uning yuziga uradilar.  
Salmon Forsiy roziyallohu anhu aytganlar: «Namoz o‘lchovdir. Kim vafo qilsa, vafo ko‘radi. Kim urib qolsa, Alloh urib qoluvchilar haqida nima deganini yaxshi bilasizlar. Alloh taolo: 
«(O‘lchov va tarozidan) urib qoluvchi kimsalarga vayl bo‘lsin», degan».  
Imom Buxoriy rivoyat qiladi: Huzayfa ibn Yamon ruku’ va sajdalarini to‘liq qilmasdan namoz o‘qiyotgan kishini ko‘rib, unga: «Sen namoz o‘qimading. Agar o‘lsang, Alloh Muhammad sollallohu alayhi vasallamga tabiat qilib bergan fitratdan boshqasida o‘lgan bo‘lasan», dedilar.  
Nasoiy rivoyat qilgan asarda kelishicha, Huzayfa roziyallohu anhu undan: «Necha yildan beri shunday namoz o‘qiysan?» deb so‘raganlar. «Qirq yildan beri», deya javob bergan. Shunda ulug‘ sahoba: «Qirq yildan beri namoz o‘qimabsan. Agar namozni shu tarzda o‘qib vafot etsang, Muhammad sollallohu alayhi vasallam fitratidan boshqasida o‘lgan bo‘lasan», deganlar.  
Hasan Basriy aytadilar: «Ey Odam farzandi, agar senga namozing qadrsiz bo‘lsa, u holda diningdagi qaysi narsa sen uchun aziz?! Holbuki, sen qiyomat kunida birinchi bo‘lib namozingdan so‘ralasan-ku!»  
Payg‘ambar sollallohu alayhi vasallam aytganlarki: «Qiyomat kunida bandaning birinchi bo‘lib hisob-kitob qilinadigan amali namozidir. Agar namozi durust bo‘lsa, u, shakshubhasiz, muvaffaqiyat qozonib najot topibdi. Agar namozi yaroqsiz-fosid bo‘lsa, u aniq muvaffaqiyatsizlikka uchrab ziyon ko‘ribdi. Agar biron farzida yetishmovchilik bo‘lsa, Alloh azza va jalla: «Qaranglarchi, bandamning farzlaridagi kamchiliklarini to‘ldiruvchi ixtiyoriy namozlari bormikan?» deydi. So‘ng qolgan amallari ham shu yo‘sinda bo‘ladi» (Termiziy rivoyati).  
Har birimiz farzlardagi nuqsonlarni to‘ldirishimiz uchun ko‘proq nafl namozlar o‘qishimiz lozim bo‘ladi. Tavfiq Allohdan.",
   'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Erkaklarning tilla va ipak kiyishi"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"ERKAKLARNING TILLA TAQISHLARI VA IPAK KIYISHLARI 
Rasululloh sollallohu alayhi vasallam aytdilar: «Kimki dunyoda ipak kiysa, oxiratda kiymaydi» (Buxoriy va Muslim rivoyati).  
Bu hukm barcha erkaklarga taalluqli. Zero, Payg‘ambar sollallohu alayhi vasallam aytganlarki: «Tilla va ipak kiyish ummatimning erkaklariga harom, ayollarga esa halol qilindi» (Termiziy rivoyati).  
Huzayfa ibn Yamon roziyallohu anhu aytadilar: «Rasululloh sollallohu alayhi vasallam bizni tilla va kumush idishda ichish va yeyishdan, ipak va diyboj (kimxob) kiyish va unga o‘tirishdan qaytardilar» (Buxoriy rivoyati).  
Qaysi erkak ipak kiyishni halol deb bilsa, u kofirdir. Payg‘ambar sollallohu alayhi vasallam esa faqatgina qichima, qo‘tir yoki boshqa kasali bor odamlarga va dushman bilan olishayotgan jangchilarga ipak kiyishga ruxsat berganlar. Anas roziyallohu anhu aytadilar: «Zubayr va Abdurahmon ibn Avf roziyallohu anhumo qichima bo‘lganlari sababli, Rasululloh sollallohu alayhi vasallam ularga ipak kiyishga ruxsat berdilar» (Muttafaqun alayh).  
Biroq erkaklarning ziynat uchun ipak kiyishlari haromligiga musulmonlar ijmo’ qilishgan. Tarkibining ko‘p qismini ipak tashkil etgan kiyimlar ham haromdir.  
Shuningdek, erkaklarga tilla buyumlardan foydalanish ham haromdir. Binobarin, tilla uzuk, tilla ayil, tilla dastali qilich ishlatish ham mumkin emas. Zero, Payg‘ambar sollallohu alayhi vasallam bir kishining qo‘lida tilla uzukni ko‘rib, uni yechib olib: «Sizlardan bir kishi do‘zaxdan bir bo‘lak cho‘qqa intiladi-da, uni qo‘liga taqib oladi», deganlar (Muslim rivoyati).  
Zar jiyakli, tilla bilan oro berilgan liboslarni kiyish ham erkaklar uchun haromdir.  
Ulamolar yosh bolaning tilla va ipak kiyishi joiz-nojoizligi xususida ixtilof qilishgan. Bir toifa ulamolar bunga ruxsat bergan bo‘lsalar, qolganlari joiz emas, deb bilganlar va Payg‘ambar sollallohu alayhi vasallamning ushbu hadisini hujjat qilib keltirganlar: «Bu ikkisi (ya’ni, tilla va ipak) erkak ummatimga haromdir» (Abu Dovud rivoyati).  
Hadisi sharifdagi hukm yosh bolalarga ham taalluqli. Bu Imom Ahmad va boshqa ulamolarning fikridir.  
Allohdan O‘zi suygan va rozi bo‘lgan narsalarga muvaffaq etishini so‘ramiz. Albatta, U saxiy, marhamatli zotdir.",
    'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Ayollaring erkaklarga erkalarning ayollarga o'xshashi"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"AYOLLARNING ERKAKLARGA, ERKAKLARNING AYOLLARGA O‘XSHASHLARI 
Ibn Abbos roziyallohu anhumo aytadilar: «Rasululloh sollallohu alayhi vasallam ayollarga taqlid qiluvchi erkaklarni va erkaklarga taqlid qiluvchi ayollarni la’natladilar» (Buxoriy, Abu Dovud rivoyati).  
Rasululloh sollallohu alayhi vasallam ayolsifat erkaklarni va erkakshoda ayollarni la’natlaganlar» (Buxoriy rivoyati).  
Kiyinish va gapirishda erkaklarga o‘xshaydigan ayollarga erkakshoda ayollar deyiladi. Bir rivoyatda: «Alloh erkakshoda ayollarni la’natladi», deyilgan.  
Abu Hurayra roziyallohu anhu aytadilar: «Rasululloh sollallohu alayhi vasallam ayollar kiyimini kiyadigan erkakni va erkaklar kiyimini kiyadigan ayolni la’natladilar» (Abu Dovud, Nasoiy, Hokim).  
Agar ayol kishi erkaklarga xos bo‘lgan liboslarni kiysa, u o‘zini erkaklarga o‘xshatgan hisoblanadi va Alloh va Rasulining la’natiga duchor bo‘ladi. Eri ham agar uning shunday yurishiga imkon bersa (ya’ni, rozi bo‘lsa va uni qaytarmasa) mal’undir (la’natlangandir). Chunki u ayolini Allohga itoat etishga undashi va gunoh ishlardan qaytarishi lozim. Zero, Alloh taolo aytganki:",
   'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Ayollaring erkaklarga erkalarning ayollarga o'xshashi"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"«Ey mo‘minlar, sizlar o‘zlaringizni va ahli-oilalaringizni do‘zaxdan saqlangizki, uning o‘tini odamlar va toshlardir» (Tahrim surasi, 6).  
Ya’ni, ularga odob va ta’lim bering, Allohga itoat etishga buyurib, gunoh ishlardan qaytaring, o‘zingizga ham xuddi shunday munosabatda bo‘ling, deyilmoqda.  
Payg‘ambar sollallohu alayhi vasallam aytganlar: «Har biringiz nozir va o‘z ra’iyatiga mas’uldir. Erkak kishi o‘z ahli oilasiga nozir va qo‘l ostidagilarga mas’uldir» (Muttafaqun alayh).  
Abu Bakr roziyallohu anhudan rivoyat qilinadi: Rasululloh sollallohu alayhi vasallam aytdilar: «Erkaklar ayollarga itoat etgan vaqtlarida halok bo‘ldilar» (Hokim rivoyati).  
Hasan roziyallohu anhu aytganlar: «Allohga qasamki, kishi xotiniga uning havoyi nafsi tilagan narsalarda itoat etsa, Alloh taolo uni do‘zaxga uloqtiradi».  
Rasululloh sollallohu alayhi vasallam aytdilar: «Men ko‘rmagan ikki toifa borki, ular do‘zax ahlidandir: Sigir dumiga o‘xshash qamchilari bo‘lib, u bilan odamlarni uradigan toifa hamda kiyim kiygan yalong‘och, yo‘ldan uruvchi, yo‘ldan ozgan ayollar. Ularning boshlari tuyaning o‘rkachi kabi. Ular jannatga kirmaydilar, uning hidini ham topmaydilar. Holbuki, uning hidi muncha-muncha yo‘llik masofadan kelib turadi» (Muslim rivoyati).  
Kiyim kiygan – Allohning ne’matlariga musharraf bo‘lgan, lekin yalong‘och – Unga shukr qilmaydigan ayollar yoki badanining shakli va rangi bilinib turadigan darajada yupqa va tor kiyadigan ayollar, deganidir. 
Nofe’ roziyallohu anhu rivoyat qiladi: «Ibn Umar va Abdulloh ibn Amrlar Zubayr ibn Abdulmuttalibning huzurida edilar. Bir vaqt yelkasiga kamon osgan ayol qo‘ylarini haydab o‘tib qoldi. Abdulloh ibn Umar undan: «Sen erkakmisan yo ayol?» deb so‘radilar. «Ayolman», dedi u. Ibn Umar Ibn Amrga o‘girildilar-da: «Alloh taolo Payg‘ambar tili orqali erkaklarga taqlid qiluvchi ayollarni va ayollarga taqlid qiluvchi erkaklarni la’natlagan», dedilar».  
Ko‘chaga chiqqanda nomahramlarga zeb-ziynat va taqinchoqlarini ko‘rsatib yuradigan, mushk-anbar va har xil xushbo‘yliklar bilan o‘ziga oro beradigan hamda kalta va tor liboslar kiyadigan ayollar ham mal’undirlar. Bu ishlarning barchasini, ya’ni, o‘zini bozorga solib, jamolini ko‘z-ko‘z qilib yurishni Alloh taolo yomon ko‘radi. Lekin ming afsuslar bo‘lsinki, ko‘p ayollar shaytonning tuzog‘iga ilingandirlar. Payg‘ambar sollallohu alayhi vasallam ular haqida: «Do‘zaxga boqib, uning ko‘pchilik ahli ayollar ekanligini ko‘rdim», deganlar (Muslim rivoyati).  
Yana u zot sollallohu alayhi vasallam aytganlarki: «O‘zimdan keyin erkaklar uchun ayollardan ko‘ra zararliroq fitna qoldirmadim» (Muslim rivoyati).  
Alloh taolodan bizni ayollar fitnasidan saqlashini va O‘z fazlu marhamati ila ularni ham, bizni ham isloh etishini so‘raymiz.",
    'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Zakot bermaslik"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Alloh azza va jalla aytadi:  
«Alloh fazlu karami bilan ato qilgan narsalarning (zakotini) berishga baxillik qilgan kimsalar hargiz bu qilmishlarini o‘zlari uchun yaxshilik deb hisoblamasinlar. Yo‘q, bu qilmishlari o‘zlari uchun yomonlikdir. Baxillik qilib bermagan narsalari qiyomat kunida bo‘yinlariga o‘ralajak!..» (Oli Imron surasi, 180).  
«Zakotni (haqdorlarga) ato etmaydigan mushriklarga esa halokat bo‘lgay!» (Fussilat, 6-7).  
Zakot bermaydigan kimsalarni «mushriklar» deb atadi. 
«Oltin-kumushni to‘plab, uni Alloh yo‘lida infoq-ehson qilmaydigan kimsalarga alamli azob «xushxabari»ni bering! U Kunda (qiyomatda) o‘sha (oltinkumushlar) jahannam o‘tida qizitilib, u bilan ularning peshonalari, yonlari va ketlariga tamg‘a bosilib: «Mana bu o‘zlaringiz uchun to‘plagan narsalaringizdir. Endi to‘plagan narsalaringizning mazasini totib ko‘ringlar» (deyilur)» (Tavba surasi, 34–35).  
Butun a’zolar orasidan faqatgina peshona, yonbosh va orqa tomonga tamg‘a bosilishining boisi, baxil boy faqirlarni ko‘rganda, peshonasini tirishtirib, yonboshi bilan turib olar, agar yaqiniga kelsa, orqasini o‘girib olar edi. Jazo qilmishiga yarasha, mos bo‘lishi uchun mazkur a’zolarga tamg‘a bosiladi.  
Rasululloh sollallohu alayhi vasallam aytdilar: «Qaysi bir oltin yoki kumush sohibi boyligining haqini (zakotini) bermas ekan, qiyomat kuni bo‘lganda olovdan qozonlar yasalib, boyligi jahannam olovida qizdiriladi-da, u bilan peshonasi, yonboshi va orqa tomoniga tamg‘a bosiladi. Agar u sovib qolsa, darhol boshqatdan qizdiriladi. Bu miqdori ellik ming yilga teng bo‘lgan kunda, to bandalar orasida hukm qilinguncha davom etadi. So‘ng jannatga yoki do‘zaxga eltuvchi yo‘lini ko‘radi». «Yo Rasululloh sollallohu alayhi vasallam, tuyalar-chi?» deb so‘rashdi. Rasululloh aytdilar: «Tuya sohibi ham uning haqqini ado qilmas ekan (uning haqqi sug‘orilgan kuni sog‘ib olinishidir), qiyomat kuni o‘sha tuya uchun tekis joy hozirlab beriladi. Tuyaning biror bolasi ham qolmasdan, egasini tuyoqlari bilan toptaydi, og‘izlari bilan tishlaydi, ustidan avvalgisi o‘tsa, yana boshqasi qaytib keladi. (Bu ish) miqdori ellik ming yil bo‘lgan bir kunda toki bandalar orasida hukm qilinib, (tuya sohibi) yo‘li jannatga yoki do‘zaxga ekanini ko‘rguncha (davom etadi)».  
Yana aytildi: «Yo Rasululloh, sigir va qo‘ylar-chi?» Rasululloh aytdilar: «Qaysi bir sigir yoki qo‘y egasi uning haqqini ado etmasa, qiyomat kuni bo‘lganda (o‘sha sigir va qo‘y uchun) hamma narsa ko‘rinadigan tep-tekis bir yer kengaytirib beriladi. (U sigir va qo‘ylar) ichida shoxi bir-biriga kirishib ketgan bo‘ladi, shoxsiz yoki shoxi singani bo‘lmaydi, ular uni (egasini) shoxlari bilan suzadilar, tuyoqlari bilan toptaydilar, ustidan bittasi o‘tib ketsa, yana boshqasi kelib bosadi. (Bu ish) miqdori ellik ming yil bo‘lgan bir kunda bo‘lur. Toki hukm qilinib, (mol egasi) yo‘li jannat yoki do‘zaxga ekanini ko‘rguncha (davom etadi)».  
Rasululloh sollallohu alayhi vasallam aytdilar: «Do‘zaxga birinchi bo‘lib kiradigan uch toifa: zolim amir, molidagi Alloh taoloning haqini ado qilmaydigan boy, mutakabbir kambag‘al» (Ibn Hibbon, Ibn Huzayma rivoyati).",
    'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Zakot bermaslik"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Ibn Abbos roziyallohu anhumo: «Kimning Alloh taolo baytini haj qilishga yetadigan mablag‘i bo‘lsa-yu, haj qilmasa, yoki zakot berish vojib bo‘lsa-yu, zakot bermasa o‘layotgan vaqtida hayotga qaytarilishini so‘raydi», dedilar. Shunda bir kishi: «Ey Ibn Abbos, Allohdan qo‘rq, hayotga qaytarilishni kofirlar so‘raydi», deya e’tiroz bildirdi. Ibn Abbos roziyallohu anhu: «Senga bu haqda Qur’on (oyati) o‘qib beraman. Alloh taolo:  
«Sizlarning (har) biringizga o‘lim kelib, u: «Parvardigorim, meni ozgina muddatga (hayotda) qoldirsang, men xayr-sadaqa qilib, solih (banda)lardan bo‘lsam» deb qolishidan ilgari – Biz sizlarga rizq qilib bergan narsalardan infoq-ehson qilingiz!» (Munofiqun surasi, 10) degan», deya javob berdilar.  
«Zakot qachon vojib bo‘ladi?» deb so‘rashgan edi. «Mol (boylik) ikki yuz dirhamga yetsa, undan zakot berish vojib bo‘ladi», dedilar. «Haj qachon vojib bo‘ladi?» so‘rashgan edi. «Ozuqa va ulovga ega bo‘lganda», deya javob berdilar.  
Abu Hurayra roziyallohu anhudan rivoyat qilinadi: Rasululloh sollallohu alayhi vasallam aytdilar: Alloh kimga boylik ato etgan bo‘lsa-yu, u zakotini bermasa, qiyomat kunida boyligi ikki kokilli ajdarga aylantiriladi. So‘ng u sohibining bo‘yniga o‘raladi-da, ikki lunjidan tutib: «Men sening molingman, sening xazinangman», deydi va ushbu oyatni o‘qiydi:  
«Alloh fazlu karami bilan ato qilgan narsalarning (zakotini) berishga baxillik qilgan kimsalar hargiz bu qilmishlarini o‘zlari uchun yaxshilik deb hisoblamasinlar! Yo‘q, bu qilmishlari o‘zlari uchun yomonlikdir. Baxillik qilib bermagan narsalari qiyomat kunida bo‘yinlariga o‘ralajak!» (Buxoriy rivoyati).  
Rasululloh sollallohu alayhi vasallam aytdilar: «Besh ish besh ishga bog‘liq». «Yo Rasululloh, biri ikkinchisiga bog‘liq bo‘lgan besh ish qaysi?» deb so‘rashdi. «Qaysi qavm ahdini buzsa, ularga dushmanlari hukmron bo‘ladi. Alloh nozil qilgandan boshqa narsa bilan hukm qilsa, ularda faqirlik yoyiladi. Fahsh ishlar avj olsa, ularda o‘lim ko‘payadi. Zakot bermasalar, ularga yomg‘ir yog‘dirilmay qo‘yadi. O‘lchov va tarozidan urib qolishsa, nabototlar o‘smay, bir necha yil qirg‘oqchilikka duchor bo‘ladilar», deya javob berdilar (Tabaroniy).  
Ibn Mas’ud roziyallohu anhu aytadilar: «(Baxil) kishiga tamg‘a bosilayotganda dirham dirhamga, dinor dinorga tekkan holda bosilmaydi. Balki terisi kengaytirilib, har bir dinor va dirham alohida-alohida qo‘yilib tamg‘a bosiladi». (Tabaroniy rivoyati).  
Iste’molda bo‘lgan muboh taqinchoqlardan zakot berilmaydi. Mulk yoki ijara hisobidagi taqinchoqlardan esa beriladi.  
Hikoya  
Muhammad ibn Yusuf Faryobiy hikoya qiladilar: «Bir necha ashoblarim bilan Abu Sinonni (Alloh rahmat qilsin) ziyorat qilgani bordik. U zotning huzurlariga kirib o‘tirganimizdan keyin: «Qo‘shnimizning akasi qazo qilgan. Yuringlar, unikiga ta’ziyaga chiqamiz», dedilar. Hammamiz turib, azadornikiga bordik. U akasining o‘limidan juda betoqat bo‘lib yig‘lar edi. Biz unga ta’ziya bildirib, tasalli berdik. U ta’ziyaga ham, tasalliga ham quloq solmas edi. Unga: «O‘lim hammaning boshida borligini bilmaysanmi?» degan edik, «Bilaman, biroq akam tunu kun azoblanayotgani meni qon yig‘latmoqda», dedi. «Alloh senga g‘aybni bildirdimi?» deb so‘ragan edik. «Yo‘q, lekin akamning yuziga tuproq tortib dafn qilgandan va odamlar tarqab ketgandan so‘ng qabri yoniga cho‘kdim. Shu payt qabridan: «Oh, meni o‘z holimga qo‘yinglar, meni azoblamanglar. Men namoz o‘qirdim, ro‘za tutardim», degan ovoz eshitildi. Bu gapdan men yig‘lab yubordim va ahvolini ko‘rish uchun qabrini kavladim. Lahadda olov alangalanib turar va uning bo‘ynida olov bo‘yinbog‘ bor edi. Ukalik mehrim qo‘zib, bo‘yinbog‘ni olish maqsadida qo‘limni uzatdim. Barmoqlarim va qo‘llarim kuyib qoldi», dedi-da, qo‘llarini chiqarib ko‘rsatdi. U kuyib qopqora bo‘lib ketgan edi. So‘zida davom etib aytdi: «Uni qaytadan ko‘mib, qaytib keldim. 
Uning bu holiga qanday qilib yig‘lamaslik va xafa bo‘lmaslik mumkin?!» «Akangiz tirikligida nima amal qilar edi?» so‘radik biz. «Mol-mulkining zakotini bermas edi», dedi. «Bu Alloh taoloning:  
«Alloh fazlu karami bilan ato qilgan narsalarning (zakotini) berishga baxillik qilgan kimsalar hargiz bu qilmishlarini o‘zlari uchun yaxshilik deb hisoblamasinlar! Yo‘q, bu qilmishlari o‘zlari uchun yomonlikdir. Baxillik qilib bermagan narsalari qiyomat kunida bo‘yinlariga o‘ralajak!» (Oli imron surasi, 180) degan kalomining tasdig‘idir. Azob akangizga qiyomat kunigacha qabrida beriladigan bo‘libdi-da», dedik».  
Allohdan afv va ofiyat tilaymiz. Albatta, U saxovatli, marhamatli zotdir.",
    'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Minnat qilishlik"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"BERGAN NARSANI MINNAT QILISH 
Alloh taolo aytadi:  
«Ey iymon keltirganlar, molini odamlarga ko‘rsatish uchun beradigan, Allohga va oxirat kuniga ishonmaydigan kimsaga o‘xshab, bergan sadaqalaringizni minnat va ozor bilan yo‘qqa chiqarmang!» (Baqara surasi, 264).  
Kalbiy: «Qilgan sadaqasini Allohga minnat qilish va olgan odamga ozor berish bilan», deb tafsir qilganlar.  
Rasululloh sollallohu alayhi vasallam aytganlar: «Qiyomat kunida Alloh uch toifa odamga gapirmaydi, qaramaydi, ularni poklamaydi va ularga alamli azob bordir: kiyimini uzun qilib yerga sudrab yuruvchi, minnatchi va yolg‘on qasam bilan molini o‘tkazuvchi» (Muslim rivoyati).  
Boshqa bir hadisda: «Qiyomat kunida Alloh uch toifa odamga – ota-onasiga oq bo‘lgan, mast qiluvchi narsalarga mukkasidan ketgan va bergan narsasini minnat qilgan odamga qaramaydi. Shuningdek, uch toifa kimsa jannatga kirmaydi: ota-onasiga oq bo‘lgan, dayus va erkakshoda ayol», deyilgan (Nasoiy, Bazzor rivoyati).  
Erkakshoda ayoldan murod erkaklarga taqlid qiladigan ayoldir.  
Abu Bakr Siddiq roziyallohu anhu rivoyat qiladilar: Payg‘ambar sollallohu alayhi vasallam aytdilar: «Makkor-aldamchi, minnatchi va baxil jannatga kirmaydi» (Termiziy rivoyati).  
«Yaxshilikni minnat qilishdan ehtiyot bo‘linglar, chunki u shukrni yo‘q qiladi, ajrni ketkazadi», degan xabar ham rivoyat qilingan.  
Ibn Siyrin bir kishining boshqa birovga, senga yaxshilik qildim, undoq qildim, bundoq qildim, deyayotganini eshitib qoldilar-da, unga: «Jim bo‘l. Agar sanaladigan bo‘lsa, yaxshiliklarda naf yo‘q», dedilar.  
Ayrim ulamolar aytgan ekanlarki: «Kim qilgan yaxshiligini minnat qilsa, noshukr bo‘ladi, kim o‘z amalidan g‘ururlansa, ajri ketadi».  
Imom Shofe’iy quyidagi ma’nodagi misralarni o‘qigan ekanlar: «Odamlarga og‘irliging tushmasin, toki senga minnat qilishmasin. O‘zingning ulushingni ixtiyor qilib sabr et, zero sabr jannatdir. Birovlarning minnati qalbga tishlagandan ko‘ra qattiqroq ta’sir qiladi».",
     'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Suvni qizg'anish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"EHTIYOJDAN ORTIQCHA SUVNI QIZG’ANISH 
Alloh taolo aytadi:  
«Ayting: «Xabar beringiz-chi, agar (to‘satdan ichar) suvlaringiz (er tubiga) singib ketar bo‘lsa, u holda kim sizlarga oqar suv keltira olur?!» (Mulk surasi, 30).  
Payg‘ambar sollallohu alayhi vasallam aytdilar: «Yaylovni xarob qilish maqsadida ortiqcha suvni to‘smanglar» (Muttafaqun alayh).  
Rasululloh sollallohu alayhi vasallam aytdilar: «Kimda-kim ortiqcha suvini yoki ortiqcha o‘t-o‘lanini man qilsa (ya’ni, boshqalarga bermasa), Alloh azza va jalla qiyomat kunida undan O‘z fazlini man qiladi» (Imom Ahmad rivoyati).",
     'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Allohdan o'zgaga atab jonliq so'yishlik"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"ALLOHDAN BOSHQAGA ATAB JONLIQ SO‘YISH 
Alloh taolo buyuradi:  
«Allohning nomi zikr qilinmagan narsalardan yemangiz!» (An’om surasi, 121)  
Ibn Abbos roziyallohu anhumo ushbu oyati karimaning tafsirida shunday deganlar: «Undan murod o‘limtik, bo‘g‘ilib o‘lgan va but-sanamlarga atab so‘yilgan jonivorlar».  
Kalbiy aytganlarki: «Ular Alloh nomi zikr qilinmagan yoki Alloh taolodan boshqaga atab so‘yilgan jonivorlardir».  
Ato aytganlar: «Quraysh qabilasi va boshqa arablar butlarga atab so‘ygan jonliqlar».  
«...Zotan, bu ish itoatsizlikdir. Albatta, shaytonlar o‘z do‘stlarini (ya’ni, mushriklarni) sizlar bilan tortishishlari uchun vasvasaga solurlar». Ya’ni, mushriklar mo‘minlar bilan o‘limtiklar xususida tortishadilar.  
«...Agar ularga bo‘yinsunsangiz, hech shak-shubhasiz, mushriklardan bo‘lib qolursizlar» (An’om surasi, 121).  
Ya’ni, sizlar ham o‘limtikni halol deb bilsangiz, unda sizlar mushrik bo‘lib qolasizlar.  
Zajjoj roziyallohu anhu aytganlarki: «Bu oyat Alloh harom qilgan narsalardan birontasini halol deb bilgan yoki Alloh halol qilgan narsalardan birontasini harom deb bilgan har bir kimsa mushrik bo‘lishiga dalildir».  
Musulmon odam unutib «basmala»ni («Bismillahir rohmanir rohiym»ni) aytmay so‘ygan jonlig‘i halol hisoblanadi. Chunki mazkur oyatdagi: «Allohning nomi zikr qilinmagan narsalar»ni mufassirlar o‘limtiklar, deb tafsir qilishgan. Bironta mufassir uni musulmon odam «basmala»siz so‘ygan jonivor demagan. Shuningdek, musulmonning «basmala»siz so‘ygan jonlig‘idan yegan kishi itoatsizlik qilgan bo‘lmaydi. Qolaversa, mushriklar bilan «basmala»siz so‘yilgan jonliq xususida emas, o‘limtik xususida tortishganlariga mufassirlar ijmo’ – ittifoq qilishgan.  
Oisha (roziyallohu anho) rivoyat qiladilar: «Bir qavm ahli: «Yo Rasululloh sollallohu alayhi vasallam, bizga bir qabila a’zolari go‘sht olib kelishadi. Unga Allohning ismini zikr qilishganmi, yo‘qmi, bilmaymiz» deyishgan edi, u zot sollallohu alayhi vasallam: «Unga o‘zinglar «bismilloh» denglar-da, yeyaveringlar», dedilar» (Buxoriy va Nasoiy rivoyati).  
Ibn Abbos roziyallohu anhumo aytganlarki: «Kim jonliq so‘ysa-yu, «basmala» aytishni unutsa, unga Allohning ismini zikr qilib yeyaversin. Modomiki, fitrat (sof tabiat) shariatga binoan so‘ygan ekan, uni shaytonga berib qo‘ymasin» (Bayhaqiy rivoyati).  
Asarda kelishicha, «Allohning ismi har bir musulmonning og‘zidadir» («Naylul avtor»).",
     'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Sudxo'rlik"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"SUDXO‘RLIK 
Alloh taolo aytadi:  
«Ey mo‘minlar, (bergan qarzlaringizni) bir necha barobar qilib (olish bilan) sudxo‘rlik qilmangiz! Allohdan qo‘rqingiz! (Shunda) shoyad najot topgaysiz!» (Oli Imron surasi, 130).  
«Sudxo‘r bo‘lgan kimsalar (qiyomat kunida qabrlaridan) turmaydilar, magar jin chalgan majnun kabi turadilar. Bunga sabab ularning: «Bay’ (oldi-sotdi) ham sudxo‘rlikning o‘zi-ku?!» deganlaridir» (Baqara surasi, 275).  
Ya’ni, ular Alloh harom qilgan ish – sudxo‘rlikni halol bildilar. Shu sababli qiyomat qoim bo‘lib, Alloh odamlarni qayta tiriltirgan vaqtda sudxo‘rlardan tashqari barcha odamlar qabrlaridan tezda turib ketadilar.  
Sudxo‘rlar xuddi tutqanog‘i bor odamdek o‘rinlaridan turishlari bilan yiqiladilar. Ularning dunyoda sudxo‘rlik orqali yegan harom narsalarini Alloh qiyomat kunida qorinlarida ko‘paytirib qo‘yadi va bu ularga og‘irlik qiladi. Ular turmoqchi bo‘ladilar-u, biroq yiqilib tushaveradilar.  
Samura ibn Jundub roziyallohu anhudan rivoyat qilinadi: Payg‘ambar sollallohu alayhi vasallam aytdilar: «Kechqurun (tushimda) ikki kishini ko‘rdim. Ular kelib meni muqaddas yerga olib chiqishdi. Yurib-yurib qonli daryoga duch keldik. Daryoda bir kishi bor edi. Sohilda boshqa kishi harsang tosh ushlab turardi. Daryodagi kishi kelib chiqmoqchi bo‘lgan edi, narigi kishi tosh bilan og‘ziga urib kelgan joyiga qaytarib yubordi. U qachon kelib chiqmoqchi bo‘lsa, tosh bilan og‘ziga urar va u yana oldingi joyiga qaytib ketar edi. «Daryodagi kishi kim?» deb so‘ragan edim, «Sudxo‘r», deya javob berishdi» (Buxoriy rivoyati).  
Sudxo‘r o‘lgan vaqtidan to qiyomat kunigacha qonli daryoda suzib, tosh bilan «siylanadi». Bu azob barzax-qabrda bo‘ladi. Bundan tashqari, Rasululloh sollallohu alayhi vasallam sudxo‘rni (foiz yeyuvchini), oldiruvchini, kotibni va guvoh bo‘luvchining hammmasi (gunohda) barobar», deganlar (Muslim rivoyati).",
'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Sudxo'rlik"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Payg‘ambar sollallohu alayhi vasallam aytdilar: «Qaysi qavm orasida zino va sudxo‘rlik avj olsa, ular o‘zlariga Allohning azobini halol qilgan bo‘ladilar» (Abu Ya’lo rivoyati).  
Abdulloh ibn Hanzala roziyallohu anhudan rivoyat qilinadi: Rasululloh sollallohu alayhi vasallam aytdilar: «Kishining bilaturib sudxo‘rlikdan yegan bir dirhami o‘ttiz olti marta zino qilganidan og‘irroqdir» (Imom Ahmad, Tabaroniy rivoyati).  
Baro ibn Ozib roziyallohu anhudan rivoyat qilinadi: Rasululloh sollallohu alayhi vasallam aytdilar: «Sudxo‘rlikning yetmish ikkita turi bo‘lib, ularning eng kichigi kishining onasiga yaqinlik qilishi bilan barobardir. Sudxo‘rlikning eng yaramasi esa, kishining o‘z birodari nomusiga tajovuz qilishidir» (Tabaroniy rivoyati).  
Abdulloh ibn Mas’ud roziyallohu anhu aytgan ekanlarki: «Sudxo‘rlikda yetmish ikkita gunoh bo‘lib, ularning eng kichigi musulmonning o‘z onasiga yaqinlik qilishi bilan barobar. Sudxo‘rlikdan topilgan bir dirham o‘ttizdan ortiq zino qilishdan og‘irroqdir».  
Yana aytgan ekanlar: «Alloh qiyomat kunida yaxshi-yu yomonga turish uchun izn beradi. Sudxo‘rlar esa bundan mustasno. Chunki ular: «jin chalgan – majnun kabi turadilar» (Ibn Abu Dunyo, Bag‘aviy rivoyati).  
Abu Bakr Siddiq roziyallohu anhu aytganlar: «Foiz oluvchi (sudxo‘r) ham, beruvchi ham do‘zaxdadir». Qatoda roziyallohu anhu aytadilar: «Sudxo‘rlar qiyomat kunida jinni holida tiriladilar. Bu ularning alomati bo‘lib, mahshargohdagilar ularni shundan tanib oladilar».  
Xabarlarda vorid bo‘lishicha, sudxo‘rlar o‘z qilmishlarida ishlatgan hiylalari sababli «shanba sohiblari» kabi it va to‘ng‘iz suratida qayta tiriladilar. «Shanba sohiblari» haddan oshgan yahudiy kimsalar bo‘lib, avvaliga Alloh ularni shanba kuni baliq ovlashdan qaytargan edi. Ular hovuzlar qazib, shanba kuni baliqlarni unga qamab olar va keyingi kuni ovlar edilar. Shunday hiyla ishlatib hadlaridan oshganlari sababli Alloh ularni maymun va to‘ng‘izlarga aylantirib qo‘ygan edi.  
Sudxo‘rlar ham o‘zlaricha turli hiylalarni ishlatadilar. Alloh taologa ularning hiylalari maxfiy emas.  
Ayyub Saxtiyoniy aytgan ekanlar: «Ular xuddi yosh bolani aldamoqchi bo‘lgandek, Allohni aldamoqchi bo‘ladilar. Agar ishga ongli ravishda yondoshganlarida edi, o‘zlariga oson bo‘lardi».  
Ibn Mas’ud roziyallohu anhu aytadilar: «Sendan qarzdor kishi biron narsa hadya qilsa, olma. Chunki bu ish sudxo‘rlikdir».  
Hasan roziyallohu anhu aytganlarki: «Agar bir kishi sendan qarzdor bo‘lsa, uning xonadonidan yegan narsalaring senga harom bo‘ladi».  
Ibn Mas’ud roziyallohu anhu yana aytadilar: «Kim bir kishi uchun vositachalik qilsa-yu unga (narigi kishi) hadya bersa, u (hadya) haromdir. Quyidagi hadis gapimni tasdiqlaydi: «Kim bir kishi uchun vositachilik qilsa, buning evaziga unga hadya berishsa va u hadyani qabul qilsa, batahqiq, u sudxo‘rlik eshiklarining kattasiga yaqinlashgan bo‘ladi» (Abu Dovud rivoyati).  
Din, dunyo va oxirat ishlarida Alloh taolodan afv va ofiyat tilaymiz.",
'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Tarozidan urib qolish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"TAROZI, O‘LCHOV VA SHU KABI NARSALARDAN URIB QOLISH 
Alloh taolo aytadi:  
«(O‘lchov va tarozidan) urib qolguvchi kimsalarga halokat bo‘lgay! Ular odamlardan (biron narsani) o‘lchab olgan vaqtlarida to‘la qilib oladigan, ularga o‘lchab yoki tortib bergan vaqtlarida esa kam qilib beradigan kimsalardir» (Mutaffifun surasi, 1-3).  
Ya’ni, ular shunday kimsalarki, agar o‘zlari boshqalardan biron narsa olishsa, to‘liq qilib olishadi, boshqalarga biron narsa sotishsa, urib qolishadi.  
Suddiy roziyallohu anhu aytadilar: «Rasululloh sollallohu alayhi vasallam Madinaga kelgan vaqtlarida u yerda Abu Juhayna ismli kishi bor edi. Uning ikkita «mikyoli» (o‘lchov asbobi) bo‘lib, biri bilan odamlarga o‘lchab berar, ikkinchisi bilan o‘ziga o‘lchab olar edi. Shu bois Alloh mazkur oyatni nozil qildi».  
Rasululloh sollallohu alayhi vasallam aytdilar: «Besh ish besh ishga bog‘liq». «Yo Rasululloh, biri ikkinchisiga bog‘liq bo‘lgan besh ish qaysi?» deb so‘rashdi. «Qaysi qavm ahdini buzsa, Alloh ularga dushmanlarini hukmron qilib qo‘yadi. Alloh nozil etgan narsadan boshqasi bilan hukm qilsa, ularda faqirlik yoyiladi. Fahsh ishlari avj olsa, Alloh ularga o‘lat yuboradi, ya’ni o‘lim ko‘payadi. O‘lchov va tarozidan urib qolsa, nabototlar o‘smay, bir necha yil qurg‘oqchilikka duchor bo‘ladilar. Zakot bermasalar, yomg‘ir yog‘may qo‘yadi», dedilar» (Tabaroniy rivoyati).  
«Ular o‘zlarining ulug‘ bir kunda – barcha odamlar butun olamlar Parvardigori huzurida tik turib (hisob-kitob qilinadigan, o‘rtalarida hukm etiladigan qiyomat) kunida qayta tirilguvchi ekanliklarini o‘ylamaydilarmi?!» (Mutaffifin surasi, 4-6).",
 'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Tarozidan urib qolish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Zajjoj aytganlarki: «Agar o‘ylaganlarida edi, o‘lchov va tarozidan urib qolmagan bo‘lishardi».  
Molik ibn Dinor aytadilar: «Qo‘shnimning oldiga kirdim. U o‘limi yaqinlashib qolgan, qayta-qayta: «Ikkita olovli tog‘, ikkita olovli tog‘», der edi. Undan: «Nima deyapsan?» deb so‘ragan edim, «Ey Abu Yahyo, mening ikkita o‘lchov asbobim bo‘lib, biri bilan o‘zimga o‘lchab olar, ikkinchisi bilan boshqalarga o‘lchab berar edim», dedi. O‘rnimdan turib o‘lchov asbobining biri bilan ikkinchisini ura boshladim. Shunda u: «Ey Abu Yahyo, biri bilan ikkinchisini urganingiz sayin, ish – holatim jiddiylashib, qiyinlashib ketyapti», dedi. U keyinroq shu kasali sababli vafot etdi».  
Birovlarning haqidan urib qolish o‘g‘irlik, xiyonat va harom yeyishning bir ko‘rinishi bo‘lib, bu ishni qilganlarga Alloh «vayl» bilan tahdid soldi. Vayl – shiddatli azob, boshqa bir rivoyatda aytilishicha, jahannamdagi vodiy bo‘lib. Agar unga dunyodagi tog‘lar tushirilsa, harorati yuqoriligi bois toshlarini eritib yuboradi.  
Salaflardan biri aytgan ekan: «Har bir (o‘lchov asbobida) o‘lchovchi va (tarozida) tortuvchi kishining do‘zaxiy ekanligiga guvohlik beraman. Chunki Alloh saqlaganlardan tashqari biron kimsa salomat qolmaydi bundan».  
Solihlardan yana biri aytadi: «Bir bemorni ko‘rgani bordim. O‘limi yaqinlashib, o‘zini bilmay yotgan ekan. Unga har qancha «Shahodat» kalimasini talqin qilsam ham, tili hech aylanmasdi. O‘ziga kelgach: «Birodar, shahodatni shuncha talqin qilsam ham, tilingiz sira aylanmadi-ya. Tinchlikmi o‘zi?» deb so‘ragan edim, «Tarozining tili (pallasi) tilimni bosib, gapirtirmay qo‘ydi», dedi. «Nima, tarozidan urib qolarmidingiz?» deya so‘ragan edim, «Yo‘q, Allohga qasamki, unday emas. Biroq vaqtida tarozimning to‘g‘riligini tekshirib turmas edim», deb javob berdi».  
Tarozining to‘g‘riligiga e’tibor bermagan kishining holi shu bo‘lsa, urib qoladiganlarning ahvoli qanday bo‘lar ekan?!  
Nofi’ roziyallohu anhu aytadilar: «Ibn Umar roziyallohu anhumo sotuvchining oldidan o‘taturib: «Allohdan qo‘rq, o‘lchov va tarozini to‘g‘ri qil. Chunki urib qoluvchilar terlari to quloqlarining yarmigacha ko‘mib yubormagunicha to‘xtatib turiladilar», dedilar.  
Salaflardan biri aytgan ekan: «Kam qilib bergan bitta doni sababli kengligi osmonlaru yercha keladigan jannatni sotib yuborgan kimsaga vayl bo‘lsin. Ortiqcha olgan bitta doni sababli vaylni sotib olgan kimsaning holiga voy bo‘lsin».  
Alloh taolodan afv va barcha baloyu ofatlardan ofiyat tilaymiz. Albatta, U saxovatli, marhamatli zotdir.",
'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Qo'shniga ozor berish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"QO‘SHNIGA OZOR BERISH 
Rasululloh sollallohu alayhi vasallam: «Allohga qasamki, mo‘min emas. Allohga qasamki, mo‘min emas. Allohga qasamki, mo‘min emas», dedilar. «Kim, yo Rasululloh?» deb so‘rashgan edi, «Yomonligidan qo‘shnisi xotirjam bo‘lmagan kimsa», deya javob berdilar (Muttafaqun alayh).  
Imom Muslim rivoyat qilgan hadisda: «Yomonligidan qo‘shnisi emin bo‘lmagan kimsa jannatga kirmaydi», deyilgan.  
Rasululloh sollallohu alayhi vasallamdan: «Alloh nazdidagi eng ulkan gunoh qaysi?» deb so‘rashgan edi, u zot uchta gunohni zikr qilib: «Allohga boshqa narsani sherik qilishing. Holbuki, U seni yaratgan; ovqatingga sherik bo‘lishidan qo‘rqib farzandingni o‘ldirishing va qo‘shningning jufti haloli bilan zino qilishing», deya javob berdilar (Muttafaqun alayh).  
Sahih hadisda aytiladiki: «Kimki Allohga va oxirat kuniga iymon keltirgan ekan, qo‘shnisiga ozor bermasin» (Muttafaqun alayh).  
Qo‘shni uch toifa bo‘ladi: Musulmon, kofir, qarindosh qo‘shni.  
Musulmon qo‘shnining qo‘shnilik va musulmonlik haqlari bor.",
'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Qo'shniga ozor berish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Kofir qo‘shnining qo‘shnilik haqi bor.  
Qarindosh qo‘shni – uning qarindoshlik, qo‘shnilik haqlari (agar musulmon bo‘lsa, musulmonlik haqi ham) bor.  
Ibn Umarning bir yahudiy qo‘shnisi bor edi. Agar jonliq so‘ysalar: «Yahudiy qo‘shnimizga undan olib chiqib beringlar», der edilar.  
Rivoyat qilinishicha, qiyomat kunida kambag‘al qo‘shni boy qo‘shnisiga osilib oladi va: «Ey Rabbim, mana bundan so‘ra-chi, nima uchun eshigini qulflab, mendan fazlini to‘sdi ekan», deydi.  
Kishi qo‘shnisining ozor-aziyatlariga bardoshli, toqatli bo‘lishi lozim. Bu ish qo‘shniga yaxshilik qilish jumlasidan sanaladi.  
Bir kishi Rasululloh sollallohu alayhi vasallam huzurlariga kelib: «Yo Rasululloh, menga jannatga doxil etadigan amalni o‘rgating», degan edi, «Muhsin (yaxshilik qiluvchi) bo‘l», dedilar. «Muhsinligimni qanday bilaman?» deb so‘ragan edi, u zot sollallohu alayhi vasallam: «Qo‘shnilaringdan so‘ra, agar seni muhsin deyishsa, demak, muhsinsan. 
Bordi-yu seni yomon deyishsa, demak yomonsan», dedilar (Bayhaqiy rivoyati).  
Rivoyat qilinishicha, kimdan-kim ahli (oila a’zolari) va mol-mulkidan qo‘rqib, qo‘shnisidan eshigini bekitsa, u mo‘min emas. Shuningdek, yomonligidan qo‘shnisi emin bo‘lmagan kishi ham mo‘min emas.  
Miqdod ibn Asvad roziyallohu anhu rivoyat qiladilar: «Rasululloh sollallohu alayhi vasallam sahobalaridan: «Zino haqida nima deysizlar?» deb so‘ragan edilar, ular: «U harom ish. Uni Alloh va rasuli harom qilgan bo‘lib, u qiyomat kunigacha haromdir», deya javob berishdi. Shunda Rasululloh sollallohu alayhi vasallam: «Kishining o‘nta ayol bilan zino qilishi qo‘shnisining xotini bilan zino qilishidan yengilroq», dedilar-da yana so‘radilar: «O‘g‘irlik haqida nima deysizlar?» «Alloh va Uning rasuli uni harom qilgandir. U harom ish», deya javob berishdi. U zot sollallohu alayhi vasallam: «Kishining o‘nta uydan o‘g‘rilik qilishi qo‘shnisining uyidan o‘g‘irlik qilishidan yengilroq», dedilar (Imom Ahmad rivoyati).  
Abu Hurayra roziyallohu anhu aytadilar: «Bir kishi Rasululloh sollallohu alayhi vasallamning oldilariga kelib, qo‘shnisidan shikoyat qildi. U zot sollallohu alayhi vasallam: «Bor, sabr qil», dedilar. Haligi kishi yana ikki yo uch marta keldi. Payg‘ambar sollallohu alayhi vasallam oxiri: «Bor, matohlaringni ko‘chaga uloqtirib tashla», deb maslahat berdilar. So‘ng u kishi shunday qildi. Ko‘chadan o‘tayotgan kishilar undan nima uchun bunday qilganini so‘rashar, u esa qo‘shnisi haqida so‘zlab berar edi. Ular bu javobni eshitib, qo‘shnisini la’natlashar, ayrimlari duoibad qilishardi. Shunda qo‘shnisi kelib, unga: «Uyingga qaytaqol, bundan keyin sira mendan yomonlik ko‘rmaysan», dedi» (Abu Dovud, Ibn Hibbon, Hokim rivoyati).     Qo‘shni garchi zimmiy bo‘lsa ham, undan yetadigan ozoru aziyatlarga sabr qilish lozim.  
Rivoyat qilishlaricha, Sahl ibn Ubaydulloh Tustariyning zimmiy qo‘shnisi bo‘lib, uning hojatxonasidan Sahlning uyiga iflos-nopok narsalar sizib chiqar edi. Sahl har kuni uning tagiga bir idish qo‘yib qo‘yar, majusiyning hojatxonasidan chiqqan narsalar idishga to‘planar va kechqurun hech kim ko‘rmaydigan joyga olib borib tashlanar edilar. Sahl hazratlari uzoq muddat shu taxlit ish yuritdilar. Vafotlari yaqinlashgach, majusiy qo‘shnisini chorlab: «Mana bu uyga kirib, bu yerda nima borligini ko‘rib qo‘y», dedilar. U kirib idishga tushayotgan iflos, nopok narsalarni ko‘rdi va: «Bu nima?» deb so‘radi. «Bu uzoq muddatdan beri hovlingdan mana shu uyga tushadi. Uni kunduzlari shu idishga to‘plab, kechalari olib chiqarib tashlar edim. Mabodo, ajalim yaqinlashib qolmaganida, buni senga aytmas edim. Boshqa biron kishining xulqi buni o‘ziga singdira olmasligidan qo‘rqdim. Endi xohlaganingni qil», dedilar. Shunda majusiy: «Ey shayx, men kofir bo‘lsam ham, uzoq vaqtdan beri menga shunday go‘zal munosabatda bo‘lib kelayotgan edingizmi?! Qo‘lingizni bering, men Allohdan o‘zga iloh yo‘q va Muhammad Allohning elchisi ekaniga guvohlik beraman», deb musulmon bo‘ldi. Sahl roziyallohu anhu shundan so‘ng vafot etdilar.  
Alloh taolodan barchamizni xulqlarning, amallarning va so‘zlarning eng go‘zallariga yo‘llamog‘ini tilaymiz. Albatta, U saxovatli, mehribon va rahmli zotdir.",
'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Chaqimchilik"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"CHAQIMCHILIK
Alloh taolo buyuradi:  
«(Ey Muhammad), yana siz har bir tuban qasamxo‘r, g‘iybatchi-yu, gap tashuvchi (chaqimchi) kimsaga itoat etmang!» (Qalam surasi, 10–11).  
Rasululloh sollallohu alayhi vasallam aytganlar: «Chaqimchi jannatga kirmaydi» (Muttafaqun alayh). 
Yana bir hadisda aytilishicha, Rasululloh sollallohu alayhi vasallam ikki qabr yonidan o‘taturib: «Bu ikkisi (ya’ni, qabrdagi mayyitlar) azoblanmoqda. Biroq katta narsa sababli azoblanayotganlari yo‘q. Ulardan biri siydigidan saqlanmas edi. Ikkinchisi chaqimchilik qilib, gap tashib yurardi», dedilar. So‘ng ho‘l novdani olib, ikkiga bo‘ldilar va har bir qabrga bittadan bo‘lakni sanchib qo‘ydilar. «Ey Rasululloh, nima uchun bunday qildingiz?» deb so‘rashganida, u zot sollallohu alayhi vasallam: «Shoyad bu novdalar qurigunicha, ulardan azob yengillatib turilsa», deya javob berdilar. (Muttafaqun alayh).  
«Biroq katta narsa sababli azoblanayotganlari yo‘q» jumlasini qo‘yidagicha tushunish mumkin: bu ishlarni tark etish ular uchun juda qiyin emas edi yoki ularning nazarida juda qiyin emas edi. Shuning uchun boshqa bir rivoyatda: «Yo‘q, u katta gunohdir», deyilgan.  
Abu Hurayra roziyallohu anhudan rivoyat qilinadi: Rasululloh sollallohu alayhi vasallam aytdilar: «Eng yomon insonlar – ularga bu yuzi bilan, bularga bu yuzi bilan boradigan ikki yuzlamachi kimsalar ekanini ko‘rasizlar» (Muttafaqun alayh).  
Rasululloh sollallohu alayhi vasallam aytdilar: «Kimning bu dunyoda ikkita yuzi bo‘lsa, qiyomat kunida uning olovdan ikkita tili bo‘ladi» (Abu Dovud rivoyati).  
Rivoyat qilishlaricha, kim ikkita tilli bo‘lsa, Alloh qiyomat kunida unga olovdan ikkita til qilib beradi. «Ikkita tilli» degani, bir toifa odamlar bilan o‘zgacha, boshqa toifa odamlar bilan o‘zgacha gaplashadigan deganidir",
 'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Chaqimchilik"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Imom Abu Homid Fazzoliy aytganlarki: «Odatda, birovning gapini ikkinchi kishiga: «Falonchi sen haqingda bundoq dedi», deya yetkazuvchi kimsaga «chaqimchi» deyiladi. Biroq chaqimchilik shuning o‘zi bilangina cheklanib qolmaydi. Chaqimchilik – ochilishi karih – sanalgan narsani ochishdir. Yomon ko‘ruvchi kim bo‘lishining farqi yo‘q: gapiruvchimi, gapiriluvchimi yoki gaplashuvchimi. U yoqimsiz narsa nima bilan kashf qilinishi ham farqsizdir: so‘z bilanmi, yozuv bilanmi, ishora bilanmi va hokazo. Chaqimchilik qilingan – tashilgan narsa so‘z bo‘ladimi yoki amal bo‘ladimi, ayb yoki boshqasi bo‘ladimi, barchasi barobardir».  
Chaqimchilikning mohiyati sirni fosh qilish va kashf qilinishi karih sanalgan narsani e’lon qilishdir. Inson boshqa insonlardan ko‘rgan har qanday narsasi haqida gapirishdan tilini tiyishi lozim. Gapirsa, musulmonlarga foydali yoki ma’siyatni daf qiladigan narsalarni aytishi mumkin.  
Kimga birov gap tashib kelib: «Falonchi sen haqingda bundoq dedi», desa, u kishi quyidagi oltita ishni qilishi lozim: 1. Uni tasdiqlamaslik lozim. Chunki u chaqimchi, fosiq bo‘lib, uning gapi e’tiborga olinmaydi. 2. Uni bu ishdan qaytarib, nasihat qilishi va bu ishni qoralashi lozim. 3. Uni Alloh uchun yomon ko‘rishi lozim. Zero, u Allohning huzurida manfur bo‘lib, uni Alloh uchun yomon ko‘rish vojibdir. 4. Gapirilayotgan kishi haqida yomon gumonga bormasligi lozim. Zero, Qur’oni karimda: «Ey mo‘minlar, ko‘p gumon(lar)dan chetlaninglar! Chunki ayrim gumon(lar) gunohdir!» deyilgan (Hujurot surasi, 12). 5. Eshitgan gapi uni josuslik qilishga va gapning tagiga yetish uchun harakat qilishga undamasligi lozim. Chunki yuqoridagi oyatning davomida: «(O‘zgalarning ayblari ortidan) josuslik qilib yurmanglar», deyilgan. 6. Chaqimchi keltirgan gaplarni boshqalarga yetkazmasligi darkor.  
Bir kishi Umar ibn Abdulaziz roziyallohu anhuga bir odam haqida nimadir dedi. Umar unga: «Ey sen, agar xohlasang, gapingni tekshirib ko‘ramiz: bordi-yu yolg‘on gapirgan bo‘lsang, unda sen: «Agar sizlarga bir fosiq kimsa biron yomon xabar keltirsa, (u xabarni) aniqlab, tekshirib ko‘ringlar», degan oyatdagi fosiqlardan bo‘lasan. Agar rost gapirgan bo‘lsang, unda sen «g‘iybatchi-yu, gap tashuvchi» kimsalardan bo‘lasan. Xohlasang, afv qilamiz», dedi. Shunda haligi kishi: «Afu aylang, ey Amiral mo‘minin. Endi sira bu ishga qaytmayman», dedi.  
Bir kishi Sohib ibn Ubbodga yetim molini olishga undovchi varaqa ko‘tarib keldi. Holbuki, uning mol-mulki ko‘p edi. U zot varaqaning orqa tomoniga: «Chaqimchilik garchi rost bo‘lsa ham qabih amaldir. Mayyitni Alloh rahmat qilsin, yetimni o‘nglasin, mol Allohning in’omi, unga ko‘z olaytiruvchini Alloh la’natlasin», deb yozdi.  
Hasan Basriy hazratlari aytganlarki: «Kim senga bir gapni yetkazsa, bilginki, u sening gapingni ham boshqalarga yetkazadi». «Kim senga gap tashisa, sening gapingni boshqaga tashiydi», degan jumla odamlar orasida keng yoyilgan.  
Ibn Muborak rahimahulloh: «Haromi (zinodan bo‘lgan) bola gap yashirmaydi», deb chaqimchilik qiladigan har bir inson haromi bo‘lishi mumkinligiga quyidagi oyatni dalil qilganlar: «Qo‘pol va bulardan tashqari benasab – haromi kimsaga itoat etmang!» (Qalam surasi, 13).",
 'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Chaqimchilik"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Rivoyat qilishlaricha, salafi solihinlardan biri birodarini ziyorat qilganida, birodari u zotga boshqa birodari haqida yomon gaplarni gapiribdi. Shunda u zot: «Ey birodar, g‘iybatni juda cho‘zib yubordingiz va uchta jinoyat sodir etdingiz: menga birodarimni yomon ko‘rsatib qo‘ydingiz, u bilan qalbimni mashg‘ul qildingiz va o‘zingizga bo‘lgan ishonchdan mahrum qildingiz», degan ekan.  
Bir kishi Ali ibn Husayn roziyallohu anhmoga: «Falonchi sizni haqorat qildi va siz haqingizda bundoq, bundoq dedi», degan ekan, u zot: «Meni uning oldiga olib bor», debdilar. U o‘zini himoya qilsa kerak, deb o‘ylabdi. Haqorat qilgan kishining oldiga yetib borishgach, u zot: «Ey birodar, agar men haqimda gapirgan gaping haq bo‘lsa, Alloh meni mag‘firat qilsin. Bordi-yu men haqimda gapirgan gaping noto‘g‘ri bo‘lsa, Alloh seni mag‘firat qilsin», degan ekanlar.  
Abu Lahabning xotini chaqimchilik qilib, gap tashib yurgani uchun Qur’oni karimda «o‘tin orqalagan», deb vasf qilingan. Chaqimchilik adovatga sabab bo‘lgani bois «o‘tin», deb nomlangan. Ma’lumki, o‘tin olovning alangalanishiga sabab bo‘ladi.  
Aytishlaricha, chaqimchining ishi shaytonning ishidan ham zararliroqdir. Chunki shaytonning amali vasvasa bilan bo‘lsa, chaqimchining amali bevosita bo‘ladi.     
Hikoyat  
Rivoyat qilishlaricha, bir kishi sotilayotgan bir qulni ko‘rib qoldi. Egasi: «Uning chaqimchilikdan boshqa aybi yo‘q», deb jar solar edi. Kishi g‘ulomning aybini pisand qilmadi va uni sotib oldi. Fulom xo‘jayinining uyida bir necha kun turganidan keyin uning xotiniga: «Xojam sizning ustingizga boshqa xotin olmoqchi yoki o‘ynash tutmoqchi. U sizni yaxshi ko‘rmaydi. Agar sizga mehri tushib, o‘ylagan niyatidan qaytishini istasangiz, unda xojam uxlagan paytida ustarani olib, soqolining tagidan bir necha tukni qirib olingda, ularni asrab qo‘ying», dedi. Xotin parishon holda: «Xo‘p», dedi va eri uxlagach, quli o‘rgatgan ishni qilishga jazm etdi. Keyin g‘ulom xo‘jayinining oldiga kelib: «Xojam, bekam o‘ziga o‘ynash tutib, unga juda o‘rganib qolgan. Shuning uchun sizdan xalos bo‘lmoqchi, bu kecha sizni so‘yishga jazm qilgan. Agar gapimga ishonmasangiz, unda kechqurun o‘zingizni uxlaganga solib yoting. Shunda sizni so‘yish uchun qo‘lida biron narsa ko‘tarib kelayotganini ko‘rasiz», dedi. Xo‘jayini unga ishondi. Qorong‘u tushgach, o‘zini uxlaganga solib yotdi. Xotini uning soqoli ostidagi tuklardan qirqib olish uchun ustara ko‘tarib keldi. Soqolidan qirqib olmoqchi bo‘lib, engashgan kuyi qo‘lini erining tomog‘iga cho‘zgan edi, u sakrab turib, ustarani tortib oldi-da, xotinini so‘yib tashladi. Xotinining qarindoshlari bu voqeadan xabar topib, u kishini o‘ldirdi va ikki urug‘ orasida qirg‘in boshlanib ketdi. Birgina chaqimchi, yolg‘onchi qulning kasofati bilan shunday falokat ro‘y berdi.  
Shu bois Alloh taolo chaqimchini «fosiq» deb nomlagan: «Ey mo‘minlar, agar sizlarga bir fosiq kimsa biron xabar keltirsa, sizlar (haqiqiy ahvolni) bilmagan holingizda biron qavmga musibat yetkazib qo‘yib, qilgan ishlaringizga afsus-nadomat chekib qolmasliklaringiz uchun (u fosiq kimsa olib kelgan xabarni) aniqlab-tekshirib ko‘ringlar!» (Hujurot surasi, 6).",
'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Tahlil qilish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"TAHLIL QILISH 
Tahlil – uchtaloq qilgan kishiga xotinini halollab berish maqsadida, uning xotinini nikohiga olib, so‘ng taloq qilish.  
Ibn Mas’ud roziyallohu anhu aytganlar: «Rasululloh sollallohu alayhi vasallam halol qiluvchini ham, halol qildiruvchini ham la’natladilar» (Termiziy rivoyati).  
Imom Termiziy aytadilar: «Ahli ilm nazdida ushbu hadisga amal qilinadi. Umar ibn Xattob, Usmon ibn Affon, Abdulloh ibn Umarlar shular jumlasidandir. Shuningdek, fuqaho tobe’inlar ham shu so‘zni aytganlar».  
Uqba ibn Omir roziyallohu anhu rivoyat qiladilar: «Rasululloh sollallohu alayhi vasallam: «Sizlarga ahmoq ijarachi haqida xabar beraymi?» deb so‘ragan edilar. «Ha, yo Rasululloh» deyishdi. U zot sollallohu alayhi vasallam: «U halol qiluvchidir. Alloh halol qiluvchini ham, halol qildiruvchini ham la’natlagan», dedilar (Ibn Moja rivoyati).  
Ibn Abbos roziyallohu anhumo aytadilar: «Rasululloh sollallohu alayhi vasallamdan halol qiluvchi haqida so‘rashdi. U zot: «Yo‘q, faqat rag‘bat-xohish bilan qilingan nikoh joiz. Aldov-hiyla nikohi joiz emas. Alloh azza va jallaning kitobini istehzo qilish mumkin emas. Toki asaldonidan totib ko‘rsin», dedilar (Abu Ishoq Juzjoniy rivoyati).  
Bir kishi Ibn Umardan: «Bir kishi xotinini uchtaloq qildi. Bir birodari u bilan maslahatlashmasdan, halollab berish maqsadida uning xotiniga uylandi. Endi birinchisiga halol bo‘ladimi?» deb so‘ragan edi, u: «Yo‘q. Faqat rag‘bat-xohish bilan qilingan nikoh joiz. Biz Rasululloh sollallohu alayhi vasallam davrida bu ishni fohishabozlik deb hisoblardik», dedilar (Hokim rivoyati).",
'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Tahlil qilish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Asram va Ibn Munzirlar rivoyat qilishlaricha, Umar ibn Xattob roziyallohu anhu: «Halol qiluvchi va halol qildiruvchini huzurimga olib kelishsa, ikkalasini ham toshbo‘ron qilgan bo‘lardim», deganlar.  
Umar ibn Xattob roziyallohu anhudan ayolni eriga halollab berish haqida so‘rashganida: «Bu ish fohishabozlik», deb javob berganlar.  
Abdulloh ibn Sharik Omiriy aytadilar: «Ibn Umar roziyallohu anhumodan: «Bir kishi amakisining qizini (ya’ni, xotinini) taloq qilib, so‘ng afsuslanib, xotiniga rag‘bat bildirdi. Boshqa birov u kishiga halollab berish uchun unga uylanmoqchi. Shu ish mumkinmi? deb so‘rashgan edi, u zot: «Agar u halollab bermoqchi ekanini bilsa, garchi yigirma yil yoki shunga yaqin muddat yashasa-da, ikkalasi ham zinokordir», deya javob berdilar.  
Bir kishi Ibn Abbos roziyallohu anhumoga: «Amakimning o‘g‘li xotinini uchtaloq qilib, endi afsuslanib o‘tiribdi», degan edi, u zot: «Amakingni o‘g‘li Rabbiga osiylik qilgan edi, Rabbi uni nadomat chektirib qo‘ydi. Shaytonga itoat qilgan edi, shayton unga (bu mushkul holatdan) chiqar yo‘lni paydo qilmadi», dedi. «Birontasi unga xotinini nikohlab bersa bo‘lmaydimi?» deb so‘ragan edi, «Kim Allohni aldamoqchi bo‘lsa, o‘zini aldab qo‘yadi», deya javob berdilar.     Ibrohim Naxa’iy aytganlar: «Birinchi er va yoki ikkinchi er va yo ayol – uchovidan birontasining niyati halollab berish bo‘lsa, ikkinchisining nikohi botil bo‘ladi va birinchisiga halol bo‘lmaydi».  
Hasan Basriy: «Agar uchovidan birontasi halollashni istasa, (nikohni) fosid qilgan – buzgan bo‘ladi», deganlar.  
Tobe’inlarning imomi Said ibn Musayyab: «Avvalgi eriga halollab berish maqsadida biron xotinga uylangan kishining nikohi halol emas», deganlar.  
Molik ibn Anas, Lays ibn Said, Sufyon Savriy, Imom Ahmadlar ham shu gapni aytganlar.  
Ismoil ibn Said aytadi: «Imom Ahmaddan: «Bir kishi ayolga avvalgi eriga halol qilib berish maqsadida uylanmoqchi. Biroq ayol bundan bexabar. Shu ish joizmi?» deb so‘ragan edim, u zot: «U halol qiluvchidir. Agar bu bilan halollab berishni xohlar ekan, u mal’undir», dedilar».  
Imom Shofe’iy mazhablariga binoan, agar nikoh vaqtida halollab berish shart qilinsa, nikoh botil bo‘ladi. 
Alloh taolodan bizlarni O‘zi rozi bo‘lgan ishlarga muvaffaq aylashini, gunoh ishlardan yiroq qilishini so‘raymiz. Albatta, U saxovatli, marhamatli, mag‘firatli va rahmli zotdir.",
'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Ota onaga oq bolish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"OTA-ONAGA OQ BO‘LISH 
Alloh taolo aytadi: «(Ey inson), Parvardigoring sizlarga yolg‘iz Uning o‘ziga ibodat qilishlaringizni hamda ota-onaga yaxshilik qilishlaringizni amr etdi. Agar u ikkovidan biri yoki har ikkisi sening qo‘l ostingda keksalik yoshiga yetsalar, ularga qarab «uf» tortma va ularning (so‘zlarini) qaytarma! Ularga (doimo) yaxshi so‘z ayt! Ular uchun mehribonlik bilan, xorlik qanotini past tut – xokisor bo‘l va: «Parvardigorim, meni (ular) go‘daklik chog‘imdan tarbiyalab-o‘stirganlaridek, Sen ham ularga rahm-shafqat qilgin», deb (haqlariga duo qil)!» (Al-Isro surasi, 23–24).  
Farzand hamisha ota-ona xizmatiga tayyor turishi lozim. Chunki ular farzandining xizmatini qoyillatib qilishgan. Shuningdek, ular farzand kamoli, unib-o‘sishi – hayotini umid qilib uning qiliqlariyu ozorlarini ko‘tarishgan. Farzand esa, garchi ular ozoriga sabr qilsa ham, bu ularning o‘limigacha davom etadi, xalos. Qay birining haqi-xizmati ulug‘ ekaniga o‘zingiz baho bering.  
«(Biz insonga buyurdikki): «Sen Menga va ota-onangga shukr qilgin! Yolg‘iz o‘zimga qaytajaksan!» (Luqmon surasi, 14).  
Ibn Abbos roziyallohu anhumo aytganlar: «Uch oyat uch narsaga bog‘liq bo‘lib tushgan. Ularning biri sherigisiz qabul qilinmaydi.  
Birinchisi: «Ey mo‘minlar, Allohga itoat etingiz va Payg‘ambarga itoat etingiz!» (Muhammad surasi, 33). Kimki Allohga itoat etsa-yu, Rasululloh sollallohu alayhi vasallamga itoat etmasa, bu qabul qilinmaydi.  
Ikkinchisi: «Namozni ado qilinglar va zakotni beringlar!» (Baqara surasi, 43). Kimki namoz o‘qisa-yu, zakot bermasa, qabul qilinmaydi.  
Uchinchisi: «Sen Menga va ota-onangga shukr qil!» (Luqmon surasi, 14). Kimki Allohga shukr qilsa-yu, ota-onasiga shukr qilmasa, qabul qilinmaydi».  
Shuning uchun ham Payg‘ambar sollallohu alayhi vasallam: «Parvardigor roziligi ota roziligida. Parvardigor noroziligi ota noroziligida (Ota rozi – Xudo rozi, ota norozi – Xudo norozi)», deganlar (Hokim rivoyati).  
Abdulloh ibn Amr roziyallohu anhu aytadilar: «Bir kishi Payg‘ambar sollallohu alayhi vasallam huzurlariga kelib jihodga borishga izn so‘radi. U zot sollallohu alayhi vasallam: «Ota-onang hayotmi?» deb so‘radilar. U: «Ha», degan edi, «Ular yo‘lida jihod qilgin», dedilar» (Muttafaqun alayh).  
Payg‘ambar sollallohu alayhi vasallam ota-onaga yaxshilik qilishni, xizmatlariga shay turishni jihoddan ustun qo‘yganlariga bir e’tibor bering.",
'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Ota onaga oq bolish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Rasululloh sollallohu alayhi vasallam: «Sizlarga gunohi kabiralarning eng kattalari haqida xabar beraymi? (Ular) Allohga shirk keltirish va ota-onaga oq bo‘lish», dedilar (Muttafaqun alayh).  
Ota-onaga yomon munosabatda bo‘lish, ularga yaxshilik qilmaslikni shirkdek eng ulkan gunoh bilan yonma-yon zikr qilganlariga ham bir e’tibor bering.  
Rasululloh sollallohu alayhi vasallam: «Uch toifa odamga Alloh qiyomat kunida qaramaydi: ota-onasiga oq bo‘lgan kimsaga; mast qiluvchi narsaga mukkasidan ketgan kimsaga va bergan narsasini minnat qiluvchi kimsaga», dedilar (Nasoiy rivoyati).  
Rasululloh sollallohu alayhi vasallam: «Alloh ota-onasiga oq bo‘lgan kimsani la’natladi», dedilar (Hokim rivoyati).  
Rasululloh sollallohu alayhi vasallam: «Kishining o‘z ota-onasini so‘kishi gunohi kabiralardandir», dedilar. «Yo Rasululloh, inson o‘z ota-onasini ham so‘kadimi?» deb so‘rashgan edi, «Ha, – dedilar. – Boshqa kishining otasini so‘kkanda, u buning otasini so‘kadi. Onasini so‘kkanda esa, buning onasini so‘kadi» (Muttafaqun alayh).  
Muhtoj bo‘lib qolgan ota-onaga infoq-ehson qilish ham ularga yaxshilik qilish jumlasidandir.  
Jobir ibn Abdulloh roziyallohu anhu aytadilar: «Bir kishi: «Yo Rasululloh, mening molmulkim va bolalarim bor. Otam esa mol-mulkimni olib qo‘ymoqchi», degan edi, u zot: «O‘zing ham, moling ham otangnikidir», dedilar» (Ibn Moja rivoyati).  
Bir kishi Abu Dardo roziyallohu anhuning huzuriga kelib: «Ey Abu Dardo, men bir ayolga uylandim. Biroq onam uni taloq qilishimni buyurdi», degan edi, Abu Dardo: «Rasululloh sollallohu alayhi vasallamning: «Ota-ona jannatning eng o‘rta eshigidir», deganlarini eshitganman. Xohlasang shu eshikni buzib tashla, xohlasang saqlab qol», dedilar (Termiziy, Hokim rivoyati).  
Amr ibn Murra Juhaniy roziyallohu anhu dedilar: «Bir kishi Payg‘ambar sollallohu alayhi vasallam huzurlariga kelib: «Yo Rasululloh, Allohdan o‘zga iloh yo‘q va siz shubhasiz, Allohning elchisidirsiz, deb guvohlik berdim, besh vaqt namozni o‘qidim, molimning zakotini berdim va ramazonda ro‘za tutdim. Menga nima (qanday mukofot) beriladi?» deb so‘ragan edi, Payg‘ambar sollallohu alayhi vasallam: «Kim mana shu holatda vafot etsa, qiyomat kunida payg‘ambarlar, siddiqlar va shahidlar bilan mana shunday birga bo‘ladi», deb ikki barmog‘ini tikladilar va: «Modomiki, ota-onasiniga oq bo‘lmas ekan», deb qo‘shib qo‘ydilar» (Ahmad, Tabaroniy rivoyati).  
Rasululloh sollallohu alayhi vasallam aytdilar: «Uch xil duoning ijobat bo‘lishida shakshubha yo‘q, (ular): mazlumning duosi, musofirning duosi va ota-onaning farzandi haqqiga qilgan duosi» (Termiziy rivoyati).  
Rivoyat qilinishicha, Alloh gunohlardan xohlaganini qiyomat kuniga olib qo‘yadi. Biroq ota-onasiga oq bo‘lish bundan mustasno. Alloh ota-onasiga oq bo‘lgan odamni o‘lmasidan oldin shu dunyoning o‘zida jazolaydi.  
Ibn Abbos roziyallohu anhumodan: «A’rof nima? U yerda kimlar bo‘ladi?» deb so‘rashdi. U zot: «A’rof jannat bilan do‘zax orasidagi tog‘ bo‘lib, jannat va do‘zaxdan balandroq bo‘lgani bois «a’rof» (tepalik) deb nomlangan. U yerda daraxtlar, mevalar, anhorlar va buloqlar bor. A’rofda ota-onalarining roziligisiz jihodga chiqib, jihodda o‘ldirilgan kishilar bo‘ladi. Alloh yo‘lida qatl qilinganlari ularni do‘zaxga tushishidan to‘ssa, ota-onalariga oq bo‘lganlari ularni jannatga kirishdan man qilib turadi. Alloh ular xususida hukmini chiqarmaguncha, ular A’rofda bo‘lurlar», dedilar.  
Ka’bul Ahbor rahmatullohi alayh aytadilar: «Banda ota-onasiga oq bo‘lsa, Alloh tezroq azob berish uchun uni tezda halok etadi. Banda agar ota-onasiga mehribon bo‘lsa, yanada ko‘proq yaxshilik va mehribonlik qilishi uchun Alloh bu bandaning umrini uzun qilib qo‘yadi».  
Vahb ibn Munabbah aytadilar: «Alloh taolo Muso alayhissalomga: «Ey Muso, ota-onangni ehtirom qil. Zero, kim ota-onasini ehtirom etsa, uning umrini ziyoda qilaman va o‘zini ham hurmat qiladigan farzand beraman. Kimki ota-onasiga oq bo‘lsa, uning umrini qisqa qilaman va o‘ziga ham itoatsizlik qiladigan farzand beraman», deb vahiy qildi.",
 'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Ota onaga oq bolish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Abu Bakr ibn Abu Maryam aytadilar: «Tavrotda: «Kimki otasini ursa, o‘ldiriladi», deyilganini o‘qidim». Vahb aytadi: «Tavrotda: «Kimki ota-onasiga qo‘l ko‘tarsa, toshbo‘ron qilinadi», deyilganini o‘qidim».  
Rivoyat qilinishicha, kimki ota-onasini haqorat qilsa, (dafn qilinganidan) so‘ng uning qabriga, osmondan yerga tushadigan har bir tomchi miqdoricha qizib turgan cho‘g‘ tushadi.  
Rivoyat qilinadiki, ota-onasiga oq bo‘lgan kimsa dafn qilinsa, qabri uni qattiq siqadi. Hattoki, uning qovurg‘alari bir-biriga kirib ketadi. Qiyomat kunida eng qattiq g‘azabga giriftor bo‘ladigan insonlar uch toifa bo‘lib, ular mushrik, zinokor va ota-onasiga oq bo‘lgan kimsadir.  
Ka’bul Ahbordan: «Ota-onaga oq bo‘lish nima?» deb so‘rashgan edi, u kishi: «Agar otasi yoki onasi uning nomidan qasam ichsa, qasamini oqlamaydi. Biror ishga buyursa, buyrug‘iga itoat etmaydi. Biror narsa so‘rasa, bermaydi va omonat qo‘ysa, xiyonat qiladi», deb javob berdilar.  
Onaning fazilati  
Abu Hurayra roziyallohu anhu aytadilar: «Bir kishi Rasululloh sollallohu alayhi vasallam huzurlariga kelib: «Yo Rasululloh, go‘zal muomala-munosatbatda bo‘lishimga eng haqdor inson kim?» deb so‘ragan edi, u zot: «Onang», deb javob berdilar. «Keyin-chi?» degan edi, yana: «Onang», dedilar. «Keyin-chi?» degan edi, yana bir bor: «Onang», dedilar. «Keyin-chi?» degan edi, «Otang» dedilar» (Muttafaqun alayh).  
Payg‘ambar sollallohu alayhi vasallam onaga yaxshilik qilishga uch bora buyurib, keyin otaga yaxshilik qilishga irshod etdilar. Chunki farzand o‘stirishda ona ko‘proq qiyinchilikni boshidan o‘tkazadi va otaga qaraganda mehribonroq bo‘ladi.  
Muoviya ibn Johima aytadilar: «(Otam) Johima Payg‘ambar sollallohu alayhi vasallam huzurlariga kelib: «Men g‘azot qilmoqchiman, sizdan maslahat so‘ragani keluvdim», degan edi, u zot sollallohu alayhi vasallam «Onang hayotmi?» deb so‘radilar. U: «Ha», dedi. «Borib onangni lozim tut (mudom xizmatida bo‘l). Zero, jannat onang oyog‘i ostidadir», dedilar Nabiy (Hokim rivoyati).  
Abdulloh ibn Amr roziyallohu anhu aytadilar: «Bir ayol: «Yo Rasululloh, mana bu o‘g‘limga qornim joy, bag‘rim boshpana, ko‘kragim esa sug‘oradigan mesh bo‘lgan edi. Endi otasi uni tortib olmoqchi», dedi. Shunda u zot sollallohu alayhi vasallam: «Modomiki, nikohlanmas – boshqa erga tegmas ekansan, sen unga haqliroqsan», dedilar» (Ahmad, Abu Dovud, Hokim rivoyati).  
Shuningdek, Rasululloh sollallohu alayhi vasallam: «Xola ona maqomidadir», deganlar (Ahmad, Buxoriy, Muslim rivoyati).  
Ya’ni, xolaga ham yaxshilik, xayr-ehson, hurmat ko‘rsatish lozim. Ibn Umar roziyallohu anhumo yelkasiga onasini mingizib olib, Ka’bani tavof qildirayotgan kishini ko‘rdilar. U kishi: «Ey Ibn Umar, men onamning haqqini ado qila oldimmi?» deb so‘ragan edi, u zot: «To‘lg‘oqlaridan bir to‘lg‘oq haqini ham ado eta olmading. Biroq, yaxshi ish qilding. Alloh sening ozgina yaxshigilingga ko‘p savoblar ado etur», dedilar.  
Bikir aytganlarki: «Qaysi bir kishi onasiga gapini eshitadigan darajada yaqin bo‘lsa, bu unga Alloh yo‘lida qilich chopishgandan ko‘ra afzalroqdir. Onasiga nazar solish esa barcha narsadan afzaldir».  
Allohdan bizni O‘zining roziligiga muvaffaq etmog‘ini, g‘azabiga uchrashdan saqlamog‘ini so‘raymiz. Albatta, U marhamatli, mehribon va rahmli zotdir.",
'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Pokiza ayollarga tuxmat qilish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"POKIZA AYOLLARGA TUHMAT QILISH 
Alloh taolo aytadi:  
«Albatta, (buzuq niyatlardan) bexabar, pokiza, mo‘mina ayollarni badnom qiladigan kimsalar dunyoda ham, oxiratda ham la’natga duchor bo‘ladilar. Ular uchun ulug‘ azob bordir. U Kun (qiyomat)da qilib o‘tgan (bo‘htonlari) sababli ularning tillari ham, qo‘lu oyoqlari ham o‘zlarining ziyonlariga guvohlik berur» (Nur surasi, 23–24).  
«Pokiza ayollarni (zinokor) deb badnom qilib, so‘ngra (bu da’volariga) to‘rtta guvoh keltira olmagan kimsalar(ni) – ularni sakson darra uringlar va hech qachon ular tomonidan biron guvohlikni qabul qilmanglar! Ular fosiq – itoatsiz kimsalardir» (Nur surasi, 4).  
Haromdan saqlangan, pokiza, hur ayolga kimda-kim «zinokor» yoki «fohisha» deb tuhmat qilsa, unga dunyo-yu oxiratda la’nat va ulkan azob bo‘lishini, bu dunyoda esa sakson darra urilib, garchi ishonchli bo‘lsa-da, guvohligi boshqa qabul qilinmasligini Alloh taolo bayon qildi.  
Rasululloh sollallohu alayhi vasallam: «Yettita halok qiluvchi ishdan saqlaninglar», deb ular orasida: «(Buzuq niyatlardan) g‘ofil, pokiza, mo‘mina ayollarga tuhmat qilish»ni ham sanab o‘tganlar (Muttafaqun alayh).  
Tuhmat qilish – pokiza, hur, muslima ayolga «ey zinokor» yoki «ey fohisha» va yo shunga ma’nodosh so‘zlarni aytish, eriga «ey fohishaning eri» o‘g‘liga «ey fohishaning o‘g‘li» qiziga «ey fohishaning qizi» deyish yoki shu kabi so‘zlarni so‘zlashdir.",
'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Pokiza ayollarga tuxmat qilish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Bironta erkak yoki ayol boshqa bir erkak yoki ayolga va yo yosh bolaga shu va shunga o‘xshash so‘zlarni aytsa, shu so‘zlarning rostligiga to‘rtta guvoh keltirishi lozim. Agar keltira olmasa, tuhmatga uchragan erkak yoki ayol talab qilsa, unga sakson darra uriladi.  
Shuningdek, quliga tuhmat qilgan kimsa ham azobga giriftor bo‘ladi. Rasululloh sollallohu alayhi vasallam aytganlar: «Kimki quliga «zinokor», deb tuhmat qilsa, qiyomat kunida unga had (jazo) qo‘llanadi. Agar gapi rost bo‘lsa, (jazo) qo‘llanmaydi» (Muttafaqun alayh).  
Ko‘p johillar behayo so‘zlarni aytishga odatlanib qolishgan. Holbuki, ular mana shu so‘zlari bilan dunyoda gunohkor, oxiratda azobga giriftor bo‘ladilar. Zero, Rasululloh sollallohu alayhi vasallam aytganlar: «Banda o‘ylamasdan bir so‘zni aytadi-da, u sababli mashriq bilan mag‘rib orasidagi masofadan uzunroq masofaga do‘zaxga qulaydi» (Muttafaqun alayh).  
Abdulloh ibn Mas’ud roziyallohu anhu rivoyat qiladilar: «Rasululloh sollallohu alayhi vasallam: «Odam farzandi xatolarining aksariyati tilidandir», dedilar» (Tabaroniy, Bayhaqiy rivoyati). 
Boshqa bir hadisi sharifda: «Kimki Alloh va oxirat kuniga ishonar ekan, unda yaxshi gap gapirsin yoki sukut saqlasin», deyilgan (Muttafaqun alayh).  
Savbon roziyallohu anhudan rivoyat qilinadi: Rasululloh sollallohu alayhi vasallam: «Tiliga egalik qilgan, uyi sig‘dirgan va xatolariga yig‘lagan kishiga jannat bo‘lsin», dedilar (Tabaroniy rivoyati).  
Ibn Mas’ud roziyallohu anhu aytadilar: «Rasululloh sollallohu alayhi vasallam aytdilar: «Mo‘min ta’na qiluvchi, la’nat aytuvchi, axloqsiz va behayo so‘zlovchi bo‘lmaydi» (Termiziy rivoyati).  
Alloh taolo lutf-marhamati ila barchamizni tillarimiz yomonligidan saqlasin. Albatta, u saxovatli, marhamatli zotdir.  
Foyda: Musannif rahimahulloh aytadilar: «Kim pok ekanliklarini tasdiqlovchi oyat tushganiga qaramasdan, Oisha roziyallohu anho onamizga tuhmat qilsa, u Qur’onni yolg‘onga chiqargan kofir hisoblanadi va o‘ldiriladi».",
'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Lanat aytish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"LA’NAT AYTISH 
Payg‘ambar sollallohu alayhi vasallam aytdilar: «Musulmonni so‘kish fosiqlik, o‘ldirish esa kufrdir» (Muttafaqun alayh).  
Rasululloh sollallohu alayhi vasallam aytdilar: «Mo‘minni la’natlash uni o‘ldirish bilan barobardir» (Muttafaqun alayh).  
Abu Dardodan rivoyat qilinadi: Rasululloh sollallohu alayhi vasallam aytdilar: «La’natlovchilar qiyomat kunida shafoatchi ham, guvoh ham bo‘lmaydilar» (Muslim rivoyati).  
Imom Muslim rivoyat qilgan boshqa bir hadisda: «Siddiq kishi la’natlovchi bo‘lishi durust emas», deyilgan.  
Ibn Mas’ud roziyallohu anhudan rivoyat qilinadi: Rasululloh sollallohu alayhi vasallam aytdilar: «Mo‘min ta’na qiluvchi, la’nat aytuvchi, axloqsiz va behayo so‘zlovchi bo‘lmaydi» (Termiziy rivoyati).  
Abu Dardo roziyallohu anhudan rivoyat qilinadi: Rasululloh sollallohu alayhi vasallam aytdilar: «Agar banda biron narsani la’natlasa, la’nat osmonga ko‘tariladi. Biroq osmon eshiklari uning qarshisida yopiladi. So‘ng yerga qaytadi. Biroq uning qarshisida yer eshiklari ham yopiladi. Keyin o‘ngga-so‘lga yuradi. Agar biron imkon (qo‘nimgoh) topmasa, mabodo la’natlangan kishi munosib bo‘lsa, unga qaytadi. Munosib bo‘lmasa, aytgan odamga qaytadi» (Abu Dovud rivoyati).  
Payg‘ambar sollallohu alayhi vasallam tuyasini la’natlagan ayolni tuyasidan mahrum qilish bilan jazolaganlar. 
Imron ibn Husayn roziyallohu anhu aytadilar: «Rasululloh sollallohu alayhi vasallam safarda edilar. Bir vaqt ansoriy ayollardan biri achchiqlanib, minib kelayotgan tuyasini la’natladi. Rasululloh sollallohu alayhi vasallam buni eshitdilar-da: «Ustidagi narsalarni olib, o‘zini qo‘yib yuboringlar. Zero, u mal’un-la’natlangandir», dedilar. O‘sha tuya odamlar orasida yurgani-yu, unga hech kim tegmaganini men hozir ham ko‘rib turgandekman» (Muslim rivoyati).  
Payg‘ambar sollallohu alayhi vasallam aytdilar: «Kishi birodarining or-nomusiga tajovuz qilishi eng katta sudxo‘rlikdir» (Bazzor rivoyati).  
Amr ibn Qays aytgan ekanlar: «Agar kishi uloviga minsa, ulovi: «Ey Allohim, uni menga mehribon hamroh qilgin», deydi. Agar uni la’natlasa: «Alloh va rasuliga osiy bo‘lganlarimizga Alloh azza va jallaning la’nati bo‘lsin», deydi.", 
'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Lanat aytish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"
Muayyan, ma’lum bir shaxsni nomlamay, gunohkorlarni la’natlash joizligi xususida  
Alloh taolo aytadi: «Ogoh bo‘lingizkim, bunday zolimlarga Allohning la’nati bo‘lur» (Hud surasi, 18).  
«So‘ngra Allohga tazarru bilan iltijo qilaylik-da, yolg‘onchilarni Alloh la’nat qilishini so‘raylik» (Oli Imron surasi, 61).  
Rasululloh sollallohu alayhi vasallam ribo yeyuvchini, yediruvchini, kotibini va guvohlarini la’natlaganlar» (Muslim rivoyati).  
Rasululloh sollallohu alayhi vasallam: «Alloh halol qiluvchini ham, halollatuvchini ham la’natladi», dedilar (Ibn Moja rivoyati).  
Rasululloh sollallohu alayhi vasallam soch ulovchi va ulatuvchi, badaniga naqsh soluvchi va soldiruvchi ayollarni la’natlaganlar (Buxoriy, Muslim va boshqalar rivoyati).  
Ibn Abbos roziyallohu anhumo: «Biron bir dardsiz-uzrsiz soch ulovchi va ulatuvchi, qosh teruvchi va terdiruvchi, badaniga naqsh soluvchi va soldiruvchi ayollar la’natlangan», deganlar (Abu Dovud rivoyati).  
Rasululloh sollallohu alayhi vasallam yuzini yuluvchi, yoqasini yirtuvchi va o‘ziga o‘lim tilovchi ayollarni la’natlaganlar (Ibn Moja, Ibn Hibbon rivoyati).  
Payg‘ambar sollallohu alayhi vasallam: «Otasini so‘kkan kimsa mal’undir. Onasini so‘kkan kimsa mal’undir. Allohdan boshqaga atab jonliq so‘ygan kimsa mal’undir. Yer chegaralarini o‘zgartirgan kimsa mal’undir. Hayvonga yaqinlik qilgan kimsa mal’undir. Lut qavmi amalini qilgan kimsa ham mal’undir», dedilar (Imom Ahmad rivoyati).  
Nabiy aytganlar: «Ota-onasiga oq bo‘lgan kimsani Alloh la’natladi» (Tabaroniy, Hokim rivoyati).  
Rasululloh sollallohu alayhi vasallam: «Xotinining orqasiga yaqinlik qilgan kimsa mal’undir», dedilar (Abu Dovud, Nasoiy, Ibn Moja rivoyati).  
Rasululloh sollallohu alayhi vasallam dod solib yig‘lovchi va uni tinglovchi ayolni la’natlaganlar (Abu Dovud rivoyati).  
O‘g‘ri ham la’natlangandir.  
Payg‘ambar sollallohu alayhi vasallam: «Alloh o‘g‘rini la’natlagandir: u bitta tuxumni o‘g‘irlaydi-da, qo‘li kesiladi, arqon o‘g‘irlaydi-da, qo‘li kesiladi», deganlar.  
Oisha roziyallohu anhumo aytadilar: «Rasululloh sollallohu alayhi vasallam: «Sahobalarimni so‘kmanglar. Sahobalarimni so‘kkan kimsani Alloh la’natlasin», dedilar» (Tabaroniy rivoyati).  
Abu Hurayra roziyallohu anhu aytadilar: «Rasululloh sollallohu alayhi vasallam ayollarga taqlid qiladigan erkaklarni va erkaklarga o‘zlarini o‘xshatadigan ayollarni hamda sahroga yolg‘iz safar qilgan kishini la’natlaganlar» (Ahmad rivoyati).  
Ibn Abbos roziyallohu anhumo aytadilar: «Rasululloh sollallohu alayhi vasallam o‘zlarini ayollarga o‘xshatadigan erkaklarni va o‘zlarini erkaklarga o‘xshatadigan ayollarni la’natlaganlar» (Buxoriy va boshqalar rivoyati).  
Abu Hurayra roziyallohu anhu aytadilar: «Rasululloh sollallohu alayhi vasallam ayollar kiyimini kiyadigan erkakni va erkaklar kiyimini kiyadigan ayolni la’natlaganlar» (Abu Dovud rivoyati).     Huzayfa ibn Usayd roziyallohu anhudan rivoyat qilinadi: Payg‘ambar sollallohu alayhi vasallam: «Musulmonlarga yo‘llarida ozor beradigan kimsaga ularning la’nati vojib bo‘ladi», deganlar (Tabaroniy rivoyati).",
 'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Lanat aytish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Rasululloh sollallohu alayhi vasallam: «Kimki birodariga temir parchasi bilan ishora qilsa, to (bu harakatidan) to‘xtamagunicha, farishtalar unga la’nat aytib turishadi. Garchi u ota bir yoki ona bir akasi bo‘lsa ham», deganlar (Muslim rivoyati).  
Abdulloh ibn Mas’ud roziyallohu anhu aytadilar: «Ribo yeyuvchi va yediruvchi (agar uning ribo ekanini bilishsa), guvohlari, badaniga naqsh soluvchi va soldiruvchi ayollar, zakotini bermaydigan kimsa, hijratdan keyin a’robiylikka qaytgan kimsalar qiyomat kuni Muhammad sollallohu alayhi vasallam tilida la’natlanurlar» (Ibn Huzayma rivoyati).  
Rasululloh sollallohu alayhi vasallam aytdilar: «Musulmonlar himoyasi bir xil bo‘lib, ularning eng oddiyi ham bunga harakat qila oladi. Kimki bir musulmonni yordamsiz tashlab qo‘ysa, unga Allohning, farishtalarning va barcha insonlarning la’nati bo‘lur. Qiyomat kunida Alloh undan na farz, na nafl ibodatlarini qabul qilur. Va yana kimki otasidan boshqa kimsani «otam» deb iddao qilsa yoki xo‘jayinidan boshqa kimsaga o‘zini mansub deb bilsa, unga Allohning, farishtalarning va barcha insonlarning la’nati bo‘lur, qiyomat kunida Alloh undan na farz, na nafl ibodatlarini qabul qilur» (Buxoriy, Muslim rivoyati).  
Ibn Abbos roziyallohu anhumo aytadilar: «Payg‘ambar sollallohu alayhi vasallam yuziga tamg‘a bosilgan eshak yonidan o‘taturib: «Uning yuziga tamg‘a bosgan kimsani Alloh la’natlasin», dedilar» (Muslim rivoyati).  
Rasululloh sollallohu alayhi vasallam yuzga tamg‘a bosadigan kimsani la’natlaganlar (Tabaroniy rivoyati).  
Erining to‘shagini tark etgan holda tunaydigan ayol qaytmagunicha la’natlanadi.  
Rasululloh sollallohu alayhi vasallam aytdilar: «Er xotinini to‘shagiga chorlagan vaqtda (xotini) kelmasa va eri undan norozi bo‘lib tunasa, to tong otguncha farishtalar u ayolni la’natlaydilar» (Buxoriy, Muslim, Abu Dovud rivoyati).  
Ibn Umar roziyallohu anhudan rivoyat qilinadi: Rasululloh sollallohu alayhi vasallam aytdilar: «Ayol uyidan chiqsa-yu, eri norozi bo‘lsa, to uyiga qaytgunicha, osmondagi barcha farishtalar va insu jindan tashqari u yonidan o‘tgan har bir narsa unga la’nat aytib turadi» (Tabaroniy rivoyati).  
Payg‘ambar sollallohu alayhi vasallam aytdilar: «Sizlardan ilgari o‘tgan Bani Isroil qavmida biron kishi xato ish qilsa, boshqa biri uni koyib, bu ishdan qaytarardi. Ertasiga esa, kechagina uning xato qilganini ko‘rmaganday, u bilan birga o‘tirar, yeb-ichar edi. Alloh taolo ularning bu ishini ko‘rgach, ayrimlarining qalblarini ayrimlari tufayli muhrladi hamda ularni Dovud va Iso ibn Maryam tilida la’natladi. Ular osiylik qilganlari va hadlaridan oshganlari sababli shu balolarga duchor bo‘ldilar. Jonim qo‘lida bo‘lgan zotga qasamki, albatta, yaxshilikka buyurasizlar, yomonlikdan qaytarasizlar, xatokorning qo‘lidan tutib, haqqa, albatta, yo‘llaysizlar. Bo‘lmasa, Alloh, albatta, ayrimlaringiz qalblarini ayrimlaringiz tufayli muhrlaydi va ularni la’natlagandek, sizlarni ham la’natlaydi» (Tabaroniy rivoyati).  
Abu Said Xudriy roziyallohu anhu aytadilar: «Rasululloh sollallohu alayhi vasallam bir necha qurayshlik o‘tirgan uyga kirdilar-da, eshikning ikki kesakisidan tutib turib: «Uyda faqat qurayshliklar bormi?» deb so‘radilar. Ular: «Yo‘q, singlimizning o‘g‘li ham bor», deyishdi. U zot sollallohu alayhi vasallam: «Qavm singlisining o‘g‘li ham ulardandir», dedilar va davom etdilar: «Albatta, bu ish rahm-shafqat so‘rashganda rahm-shafqat ko‘rsatar, hukmda adolat qilar va taqsimotda to‘g‘ri, halol taqsimlar ekan, Quraysh qo‘lida bo‘ladi. Kimki buni qilmas ekan, unga Allohning, farishtalarning va barcha insonlarning la’nati bo‘lur» (Tabaroniy rivoyati).  
Urva ibn Zubayrdan rivoyat qilinadi: Zubayr roziyallohu anhu bir o‘g‘rini uchratib qoldi va uni shafoatiga oldi. Undan: «Imomga (boshliqqa) olib borguncha shafoatingizga oldingizmi?» deb so‘rashgan edi, u zot: «Rasululloh sollallohu alayhi vasallam aytganlaridek, (imomga) yetgan vaqtda shafoat qiluvchini ham, shafoat qildiruvchini ham Alloh la’natlaydi», deya javob berdilar (Tabaroniy rivoyati).  
Abu Hurayra roziyallohu anhu aytadilar: «Rasululloh sollallohu alayhi vasallam biron hukm borasida pora beruvchini ham, pora oluvchini ham la’natlaganlar» (Termiziy, Ibn Hibbon, Hokim rivoyati).  
Mazkur hadisi sharifning yana bir rivoyatida: «Ular orasini kelishtiruvchi – dallolni ham la’natlaganlar», deyilgan.  
Abu Hurayradan rivoyat qilinadi: Rasululloh sollallohu alayhi vasallam: «Ayol va qizi orasini jamlagan (ya’ni, ikkalasini ham nikohiga olgan) kimsa mal’undir», dedilar (Tabaroniy rivoyati).  
Rasululloh sollallohu alayhi vasallam aytdilar: «Oldimga Jabroil kelib: «Ey Muhammad, albatta, Alloh xamrni, uning siquvchisini, siqdiruvchisini, ichuvchisini, ko‘tarib keluvchisini, ko‘tarib keltiruvchisini, sotuvchisini, sotib oluvchisini, quyuvchisi va quydiruvchisini la’natlagandir», dedi» (Ahmad, Ibn Hibbon, Hokim rivoyati).",
 'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Lanat aytish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Abu Juhayfa roziyallohu anhu aytadilar: «Payg‘ambar sollallohu alayhi vasallam it daromadi va qon daromadidan qaytardilar. Badaniga naqsh soluvchi va naqsh solingan ayollardan hamda foiz yeyuvchi va yediruvchi kimsalardan qaytardilar hamda musavvirlarni la’natladilar» (Buxoriy rivoyati).  
Ilmni yashirgan kimsa ham mal’undir.  
«Biz nozil qilgan hujjatlar va hidoyatdan iborat (Muhammad alayhissalom haq payg‘ambar ekani haqidagi) narsalarni odamlarga Kitobda (Tavrotda) ravshan qilib berganimizdan keyin yashiradigan kimsalarni, shubhasiz, Alloh la’natlagay va la’natlovchi zotlar (farishtalar va mo‘minlar) la’natlagaylar» (Baqara surasi, 159).  
Abu Hurayra roziyallohu anhu aytadilar: «Rasululloh sollallohu alayhi vasallam ayollarga taqlid qiladigan erkaklarni va erkaklarga taqlid qiladigan ayollarni, «turmush qurmay o‘taman», deydigan zohid erkaklarni va shunday zohid ayollarni hamda yolg‘iz musofirni la’natladilar. Bu (ya’ni, yolg‘iz musofirni la’natlaganlari) sahobalarga yoqmadi. Bu ularning yuzlaridan bilinib turardi. Rasululloh keyin: «Yolg‘iz o‘zi uxlovchi ham (mal’undir)», dedilar» (Imom Ahmad rivoyati).  
Fasl  
Gunohlardan saqlangan musulmonni la’natlash haromligiga musulmonlar «ijmo’» qilishgan. Biroq qoralangan sifat egalarini la’natlash joiz. Masalan, «Alloh zolimlarni la’natlasin», «Alloh kofirlarni la’natlasin», «Alloh nasoro-yu yahudlarni la’natlasin», deyish mumkin.  
O‘g‘ri, zolim, zinokor, sudxo‘r yoki yahudiy bo‘lgan muayyan bir insonni la’natlash, hadislar zohiriga binoan harom emas. Imom Fazzoliy rahimahulloh hazratlari esa buning haromligiga ishora qilganlar va Abu Lahab, Abu Jahl, Fir’avn, Homon kabi kofir holida o‘lgani ma’lum kimsalarnigina la’natlash joiz deb bilganlar. «Chunki la’natlash – Alloh rahmatidan chetlanish deganidir. Biz fosiq yoki kofirning xotimasi qanday bo‘lishini esa bilmaymiz, deydilar.  
Biroq Rasululloh sollallohu alayhi vasallam la’natlagan muayyan kimsalarni la’natlash joiz. Chunki u zot sollallohu alayhi vasallam ularning kofir holida o‘lishlarini aniq bilganlar. Masalan, Rasululloh sollallohu alayhi vasallam: «Ey Allohim, Alloh va Rasuliga osiylik qilgan Ra’l, Zakvon va Usayya (yoki Asiyya) qabilalarini la’natlagin», deganlar (Muslim rivoyati).  
Biror kishini duoibad qilish ham qariyib la’natlash bilan barobardir. Hattoki, zolimni «Alloh jismini sog‘ qilmasin» «Alloh salomat qilmasin» kabi so‘zlar bilan duoibad qilish durust emas. Bularning barchasi qoralangandir.  
Shuningdek, jonli-yu jonsiz barcha mavjudotni la’natlash ham nojoiz. Ayrim ulamolar aytganlarki: «Kimda-kim la’natga munosib bo‘lmagan kishini la’natlasa, darhol so‘zini qaytarib olsin...»  
Fasl  
Amri ma’ruf-nahiy munkar qiluvchi va har bir nasihatgo‘y qarshisidagi kishiga: «Holingga voy bo‘lsin» «Ey holi zaif», «Ey loqayd», «Ey o‘ziga zolim» kabi so‘zlarni aytsa joiz. Bunda faqat yolg‘onga o‘tib ketmasligi va rost bo‘lsa-da, qo‘pol, behayo so‘z so‘zlamasligi darkor. Odob berish, yomon xulqlardan qaytarish va so‘z ta’sirchan bo‘lishi uchun yuqorida zikr qilingan jumlalarni so‘zlash mumkin, xolos. Vallohu a’lam.  
Ey Allohim, qalblarimizni o‘zingdan boshqaga bog‘lanib qolishdan pokla, bizni O‘zing yaxshi ko‘rgan va O‘zingni yaxshi ko‘rgan qavmdan qil. Bizni, ota-onamizni va barcha musulmonlarni mag‘firat ayla.",
'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Odam oldirish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"ODAM O‘LDIRISH 
Alloh taolo aytadi:  
«Kim qasddan bir mo‘minni o‘ldirsa, uning jazosi jahannam bo‘lib o‘sha joyda abadiy qolajak. Va u Allohning g‘azabi va la’natiga duchor bo‘lgan, Alloh uning uchun ulug‘ azobni tayyorlab qo‘ygandir» (Niso surasi, 93).  
«Ular Alloh bilan birga boshqa biron ilohga duo-iltijo qilmaslar va Alloh (o‘ldirishni harom qilgan) biron jonni nohaq o‘ldirmaslar hamda zino qilmaslar. 
Kim mana shu (gunohlardan birontasini) qilsa, uqubatga duchor bo‘lur. Qiyomat kunida uning uchun azob bir necha barobar qilinur va u joyda xorlangan holida mangu qolur. Magar kim tavba qilsa va iymon keltirib yaxshi amallar qilsa, bas, Alloh ana o‘shalarning yomonlik-gunohlarini yaxshiliksavoblarga aylantirib qo‘yur» (Furqon surasi, 68–70).  
«Ana o‘sha (qotillik) sababli Biz Bani Isroil zimmasiga (shunday farmonni) bitdik: «Kimki biron jonni (o‘ldirmagan) va yerda buzg‘unchilik qilib yurmagan odamni o‘ldirsa, demak, go‘yo barcha odamlarni o‘ldiribdi va kimki unga hayot ato etsa (ya’ni, o‘ldirishdan bosh tortsa yoki o‘limdan qutqarsa), demak, u go‘yo barcha odamlarga hayot beribdi» (Moida surasi, 32).  
Ya’ni, kimki bir odamni qasos olish yoki qilgan jinoyati uchun jazolash kabi sabablarsiz, bekordan-bekorga o‘ldirsa, go‘yo barcha odamlarni o‘ldirgandek bo‘ladi. Chunki uning uchun odamning farqi yo‘q. Shuningdek, kimki boshqa insonni o‘ldirishni harom deb bilsa va bu jinoyatdan qo‘lini tiysa, undan barcha insonlar salomat bo‘lishadi.  
Payg‘ambar sollallohu alayhi vasallam: «Yettita halok qiluvchi gunohdan saqlaninglar!» deb, ularning ichida «Alloh (o‘ldirishni) harom qilgan jonni nohaq o‘ldirish», deya zikr etganlar.  
Ibn Mas’ud roziyallohu anhu aytadilar: «Rasululloh sollallohu alayhi vasallamdan: «Alloh nazdidagi eng ulkan gunoh qaysi?» deb so‘ragan edim, «Allohga boshqani teng deb bilishing, holbuki, U seni yaratgan», deya javob berdilar. «Bu rostdan ham ulkan gunoh, so‘ng qaysi?» degan edim, «Ovqatingga sherik bo‘lishidan qo‘rqib, farzandingni o‘ldirishing!» dedilar. «Keyin-chi?» deb so‘ragan edim, «Qo‘shningning xotini bilan zino qilishing», deya javob berdilar» (Muttafaqun alayh).  
Rasululloh sollallohu alayhi vasallam: «Agar ikki musulmon qilichlari bilan to‘qnashsalar, o‘ldirgan ham, o‘lgan ham do‘zaxda», dedilar. «Yo Rasululloh, bu-ku qotil, biroq maqtulning gunohi nima?» deb so‘rashdi. Shunda u zot: «U ham birodarini o‘ldirishga ishtiyoqmand edi», dedilar (Muttafaqun alayh).  
Imom Abu Sulaymon Xitobiy aytadilar: «Bu hukm biron ta’vil sabab bilan emas, balki o‘zaro adovat, tarafkashlik yoki dunyo, obro‘, mansab tufayli urushganlarga taalluqlidir. Biroq, kimda-kim bog‘iylarga qarshi jang qilsa yoki o‘zini yo oilasini mudofaa qilsa, bu tahdidning unga daxli yo‘q. Chunki u o‘zini himoya etish uchun jang qilishga buyurilgan bo‘lib, maqsadi birodarini o‘ldirish emas. Axir u zot sollallohu alayhi vasallam: «U ham birodarini o‘ldirishga haris – ishtiyoqmand edi», deganlar!»",
'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Odam oldirish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Kimki bog‘iy yoki yo‘lto‘sar musulmonga qarshi jang qilsa, uni o‘ldirishga harisishtiyoqmand bo‘lmaydi. Aksincha, o‘zini mudofaa qiladi, xolos. Agar tajovuzkor o‘z ishini to‘xtatsa, unga tegmaydi, ta’qib etmaydi. Hadis bunday kishilar haqida vorid bo‘lmagan, ularning daxli yo‘q. Aksincha, hadisda bunday (shar’iy) sabab bo‘lmay turib, jang qilganlar iroda qilingandir. Vallohu a’lam.  
Rasululloh sollallohu alayhi vasallam aytdilar: «Ogoh bo‘linglar, mendan keyin ayrimlaringiz boshqalaringizning bo‘yniga uradigan kofir bo‘lib ketmangiz!» (Muttafaqun alayh). 
Rasululloh sollallohu alayhi vasallam aytdilar: «Modomiki nohaq qon to‘kmas ekan, mo‘min inson dinidagi kenglikda bardavom bo‘laveradi» (Buxoriy, Muslim rivoyati).  
Ibn Umar roziyallohu anhu aytganlarki: «Nohaq qon to‘kish sira qutulib bo‘lmaydigan halokatli ishlardandir» (Buxoriy rivoyati).  
Payg‘ambar sollallohu alayhi vasallam aytdilar: «Qiyomat kuni insonlar orasida birinchi bo‘lib qonlar xususida hukm qilinadi» (Muttafaqun alayh).  
Rasululloh sollallohu alayhi vasallam aytdilar: «Allohga dunyoning zavol topishi musulmon kishining qatl etilishidan ko‘ra yengilroqdir» (Muslim va boshqalar rivoyati).  
Payg‘ambar sollallohu alayhi vasallam dedilar: «Gunohi kabiralar (ushbulardir): Allohga shirk keltirish, ota-onaga oq bo‘lish, biron jonni o‘ldirish va yolg‘on qasam» (Buxoriy rivoyati).  
Payg‘ambar sollallohu alayhi vasallam dedilar: «Biron bir jon mazlum holda o‘ldirilsa, uning qonidan bir qismi Odamning birinchi o‘g‘li bo‘ynida bo‘ladi. Chunki u qotillikni birinchi bo‘lib joriy etgan edi» (Muttafaqun alayh).  
Rasululloh sollallohu alayhi vasallam aytdilar: «Kimki ahdlashgan kishini o‘ldirsa, jannat hidini hidlamaydi. Vaholanki, uning hidi qirq yillik masofadan kelib turadi» (Buxoriy rivoyati).  
Islom davlatida yashaydigan, jiz’ya to‘laydigan g‘ayridin muahid (ahdlashgan) hisoblanadi. Endi ahdlashgan g‘ayridinni o‘ldirishning oqibatida shu bo‘lsa, musulmonni o‘ldirishning oqibati qanday bo‘lar ekan...  
Payg‘ambar sollallohu alayhi vasallam aytdilar: «Ogoh bo‘linglar, kimda-kim Alloh va Rasulining himoyasidagi ahdlashgan jonni o‘ldirsa, aniqki, u Allohning kafolatini barbod qilibdi. Binobarin, u jannat bo‘yini totmaydi. Vaholanki, uning bo‘yi yetmish yillik masofadan kelib turadi» (Termiziy rivoyati).  
Muoviya roziyallohu anhu rivoyat qiladilar: «Rasululloh sollallohu alayhi vasallam aytdilar: «Alloh barcha gunohlarni kechirishi mumkin, ammo bir kishi kofir holida o‘lgan bo‘lsa, yoki bir kishi mo‘minni qasddan o‘ldirsa, bu gunohlarni kechirmaydi» (Nasoiy, Hokim rivoyati).  
Rivoyat qilinishicha, «Kimki bir mo‘minning qatl etilishiga yarimta so‘z bilan yordam bersa, ikki ko‘zi orasiga «Alloh rahmatidan noumid» deb yozilgan holida Allohga yo‘liqadi».  
Alloh taolodan ofiyat tilaymiz",
 'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Folbin va munajjimning gapini tastiqlash"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"FOLBIN VA MUNAJJIMNI TASDIQLASH 
Alloh taolo aytadi: «(Ey inson), o‘zing aniq bilmagan narsaga ergashma. Chunki quloq, ko‘z, dil – bularning barchasi to‘g‘risida (har bir inson) mas’ul bo‘lur (ya’ni, eshitgan, ko‘rgan va ishongan har bir narsasi uchun kishi qiyomat kunida javob beradi)» (Al-Isro surasi, 36).  
Bu oyatning tafsirida Kalbiy: «Bilmagan narsang haqida gapirma», degan bo‘lsalar, Qatoda: «Eshitmagan narsangni eshitdim, ko‘rmagan narsangni ko‘rdim va bilmagan narsangni bildim, demagin», deganlar.  
«Chunki quloq, ko‘z, dil – bularning barchasi to‘g‘risida (har bir inson) mas’ul bo‘lur», oyatini tafsir qilib, Ibn Abbos roziyallohu anhu: «Alloh bandalaridan bu a’zolarni qanday ishlarga ishlatganini so‘raydi», deganlar.  
Bu oyati karima halol bo‘lmagan narsaga qarash, harom narsani eshitish va joiz bo‘lmagan narsani iroda qilishdan qaytarishga hujjat bo‘ladi. Vallohu a’lam.",
 'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Folbin va munajjimning gapini tastiqlash"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"«(U zot) g‘aybni bilguvchidir. Bas, O‘z g‘aybidan biron kimsani ogoh qilmas. Faqat O‘zi rozi bo‘lgan payg‘ambarnigina (O‘zining g‘aybidagi sir-asrorining ayrimlaridan ogoh etar)» (Jin surasi, 26–27). Mazkur oyati karima yulduzlar g‘aybga dalolat qiladi, deb iddao qilgan kimsa kofir bo‘lishiga dalildir. Vallohu a’lam.  
Abu Hurayra roziyallohu anhudan rivoyat qiladilar: «Rasululloh sollallohu alayhi vasallam aytdilar: «Kimki bashoratgo‘y yoki folbinning oldiga borib, aytayotgan gapini rost deb bilsa, u shubhasiz, Muhammadga tushgan narsaga kufr keltiribdi» (Abu Dovud, Nasoiy, Ibn Moja rivoyati).  
Zayd ibn Xolid Juhaniy roziyallohu anhu aytadilar: «Rasululloh sollallohu alayhi vasallam biz bilan bomdod namozini o‘qidilar. Tuni bilan yomg‘ir yog‘ib chiqqan edi. Namozni o‘qib bo‘lgach, odamlarga yuzlanib: «Rabbingiz nima deganini bilasizlarmi?» dedilar. Ular: «Allohning Rasuli bilguvchiroq», deb javob berishdi. Rasululloh sollallohu alayhi vasallam dedilar: «U zot aytdiki: «Bandalarimdan ayrimlari menga iymon keltirib, ayrimlari kufr keltirib tong ottirdi. Kimki: «Allohning fazli va rahmati ila bizga yomg‘ir yog‘di», desa, u Menga iymon keltirib, yulduzlarga kufr keltiribdi. Ammo kimki: «Bu va u hodisalar (shamol, bulut), bo‘lib bizga yomg‘ir yog‘di», desa, u Menga kufr keltirib, yulduzlarga iymon keltiribdi» (Muttafaqun alayh).  
Ulamolar aytadilarki: «Agar bir musulmon: «Falon hodisa bo‘lib yomg‘ir yog‘di», desa va bu gapini shu hodisa, masalan, havo bulut bo‘lishining o‘zi yomg‘irni paydo qiladi va yomg‘ir yog‘averadi, degan ma’noda aytgan bo‘lsa, u, shubhasiz, murtad bo‘lib, kofirga aylanadi. Agar bu gapni shu hodisa yomg‘ir yog‘ishining alomati, odatda shu hodisa bo‘lganda yomg‘ir yog‘adi, biroq yomg‘irning yaratuvchisi Alloh taolo va u Allohning fazli ila yog‘adi, degan ma’noda gapirgan bo‘lsa, kofir bo‘lmaydi.  
Har qanday holatda ham, bu jumla kofirlar gapi bo‘lgani bois uni aytish makruhdir. Rasululloh sollallohu alayhi vasallam aytdilar: «Kimki bashoratgo‘yning oldiga borib, undan biron narsani so‘rasa va uni tasdiqlasa, qirq kungacha uning bironta ham namozi qabul qilinmaydi» (Muslim rivoyati).  
Oisha (roziyallohu anho) aytadilar: «Odamlar Rasululloh sollallohu alayhi vasallamdan folbinlar haqida so‘rashdi. U zot: «Ular haq emaslar», dedilar. Shunda: «Yo Rasululloh, ular gohida shunday gaplarni aytadilarki, u haq bo‘lib chiqadi», deyishdi. Rasululloh sollallohu alayhi vasallam: «Bu haq kalimani jin o‘g‘rincha bilib oladi-da, uni do‘stifolbinning qulog‘iga quyadi. Folbinlar esa unga yuzta yolg‘onni aralashtirib yuboradilar», dedilar» (Muttafaqun alayh).  
Payg‘ambar sollallohu alayhi vasallam aytdilar: «Farishtalar bulutga tushadilar va osmonda hukm qilingan ishni zikr qiladilar. Shayton o‘g‘rincha quloq tutib, eshitib oladida, uni folbinlarga yetkazadi. Ular esa unga o‘zlaridan yuzta yolg‘on qo‘shib, yolg‘on gapiradilar» (Buxoriy rivoyati).  
Ibn Abbos roziyallohu anhumodan rivoyat qilinadi: Rasululloh sollallohu alayhi vasallam aytdilar: «Kimki yulduzlar ilmidan (munajjimlikdan) bironta ilmni egallasa, sehrning bir bo‘lagini o‘g‘irlagan bo‘ladi. U ziyoda bo‘lgan sayin bu ham ziyoda bo‘laveradi» (Abu Dovud rivoyati).  
Ali ibn Abu Tolib roziyallohu anhu aytganlar: «Folbin sehrgardir, sehrgar esa kofirdir».  
Alloh taolodan dunyo-yu oxiratda ofiyat va panoh tilaymiz.",
'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Zino"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"ZINO
Alloh taolo bandalarini zinoga yaqinlashishdan va zinoga sabab bo‘ladigan ishlardan qaytarib shunday deydi: «Zinoga yaqinlashmanglar! Chunki bu buzuqlikdir va eng yomon yo‘ldir» (AlIsro surasi, 32).  
«Ular Alloh bilan birga boshqa biron ilohga duo-iltijo qilmaslar va Alloh (o‘ldirishni harom qilgan) biron jonni nohaq o‘ldirmaslar hamda zino qilmaslar. Kim mana shu (gunohlardan birontasini) qilsa, uqubatga duchor bo‘lur. Qiyomat kunida uning uchun azob bir necha barobar qilinur va u joyda xorlangan holida mangu qolur» (Furqon, 68–69).  
«Zinokor ayol va zinokor erkak – ulardan har birini yuz darradan uringlar...»  
Bundan tashqari ular bir yilga shaharlaridan badarg‘a qilinadilar. Bu haqda sahih hadis vorid bo‘lgan. «Agar sizlar Allohga va oxirat kuniga iymon keltirguvchi bo‘lsangizlar, Allohning (bu) hukmida (ya’ni, zinokorlarni darralashda) sizlarni ularga nisbatan rahm-shafqat (tuyg‘ulari) tutmasin!»  
Agar sizlarning Allohga va oxirat kuniga bo‘lgan iymoningiz haqiqiy bo‘lsa, u holda sekinroq yoki kamroq urish bilan Allohning zinokorlarga belgilagan jazosini bekor qilmanglar. Ularga rahmingiz kelmasin. Chunki zinokor rahm-shafqat ko‘rsatishga arzimaydigan yaramas, tuban jinoyatchidir.  
«Ularning azoblanishiga bir toifa mo‘minlar guvoh bo‘lsinlar!» (Nur surasi, 2).  
Shunda jinoyatchilar ham jisman, ham ruhan qiynaladilar. Boshqalar ham odamlar orasida sharmanda bo‘lishdan qo‘rqib, bu qabih ishdan o‘zlarini tiyadilar. Chunki ayrimlarga jazolanishdan ko‘ra, sharmanda bo‘lish kuchliroq ta’sir qilishi mumkin.  
Ulamolar aytadilar: «Mazkur jazo bo‘ydoq – oila qurmagan zinokorlarga taalluqlidir. Agar zinokorlar oilali yoki ilgari oila qurgan bo‘lishsa, ular toshbo‘ron qilib o‘ldiriladilar. Payg‘ambar sollallohu alayhi vasallam sunnatlarida bu hukm o‘z ifodasini topgan. Mabodo zinokorlar bu dunyoda jazolarini olmasalar va tavba qilmay o‘lsalar, u dunyoda do‘zaxda olov-qamchilar bilan azoblanadilar».  
Rasululloh sollallohu alayhi vasallam aytdilar: «Zinokor zino qilayotgan vaqtida mo‘min bo‘lmagan holida zino qiladi. O‘g‘ri o‘g‘rilik qilayotgan vaqtida mo‘min bo‘lmagan holida o‘g‘rilik qiladi. (Ichuvchi) xamr ichayotgan vaqtida mo‘min bo‘lmagan holida ichadi» (Muttafaqun alayh).  
Rasululloh sollallohu alayhi vasallam aytadilar: «Agar kishi zino qilsa, iymon undan chiqadi va unga soyabon kabi bo‘ladi. Agar (zinodan) bosh tortsa, iymon unga qaytadi» (Abu Dovud, Termiziy, Hokim rivoyati).",
'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
}
if($text == "Zino"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Abu Hurayra roziyallohu anhudan rivoyat qilinadi: Rasululloh sollallohu alayhi vasallam aytdilar: «Kimki zino qilsa yoki xamr ichsa, xuddi inson boshidan ko‘ylagini yechib olgandek, Alloh undan iymonni yechib oladi» (Hokim rivoyati, sahih hadis).  
Rasululloh sollallohu alayhi vasallam aytdilar: «Uch toifa odamga qiyomat kunida Alloh gapirmaydi, ularni (gunohlaridan) poklamaydi, ularga qaramaydi va ularga alamli azob bo‘lur. (Ular) zinokor qariya, yolg‘onchi podshoh va mutakabbir kambag‘al» (Muslim, Nasoiy rivoyati).  
Samura ibn Jundab roziyallohu anhu rivoyat qilgan hadisda aytilishicha, Payg‘ambar sollallohu alayhi vasallam tush ko‘rdilar. U zotning oldilariga Jabroil va Mikoil alayhissalomlar kelishdi. Nabiy aytadilar: «Yo‘lga tushdik va tandirga o‘xshagan narsa oldiga keldik. Undan shovqin-suron eshitilib turardi. Qarasak, uning ichida yalong‘och erkak va ayollar bor ekan. Ularga taglaridan olov kelib turarkan. Olov kelganda, qichqirar edilar... Tandirga o‘xshagan bino ichidagi yalong‘och erkak-ayollar zinokor erkak-ayollardir» (Buxoriy rivoyati).  
Zinokorlar qiyomatga qadar mazkur azobga giriftor bo‘lurlar. Allohdan afv va ofiyat tilaymiz.  
Ato (rahimahulloh) jahannam haqidagi: «Uning yettita darvozasi bo‘lur» (Hijr surasi, 44), oyatining tafsirida shunday deydilar: «Bu darvozalarning eng g‘amtashvishlisi, qayg‘ulisi, eng issig‘i va eng badbo‘yi – bilaturib zino qilgan zinokorlar kiradigan darvozadir».  
Makhul Dimashqiy (rahimahulloh) aytadilar: «Do‘zax ahliga juda ham badbo‘y hid keladi. Shunda ular: «Biz bu hiddan ko‘ra sassiqroq, badbo‘yroq hidni hidlamagan edik», deyishadi. Ularga: «Bu zinokorlar farjlarining hididir», deyiladi.  
Tafsir imomlaridan biri Ibn Zayd (rahimahulloh) aytganlar: «Aniqki, zinokorlar farjlarining hidi do‘zax ahliga ozor beradi».  
Rivoyat qilishlaricha, shayton qo‘shinlarini yer yuziga yubora turib: «Qaysi biringiz bir musulmonni yo‘ldan ozdirsangiz, uning boshiga toj kiydiraman», deydi. Ularning eng fitnakorrog‘i shaytonga eng yaqini bo‘ladi va uning oldiga kelib: «Falonchini vasvasa qilavergan edim, oxiri xotinini taloq qildi», deydi. Shayton: «Hech ish qilmabsan, u yaqinda boshqasiga uylanib oladi», deydi. So‘ng boshqasi kelib: «Falonchini vasvasa qilavergan edim, oxiri uni birodari bilan urishtirib qo‘ydim», deganida, u: «Hech ish qilmabsan, yaqinda qaytadan yarashib oladi», deydi. So‘ngra boshqasi kelib: «Falonchini tinmay vasvasa qilgan edim, oxiri u zino qildi», deydi. Shayton: «Juda zo‘r ish qilibsan», deb uni yoniga chorlaydi va boshiga toj kiydiradi. Shayton va qo‘shinlarining yomonligidan Alloh saqlasin.  
Abu Hurayra roziyallohu anhu rivoyat qiladilar: «Rasululloh sollallohu alayhi vasallam aytdilar: «Iymon bir libosdirki, Alloh uni xohlagan kimsasiga kiydiradi. Agar banda zino qilsa, undan libos yechib olinadi. Bordi-yu tavba qilsa, unga (iymon libosi) qaytariladi» (Abu Dovud, Termiziy rivoyati).  
Abu Muso roziyallohu anhu aytadilar: «Payg‘ambar sollallohu alayhi vasallam: «Kim ichkilikka mukkasidan ketgan holda vafot etsa, Alloh azza va jalla uni «Guvta» daryosidan sug‘oradi», dedilar. «Guvta» daryosi nima?» deb so‘rashdi. Shunda u zot sollallohu alayhi vasallam: «U fohishalarning farjlaridan oqadigan daryo bo‘lib, uning badbo‘yi do‘zax ahliga ozor beradi», dedilar» (Ibn Hibbon, Hokim rivoyati).",
'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
} 
if($text == "Zino"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Ya’ni, do‘zaxda fohishalarning farjlaridan qon, yiring oqadi. So‘ng mast qiluvchi ichimlikni ichishga odatlanib qolgan kimsalar shu jirkanch ichimlik bilan «siylanadilar».  
Rivoyat qilishlaricha, jahannamdagi bir vodiyda ilonlar bo‘ladi. Har bir ilonning yo‘g‘onligi tuyaning bo‘ynidek bo‘lib, ular namozni tark qiluvchilarni chaqadilar. Ularning zahari inson jismida yetmish yil o‘z ta’sirini ko‘rsatadi. So‘ng uning go‘shtlari shalvirab tushadi. Jahannamda «Jubbul huzn» (qayg‘u o‘rasi) deb nomlangan yana bir vodiy bo‘lib, u ilon va chayonlar makonidir. Har chayon xachirdek keladi. Uning yetmishta nishi bo‘lib, har bir nishi zaharga to‘la. U zinokorni chaqib zaharlaydi. Uning og‘rig‘i ming yil azob beradi. So‘ng zinokorning go‘shtlari titilib, farjidan qon, yiring oqadi. Rivoyatlarda kelganki, kim oilali ayol bilan zino qilsa, ularning har ikkisiga qabrda butun islom ummatiga beriladigan azobning yarmi beriladi. Qiyomatda esa Alloh taolo ayolning eri foydasiga hukm qiladi.  
Mazkur holat er bu ishdan bexabar bo‘lgan taqdirda ro‘y beradi. Agar erning xabari bo‘lsa-yu, sukut saqlasa, e’tibor bermasa, Alloh unga jannatni harom qiladi. Chunki Alloh taolo jannat darvozasiga: «Sen dayusga haromsan», deb yozib qo‘ygan.  
Ahli oilasining fahsh-buzuqlik qilishini bilaturib, sukut saqlaydigan va rashk-or qilmaydigan kimsa dayus hisoblanadi.  
Rivoyat qilishlaricha, kimki o‘ziga halol bo‘lmagan ayolni shahvat bilan ushlasa, qiyomat kunida qo‘li bo‘yniga bog‘langan holda keladi. Agar o‘psa, lablari olovda qirqiladi. Bordiyu zino qilsa, qiyomat kunida sonlari tilga kiradi-da, uning zarariga guvohlik beradi: «Men haromga mindim», deydi. Shunda Alloh taolo unga g‘azab ko‘zi bilan qaraydi. Bu qarashdan bandanidagi go‘shtlar erib tushadi. U sarkashlik qilib: «Men bu ishni qilmaganman», deydi. Unga qarshi tili guvohlik berib: «Men halol bo‘lmagan so‘zlarni so‘zlaganman», deydi. Qo‘llari: «Men haromni ushlaganman», desa, ko‘zlari: «Men haromga nazar tashlaganman», deydi. Oyoqlari: «Men halol bo‘lmagan ishga yurib borganman», deydi va farji: «Men qilganman», deydi. Yelkasidagi farishtalardan biri: «Men eshitganman», desa, ikkinchisi: «Men yozganman», deydi. Alloh taolo: «Men bilib, uni yashirganman», deydi. So‘ngra farishtalarga: «Uni ushlanglar va azobimdan tottiringlar. Darhaqiqat, behayo kimsaga g‘azabim kuchaydi», deb buyuradi. Quyidagi oyati karima bu fikrni tasdiqlaydi: «U kunda – qiyomatda qilib o‘tgan (amallari) sababli ularning tillari ham, qo‘l va oyoqlari ham o‘zlarining ziyonlariga guvohlik berur» (Nur surasi, 24).  
Ayrim zinolar boshqalaridan ulkandir: kishining onasi, opa-singlisi yoki boshqa mahrami bilan qilgan zinosi.  
Ibn Abbos roziyallohu anhudan rivoyat qilinadi: Rasululloh sollallohu alayhi vasallam aytdilar: «Kimki mahramiga yaqinlik qilsa, o‘ldiringlar» (Imom Ahmad rivoyati).  
Barro roziyallohu anhu aytadilar: «Tugun ko‘tarib kelayotgan amakimni uchratib qoldim. 
U kishidan: «Yo‘l bo‘lsin?» deb so‘ragan edim: «Rasululloh sollallohu alayhi vasallam meni otasining xotiniga (ya’ni, o‘gay onasiga) uylangan kimsaning oldiga yubordilar va uning bo‘ynini chopib, molini olishimni buyurdilar», deya javob berdilar» (Abu Dovud, Termiziy rivoyati).  
Alloh taolodan fazlu marhamati ila gunohlarimizni mag‘firat etishini so‘raymiz. Albatta, U marhamatli, saxovatli zotdir.",
'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
} 
if($text == "Bachavozlik"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"BACHCHAVOZLIK 
Alloh azza va jalla O‘zining ulug‘ kitobida Lut alayhissalom qavmi haqidagi qissani bir necha o‘rinda eslatib o‘tgan. Jumladan aytadi: «Endi qachonki Bizning farmonimiz (ya’ni, azobimiz) kelganida, u joylarni ostin-ustin qilib yubordik va ularning (kofirlarning) ustiga Parvardigoringiz dargohida belgilab qo‘yilgan sopol toshlarni paydar-pay yog‘dirdik. U joylar bu zolimlardan (Makka mushriklaridan) yiroq emasdir» (Hud surasi, 82–83).  
Islom ummatining zolimlari ham ularning «hunari»ni takrorlasalar, ular kabi jazolanishlari hech gap emas. Shuning uchun ham Payg‘ambar sollallohu alayhi vasallam aytgan edilarki: «Ummatim xususida qo‘rqqan narsalarimning eng qo‘rqinchlirog‘i Lut qavmining amalidir» (Ibn Moja rivoyati).  
Boshqa bir hadisi sharifda esa: «Lut qavmi amalini qilgan kimsani Alloh la’natlasin», deb uch bora takrorlaganlar (Ibn Hibbon rivoyati).  
Yana bir hadisda: «Lut qavmi amalini qiladigan kimsalarni uchratsangiz, qiluvchini ham, qildiruvchini ham o‘ldiringlar», deyilgan (Abu Dovud, Termiziy, Ibn Moja, Bayhaqiy rivoyati).  
Ibn Abbos roziyallohu anhumo aytganlar: «Bachchavozlarni Lut qavmi jazolagani singari, qishloqdagi eng baland binodan uloqtiriladi. So‘ng ustlaridan tosh yog‘diriladi».  
Alloh taolo payg‘ambari Lut alayhissalomning qavmi bilan munozara qilgani haqida xabar berib, shunday deydi: «Sizlar butun olamlardan (ajrab – hech bir jonzot qilmagan ishni qilib, ayollarga uylanish o‘rniga) erkaklarga yaqinlashurmisizlar?! Va Parvardigoringiz sizlar uchun yaratgan jufti halollaringizni tark qilurmisizlar?! Yo‘q, sizlar haddan oshguvchi qavmdirsizlar» (Shuaro surasi, 165–166).  
Sizlar hech bir jonzot qilmaydigan ishni qilib, ya’ni, ayollarni qo‘yib erkaklarga yaqinlik qilish bilan insoniylik chegarasidan chiqib, hayvon darajasiga tushib qoldinglar. Hattoki hayvon ham bu ishdan jirkanadi. Sizlar hayvonlardan ham tuban, yaramas kimsalarsiz.  
«...va uni nopokliklar qiluvchi bo‘lgan qishloq (ahli)dan najot berdik. Darhaqiqat, ular yomon buzuq qavm edilar» (Anbiyo surasi, 74).  
Qishloqlarining nomi «Sadum» bo‘lib, ular Alloh taolo O‘z kitobida zikr qilganidek nopok ishlar bilan mashg‘ul bo‘lardilar. Ular butun mavjudotlar ichida hech bir jonzot qilmagan ishni qilib, erkaklarning orqasiga yaqinlik qilar va boshqa munkar ishlarni amalga oshirar edilar.",
 'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
} 
if($text == "Bachavozlik"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Ibn Abbos roziyallohu anhumo aytgan ekanlar: «O‘nta xislat Lut qavmi amallaridandir: sochni silliq qilib tarash, tugmalarni qadamay yurish, yong‘oq otish, mayda tosh otish, kaptar uchirib o‘ynash, barmoqlar bilan hushtak chalish, bo‘g‘imlarni qirsillatish, izor (ishton)ni uzun qilib sudrab yurish, ustki kiyimlar (chakmon)ning orqasini kesish, mast qiluvchi ichimliklar ichishga mukkasidan ketish va erkaklarga yaqinlik qilish».  
Rivoyat qilishlaricha, to‘rt toifa odamlar Allohning g‘azabiga duchor bo‘lgan holda tong orttirib, Allohning qahrini keltirgan holda kunni kech qiladilar: O‘zlarini erkaklarga o‘xshatuvchi ayollar, o‘zlarini ayollarga o‘xshatuvchi erkaklar, hayvonga yaqinlik qiluvchi kimsa va erkaklarga yaqinlik qiluvchi kimsa.  
Rivoyat qilishlaricha, agar bir erkak boshqa bir erkakning ustiga chiqsa, Arsh Alloh taoloning g‘azabidan qo‘rqqanidan titrab ketadi. Osmonlar ham yerga qulab tushishiga bir bahya qoladi. Shunda farishtalar osmonning har tarafidan tutib: «Qul huvallohu ahad»ni oxirigicha o‘qiydilar. Shundagina, Alloh azza va jallaning g‘azabi bosiladi.  
Asarlardan birida kelganki, yetti toifa odamlarga Alloh qiyomat kunida qaramaydi, ularni (gunohlaridan) poklamaydi, butun olamlar (barcha mavjudotlar) bilan birga to‘plamaydi va ularni do‘zaxga birinchilar qatorida kirgizadi. Agar tavba qilsalar, bu uqubatlardan xalos bo‘ladilar. Zero, kimki tavba qilsa, Alloh uning tavbasini qabul qiladi. (Ular:) qo‘liga aloqa qiluvchi va qildiruvchi, mast qiluvchi narsalarga mukkasidan ketgan kimsa, otaonasiga qo‘l ko‘taruvchi, hattoki ular uning dastidan dod deydilar, qo‘shnilariga ozor beruvchi, hattoki uni odamlar la’natlaydilar va qo‘shnisining xotini bilan aloqa qiluvchi kimsa.  
Rivoyat qilishlaricha, qiyomat kunida bir toifa odamlar zinodan qo‘llari homilador bo‘lgan holda tiriladilar. Ular bu dunyoda olatlarini o‘ynagan bo‘ladilar.  
Yana bir rivoyatda keladiki, quyidagilar Lut alayhissalom qavmi amallaridandir: narda o‘ynash, kaptar uchirib musobaqa qilish, it urishtirish, qo‘chqor suzishtirish, xo‘roz urishtirish, hammomga lungisiz kirish, o‘lchov va tarozidan urib qolish. Bu ishlardan birontasini qilgan kimsaga vayl bo‘lsin.  
Ibn Abbos roziyallohu anhu aytgan ekanlar: «Agar bachchavoz tavba qilmay o‘lsa, qabrda to‘ng‘izga aylanadi».  
Rasululloh sollallohu alayhi vasallam aytdilar: «Erkak yoki ayolning orqasiga yaqinlik qilgan kimsaga Alloh azza va jalla qaramaydi» (Termiziy, Nasoiy, Ibn Moja rivoyati).  
Abu Said Sa’lukiy aytgan ekanlar: «Yaqinda bu ummatda «bachchavoz» degan qavm paydo bo‘ladi. Ular uch toifa bo‘lib, bir toifasi qaraydigan, boshqa toifasi qo‘l ushlaydigan, uchinchi toifasi mana shu ishni qiladigan bo‘ladi».  
Ayol va o‘spiringa shahvat bilan qarash ham zinodir. Chunki Rasululloh sollallohu alayhi vasallam aytganlarki: «Odam farzandiga zinodan bo‘lgan nasibasi bitilgan bo‘lib, u bu nasibasiga, shak-shubhasiz yetishguvchidir: ikki ko‘zning zinosi – qarash, ikki quloqning zinosi – eshitish, tilning zinosi – so‘zlash, qo‘lning zinosi – ushlash, oyoqning zinosi – yurib borish, qalb – xohlaydi, farj esa buni tasdiqlaydi yoki inkor etadi» (Buxoriy va Muslim rivoyati).  
Shu sababli ham solih zotlar o‘spirinlarga qarash, ular bilan aralashib yurish va birga o‘tirishdan qattiq saqlanganlar",
'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
} 
if($text == "Bachavozlik"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Hasan ibn Zakvon aytganlarki: «Boylarning bolalari bilan majlis qurmanglar (birga o‘tirmanglar). Zero, ular bokira ko‘rinishga ega bo‘lib, ayollarga qaraganda fitnakorroqdirlar».  
Tobe’inlardan biri aytgan ekan: «Mening nazdimda taqvodor yigit uchun yirtqich hayvondan ko‘ra yosh o‘spirin xatarliroq». Ba’zilar: «Erkak kishi o‘spirin bilan hech qachon bir joyda tunamasin», degan ekanlar.  
Ayrim ulamolar o‘spirinlarni ayollarga qiyos qilib, ular bilan uy, do‘kon yoki hammomda holi qolishni harom deb hisoblaganlar. Zero, Payg‘ambar sollallohu alayhi vasallam aytgan edilarki: «Birontangiz mahrami hozir bo‘lmagan ayol bilan xoli qolmangiz» (Muttafaqun alayh).  
Xabarlardan aytilishicha, nazar – zinoning elchisidir.  
Nazar iblisning zaharli paykonlaridan bir paykon bo‘lib, kimki uni Alloh uchun tark etsa, unga shunday ibodatni beradiki, u qalbida ibodat halovatini tuyadi.  
Islom ummati quli bilan shu nopok ishni qilgan kimsa ham bachchavoz, gunohkor bo‘lishiga ijmo’ qilgan.  
Fasl  
Xolid ibn Valid chekka arab yerlarida ayol singari erga tegadigan bir kishini uchratganini Abu Bakr Siddiq roziyallohu anhuga xabar qildi. Abu Bakr roziyallohu anhu maslahatlashish uchun Rasululloh sollallohu alayhi vasallam ashoblarini to‘pladilar. Shunda Ali ibn Abu Tolib roziyallohu anhu: «Bu gunohni faqatgina bir ummat sodir etgan. Alloh ularni qanday jazolaganini o‘zingiz yaxshi bilasiz. Uni yoqib yuborish kerak, deb o‘ylayman», dedilar. Rasululloh sollallohu alayhi vasallamning ashoblari bu fikrni ma’qulladilar. Abu Bakr roziyallohu anhu uni yoqib yuborishni buyurdilar» (Bayhaqiy rivoyati).  
Ali roziyallohu anhu aytgan ekanlar: «Kimki xohish bilan o‘ziga yaqinlik qilishlariga imkon bersa, Alloh unga ayollar shahvatini tashlaydi va uni qabrida qiyomat kunigacha toshbo‘ron qilib haydalgan shaytonga aylantirib qo‘yadi».  
Rivoyat qilishlaricha, Iso ibn Maryam alayhissalom sayohatlari davomida olovda kuyayotgan bir kishini ko‘rib qoldi. Iso alayhissalom suv olib olovni o‘chirmoqchi bo‘lganlarida olov bolaga, kishi esa olovga aylanib qoldi. Bundan hayratlangan Iso alayhissalom: «Ey Rabbim, ularni dunyodagi holiga qaytar, toki ularga nima bo‘lganini so‘rab olayin», deb duo qildilar. Alloh taolo ularni tiriltirdi. Ular bir kishi va bir bola ekan. 
Iso alayhissalom ulardan: «Sizlar nima qilgansizlar?» deb so‘ragan edilar, haligi kishi: «Ey Ruhulloh, men dunyoda bu bolaga oshiqu beqaror bo‘lganman. Shahvatim qo‘zib, u bilan buzuqlik qilganman. Ikkimiz ham o‘lganimizdan beri bir safar bola olovga aylanib meni kuydiradi, bir safar men olovga aylanib bolani kuydiraman. Qiyomat kuniga qadar biz shunday azoblanamiz», deya javob berdi. Allohning O‘zi azobiga duchor bo‘lishimizdan saqlasin. U zotdan afv va ofiyat hamda O‘zi rozi bo‘ladigan, yaxshi ko‘radigan amallarga muvaffaq etishini so‘raymiz.  
Fasl  
Ayolning orqasiga yaqinlik qilish ham bachchavozlik hisoblanib, bu ish Alloh va Rasuli harom qilgan amallardandir.  
Alloh azza va jalla aytgan: «Xotinlaringiz sizlar uchun ekinzordir. Bas, ekinzoringizga xohlagan holatingizda yaqinlashavering» (Baqara surasi, 223).  
Ya’ni, xohlasangiz old tarafdan, xohlasangiz orqa tarafdan, faqat bir o‘ringa – farjga. Zero, u ziroatgoh, urug‘lik tashlaydigan o‘rin hisoblanadi. Orqa esa najosat o‘rnidir. Orqaga yaqinlik qilish nopok, jirkanchli ishdir.  
Mazkur oyatning nozil bo‘lish sababi quyidagichadir: «Payg‘ambar sollallohu alayhi vasallam zamonlaridagi yahudiylar: «Agar er xotinining oldiga orqa tomonidan yaqinlik qilsa, bola g‘ilay bo‘ladi», deyishar edi. Bu oyat ularning da’volarini inkor qilib tushgan. «Xotinlaringiz ziroatgohingizdir. Bas, ziroatgohingizga xohlagan holatingizda yaqinlashavering». Xohlasa yuz tuban yotib, xohlasa yuz tuban yotmay, biroq bu ish bir o‘ringa qilinishi lozim» (Muslim rivoyati).  
Bir rivoyatda: «Orqaga va hayz ko‘rayotganga yaqinlik qilishdan saqlaninglar», deyilgan.  
Abu Hurayra roziyallohu anhu aytadilar: «Rasululloh sollallohu alayhi vasallam: «Xotinining orqasiga yaqinlik qilgan kimsa mal’undir», dedilar» (Abu Dovud rivoyati).",
'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
} 
if($text == "O'girlik"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"O‘G’IRLIK 
Alloh taolo aytadi: «O‘g‘ri erkakni ham, o‘g‘ri ayolni ham qo‘llarini kesinglar! (Toki bu) ularning qilmishlariga yarasha jazo bo‘lsin, Alloh tomonidan berilgan azob bo‘lsin. Alloh qudrat va hikmat egasidir» (Moida surasi, 38).  
Rasululloh sollallohu alayhi vasallam aytganlar: «Zinokor zino qilayotgan vaqtida mo‘min bo‘lmagan holida zino qiladi. O‘g‘ri o‘g‘irlik qilayotgan vaqtida mo‘min bo‘lmagan holida o‘g‘irlik qiladi. Ichuvchi xamr ichayotgan vaqtida mo‘min bo‘lmagan holida ichadi. Biroq tavba hali ham taklif qilingandir» (Buxoriy, Muslim, Abu Dovud rivoyati).  
Ibn Umar roziyallohu anhu aytganlar: «Payg‘ambar sollallohu alayhi vasallam qiymati uch dirham bo‘lgan qalqon sababli (qo‘lni) kesganlar» (Jamoat rivoyat qilgan).  
Oisha (roziyallohu anho) aytganlar: «Rasululloh sollallohu alayhi vasallam chorak dinor va undan qiymatli (narsalar) uchun o‘g‘rining qo‘lini kesar edilar» (Jamoat rivoyat qilgan).  
Nasoiyning rivoyatida: «Qalqon qiymatidan arzon narsalar uchun o‘g‘rining qo‘li kesilmaydi», deyilgan. Oisha (roziyallohu anho)dan: «Qalqonning qiymati qancha?» deb so‘rashganda: «Chorak dinor», deya javob berganlar.",
 'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
} 
if($text == "O'girlik"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Imom Ahmadning rivoyatida: «Chorak dinor sababli (o‘g‘rining qo‘lini) kesinglar. Bundan qiymatsiz, arzon bo‘lgan narsalar sababli kesmanglar», deyilgan.  
U paytda bir dinor – o‘n ikki dirham, chorak dinor esa uch dirham bo‘lgan.  
Rasululloh sollallohu alayhi vasallam: «Alloh o‘g‘rini la’natlasin: dubulg‘a o‘g‘irlaydi-da, qo‘li kesiladi, arqon o‘g‘irlaydi-da, qo‘li kesiladi», deganlar.  
A’mash (rahimahulloh) aytganlarki: «Ular «dubulg‘a» deganda temir dubulg‘ani, «arqon» deganda bir necha dirham turadigan arqonni nazarda tutishgan» (Buxoriy, Muslim, Ahmad rivoyati).  
Oisha (roziyallohu anho) aytadilar: «Maxzum qabilasidan bo‘lgan bir ayol qarzga narsa olib uni qaytarmas, tan olmas edi. Payg‘ambar sollallohu alayhi vasallam uning qo‘lini kesishni buyurdilar. Ayolning qarindosh-urug‘lari Usoma ibn Zaydning oldiga kelib, u bilan gaplashishdi. Usoma Payg‘ambar sollallohu alayhi vasallamga ayol haqida gapirgan edi, u zot sollallohu alayhi vasallam: «Ey Usoma, Alloh azza va jallaning hadlaridan bironta had borasida ham o‘rtaga tushganingni ko‘rmayin», dedilar. So‘ng turib odamlarga qarata shunday hitob qildilar: «Albatta, sizlardan oldin o‘tganlar agar oralarida sharafli, obro‘li kishi o‘g‘irlik qilsa afv etib, zaif kishi o‘g‘irlik qilsa, qo‘lini kesganlari sababli halok bo‘lganlar. Jonim qo‘lida bo‘lgan Zotga qasamki, agar o‘g‘ri Muhammadning qizi Fotima bo‘lganida ham, albatta, qo‘lini kesgan bo‘lardim». Keyin o‘g‘ri ayolning qo‘li kesildi» (Ahmad, Muslim, Nasoiy rivoyati). Ulamolar aytadilarki, o‘g‘irlagan narsani egasiga qaytarmas ekan, o‘g‘rining tavbasidan hech naf yo‘q. Agar hech vaqosi bo‘lmasa, molning egasidan rozilik olishi shart. Vallohu a’lam.",
'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
} 
if($text == "Aroq ichish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"XAMR (MAST QILUVCHI ICHIMLIK) ICHISH 
Alloh taolo aytadi: «Ey mo‘minlar, aroq (mast qiluvchi ichkilik ichish), qimor (o‘ynash), butlar(ga sig‘inish) va cho‘plar (bilan fol ochish) shayton amalidan bo‘lgan harom ishdir. Bas, ularning har biridan uzoq bo‘lingiz, shoyad najot topsangiz! Aroq, qimor sababli shayton o‘rtalaringizga bug‘zu adovat solishni hamda sizlarni Allohni zikr qilishdan va namoz o‘qishdan to‘sishni istaydi, xolos! Endi to‘xtarsizlar!» (Moida surasi, 90–91).  
Alloh azza va jalla mazkur oyatlarda xamrdan ogohlantirdi, qaytardi.  
Ibn Abbos roziyallohu anhudan rivoyat qilinadi: Rasululloh sollallohu alayhi vasallam: «Xamrdan saqlaninglar. Zero, u barcha yomonlikning kalitidir», deganlar (Hokim rivoyati).  
Kimda-kim undan saqlanmas ekan, batahqiq, u Alloh va Rasuliga osiylik qilgan va bu bilan azobga sazovor bo‘lgan bo‘ladi. Alloh taolo aytadi: «Kim Alloh va Rasuliga itoatsizlik qilib, Allohning belgilab qo‘ygan hadlaridan tajovuz qilsa, uni abadiy qoladigan joyi bo‘lmish do‘zaxga kiritur. Va uning uchun xor qilguvchi azob bordir» (Niso surasi, 14).  
Ibn Abbos roziyallohu anhumo aytadilar: «Xamr harom qilingach, Rasululloh sollallohu alayhi vasallamning ayrim sahobalari boshqalarining oldiga borib: «Xamr harom qilindi va shirkka tenglashtirildi», dedilar» (Tabaroniy, Hokim rivoyati).  
Xamr, shak-shubhasiz, barcha nopok ishlarning onasi bo‘lib, ko‘plab hadislarda uni ichgan odam la’natlangandir.  
Rasululloh sollallohu alayhi vasallam aytdilar: «Har bir mast qiluvchi narsa xamrdir va har bir mast qiluvchi narsa haromdir. Kimki bu dunyoda xamr ichsa va uni ichishga odatlangan holda vafot etsa, oxirat sharobini ichmaydi» (Buxoriy, Muslim, Abu Dovud, Termiziy rivoyati).  
Jobir roziyallohu anhu aytadilar: «Rasululloh sollallohu alayhi vasallam: «Har bir mast qiluvchi narsa haromdir. Mast qiluvchi ichimlikni ichgan kishini «Tiynatul xobal»dan (chiqindilar aralashmasi) sug‘orish xususida Alloh huzurida ahd, qat’iy qaror bor», dedilar. «Yo Rasululloh, «Tiynatul xobal» nima?» deb so‘rashgan edi, «Do‘zax ahlining terlari yoki do‘zax ahlidan ajralgan suyuqliklar», deya javob berdilar» (Muslim rivoyati).  
Yana Rasululloh sollallohu alayhi vasallam aytdilarki: «Kim bu dunyoda xamr ichsa-yu, so‘ng u uchun tavba qilmasa, oxiratda sharobdan mahrum bo‘ladi» (Muslim rivoyati).  
Ibn Abbos rivoyat qilinadi:Rasululloh sollallohu alayhi vasallam: «Kimda-kim xamrga mukkasidan ketgan holda Allohga yo‘liqsa, U zotga xuddi butparast singari yo‘liqibdi», dedilar» (Ibn Hibbon rivoyati).  
Ya’ni, xamr ichishni halol deb bilgan kimsa butparast bilan barobardir.  
Xamrga mukkasidan ketgan kimsa tavba qilmay vafot etsa, jannatga kirmasligi xususida Abu Dardo roziyallohu anhu Rasululloh sollallohu alayhi vasallamdan rivoyat qiladilar: «Xamrga mukkasidan ketgan kimsa jannatga kirmaydi!»",
  'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
} 
if($text == "Aroq ichish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Boshqa bir hadisda: «Uch toifa odam jannatga kirmaydi: xamrga mukkasidan ketgan, qarindosh-urug‘chilik aloqalarini uzgan va sehrni tasdiq qilgan kimsa», deyilgan (Imom Ahmad, Tabaroniy va Abu Ya’lo rivoyati).  
Alloh mastning bironta yaxshiligini qabul qilmaydi. Bu xususda Jobir ibn Abdulloh roziyallohu anhudan rivoyat qilingan hadisda Rasululloh sollallohu alayhi vasallam aytadilar: «Uch toifa odamning namozini Alloh qabul qilmaydi va ularning bironta yaxshiligi osmonga ko‘tarilmaydi: qochoq qulning, to xo‘jayiniga qaytib, qo‘lini uning qo‘liga qo‘ymagunicha, erini g‘azablantirgan – norozi qilgan ayolning, to eri undan rozi bo‘lmagunicha va mastning, to o‘ziga kelmagunicha» (Tabaroniy, Ibn Hibbon, Ibn Huzayma, Bayhaqiy rivoyati).  
Ibn Umar rivoyat qiladilar: «Rasululloh sollallohu alayhi vasallam: «Kim xamr ichsa, qirq kungacha namozi qabul qilinmaydi. Agar tavba qilsa, Alloh tavbasini qabul qiladi. Bordiyu qaytib ichsa, qirq kungacha namozi qabul qilinmaydi. Agar tavba qilsa, Alloh tavbasini qabul qiladi. Yana ichsa, qirq tong uning namozi qabul qilinmaydi. Agar tavba qilsa, Alloh tavbasini qabul qiladi. Mabodo, to‘rtinchi marta qaytib ichsa, qirq kungacha namozi qabul qilinmaydi. Agar tavba qilsa, Alloh tavbasini qabul qilmaydi. Alloh undan g‘azablanadi va uni Xobal daryosidan sug‘oradi», dedilar».  
Bir kishi Ibn Umar roziyallohu anhudan: «Ey Abu Abdurahmon, Xobal daryosi nima?» deb so‘ragan edi, u: «Do‘zax ahlining yiringlari oqadigan daryo», deb javob berdilar 
(Termiziy, Hokim rivoyati).  
Xamr ichgan kimsa uni ichayotgan vaqtida mo‘min bo‘lmaydi. Bu xususda Abu Hurayradan quyidagi hadis vorid bo‘lgan: «Rasululloh sollallohu alayhi vasallam aytdilar: «Zinokor mo‘min bo‘lmagan holida zino qiladi. O‘g‘ri mo‘min bo‘lmagan holida o‘g‘irlik qiladi. (Ichuvchi) mo‘min bo‘lmagan holida ichadi. Biroq hali ham tavba taklif qilingandir» (Buxoriy, Muslim, Abu Dovud rivoyati).  
Rasululloh sollallohu alayhi vasallam aytdilar: «Kimki zino qilsa yoki xamr ichsa, xuddi inson boshidan ko‘ylagini yechib olganidek, Alloh undan iymonni yechib oladi» (Hokim rivoyati).     Abu Muso roziyallohu anhudan rivoyat qilinadi: Rasululloh sollallohu alayhi vasallam: «Uch toifa odam jannatga kirmaydi: xamrga mukkasidan ketgan, qarindosh-urug‘chilik aloqalarini uzgan va sehrni tasdiqlagan kimsa. Kimki xamrga mukkasidan ketgan holida vafot etsa, Alloh uni «Guvta» daryosidan sug‘oradi», dedilar. «Guvta» daryosi nima?» deb so‘rashgan edi, «U fohishalarning farjlaridan oqadigan daryo bo‘lib, do‘zax ahliga ozor beradi», deya javob berdilar (Ahmad, Abu Ya’lo, Tabaroniy rivoyati).  
Xamr sababli la’natlangan kimsalar xususida Ibn Umar roziyallohu anhumodan vorid bo‘lgan hadis hujjat bo‘ladi: «Rasululloh sollallohu alayhi vasallam: «Alloh xamrni ham, uni ichuvchini ham, quyuvchini ham, sotib oluvchini ham, sotuvchini ham, tayyorlatuvchini ham, olib keluvchini ham, olib keltiruvchini ham la’natladi» (Abu Dovud rivoyati).  
Ibn Mojaning rivoyatida: «Pulini yeyuvchini ham», deyilgan.  
Ibn Abbos aytadilar: «Rasululloh sollallohu alayhi vasallamning shunday deganlarini eshitdim: «Oldimga Jabroil kelib: «Ey Muhammad, albatta Alloh xamrni ham, uni siqtiruvchini ham, siquvchini ham, ichuvchini ham, olib keluvchini ham, olib keltiruvchini ham, sotuvchini ham, sotib oluvchini ham, quyuvchini ham va quydiruvchini ham la’natladi», dedi» (Ahmad, Ibn Hibbon, Hokim rivoyati).  
Xamr ichuvchilar kasal bo‘lsa, ziyorat qilinmaydi va ularga salom berilmaydi. Abdulloh ibn Amr roziyallohu anhu: «Xamr ichuvchilar kasal bo‘lsa, ziyorat qilmanglar», deganlar.  
Ibn Umar roziyallohu anhumo: «Xamr ichuvchilarga salom bermanglar», deb aytganlar (Buxoriy rivoyati).  
Rivoyatlarda keladiki: «Xamr ichuvchilar bilan birga o‘tirmanglar, kasal bo‘lsa, ziyorat qilmanglar va janozalariga qatnashmanglar. Zero, xamr ichuvchi qiyomat kunida yuzi qoraygan, tili ko‘ksiga osilgan, so‘lagi oqqan holda keladi. Uni ko‘rgan har bir kimsa undan jirkanadi va uning xamr ichuvchi ekanini bilib oladi».  
Ba’zi ulamolar aytgan ekanlar: «Ularni ziyorat qilish va salom berish man qilinganining boisi, xamr ichuvchi mal’un, fosiqdir. Agar u sotib olib ichsa, ikki marta mal’un, bordi-yu, boshqa birovga ham quyib bersa, uch marotaba mal’un bo‘ladi. Agar tavba qilsalar, ularni ziyorat qilish va salom berish joizdir. Kimki tavba qilsa, Alloh uning tavbasini qabul qiladi.",
'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
} 
if($text == "Aroq ichish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Xamr bilan davolanish mumkin emas. Bu xususda mazkur hadislar so‘zimizga hujjat bo‘ladi:  
Ummu Salama (roziyallohu anho) aytdilar: «Qizim betob bo‘lib qolgan edi, bir idishga xurmo solib qaynata boshladim. Shu vaqt Payg‘ambar sollallohu alayhi vasallam kirib keldilar va: «Bu nima?» deb so‘radilar. Men: «Qizim betob bo‘lib qoldi, buni unga tayyorlayotgan edim», deya javob berdim. Shunda u zot sollallohu alayhi vasallam: «Alloh azza va jalla harom narsani davo qilmagan», dedilar (Abu Ya’lo, Bazzor rivoyati).  
Voil ibn Hijr roziyallohu anhu aytadilar: «Toriq ibn Suvayd Ja’fiy Payg‘ambar sollallohu alayhi vasallamdan xamr haqida so‘ragan edi, uni taqiqladilar: «Uni davo uchun tayyorlayman, axir», degan edi, «U davo emas, aksincha, darddir», deya javob berdilar» (Ahmad, Muslim, Abu Dovud, Termiziy rivoyati).  
Rivoyat qiladilarki, kimning qalbida Allohning Kitobidan birgina oyat bo‘lsa-yu, u kimsa uning ustidan xamr quysa, qiyomat kuni shu oyatning har bir harfi kelib, o‘sha kimsani peshona sochidan tortadi-da, uni Alloh taboraka va taoloning huzuriga olib boradi va u bilan xusumatlashadi. Holbuki, Qur’on kim bilan bahslashsa, uni, albatta yengadi. Qiyomat kunida xusumatchisi Qur’on bo‘lgan kimsaga vayl bo‘lsin.  
Rivoyat qilishlaricha, qaysi bir jamoat bu dunyoda mast qiluvchi narsa ustida to‘plansalar, Alloh ularni do‘zaxda to‘playdi. Shunda ular bir-birlarini malomat qila boshlaydilar. Biri ikkinchisiga: «Ey falonchi, Alloh seni yaxshi mukofot bilan siylamasin. Bu joyga tushishimga sen sababchi bo‘lding», desa, ikkinchisi uning o‘ziga shu gapni qaytaradi.     Rivoyat qiladilarki, kimda-kim bu dunyoda xamr ichsa, Alloh uni ilonlarning zahari bilan sug‘oradi. U hali ichmasidan turib, yuzidagi go‘shtlari idishga erib tushadi. Ichganidan keyin esa butun terisi-yu, go‘shtlari erib tushadi va do‘zax ahli undan ozorlanadi. Ogoh bo‘linglar, uni ichuvchi ham, siqtiruvchi ham, siquvchi ham, olib keluvchi ham, olib keltiruvchi ham, pulini yeyuvchi ham uning gunohiga sherikdirlar. Toki tavba qilmas ekanlar, Alloh ularning namozini ham, ro‘zasini ham, hajini ham qabul qilmaydi. Bordiyu, tavba qilmay vafot etsalar, bu dunyoda ichgan har bir qultum xamrlari evaziga jahannam yiringi bilan sug‘orishga Alloh to‘la haqli bo‘ladi. Ogoh bo‘linglar (bilib qo‘yinglar), har bir mast qiluvchi narsa xamrdir va har bir xamr haromdir.  
Rivoyat qilinadiki, xamr ichuvchilar pulsirotga kelganlarida zaboniyalar (azob farishtalari) ularni tutib, Xobal daryosiga olib boradilar-da, ularni ichgan har bir qadah xamrlari evaziga bir qultumdan sug‘oradilar. Mabodo, uning bir qultumi osmonga to‘kilib ketsa, uning haroratidan osmonlar yonib ketadi. Alloh saqlasin.  
Abdulloh ibn Abu Avfo (rahimahulloh): «Kimki xamrga mukkasidan ketgan holida vafot etsa, Lot va Uzzoga (mushriklar sig‘ingan butlar) ibodat qilgandek vafot etibdi», dedilar. «Xamrga mukkasidan ketgan», deganda, ichmasa, turolmaydigan odamni nazarda tutyapsizmi?» deb so‘rashgan edi, «Yo‘q, oradan bir necha yil o‘tsa-da, topganda ichadigan kimsani», deya javob berdilar.  
Abdulloh ibn Amr roziyallohu anhu xamr ichishni gunohi kabiralarning eng kattasi deb bilganlar.  
Abdulloh ibn Umar roziyallohu anhumo aytadilar: «Abu Bakr, Umar va boshqa kishilar Payg‘ambar sollallohu alayhi vasallam vafot etganlaridan keyin o‘tirib eng ulkan gunohi kabiralar haqida zikr qildilar. Bu borada ular ilmsiz bo‘lib, meni Abdulloh ibn Amrdan so‘rab kelish uchun yubordilar. U kishi menga: «Eng katta gunohi kabira xamr ichish», dedilar. Qaytib kelib ularga bu gapni aytgan edim, buni inkor qilishdi va barchalari turib uning hovlisiga yo‘l olishdi. U kishi: «Rasululloh sollallohu alayhi vasallam shunday deganlar: «Bani Isroil podshohlaridan biri bir kishini tutib, uni xamr ichish yoki odam o‘ldirish, yoki zino qilish, yoxud to‘ng‘iz go‘shtini yeyish va yo o‘zini qatl etishlaridan birini tanlash ixtiyorini bergan edi, u xamrni tanladi. Xamrni ichganidan keyin esa, undan nimani talab qilishsa, tap tortmadi. Yana Rasululloh sollallohu alayhi vasallam aytdilar: «Kimda-kim xamr ichsa qirq kecha uning namozi qabul qilinmaydi. Qovug‘ida biron tomchi xamr bo‘lgan holida vafot etsa, aniqki, u sababli unga jannat harom bo‘ladi. Bordi-yu, u qirq kecha mobaynida vafot etsa, johiliyat o‘limida o‘lgan bo‘ladi», deb ularga xabar berdilar» (Tabaroniy, Hokim rivoyati).  
Xamr aqlni o‘tmaslashtiradigan, aql ko‘zini ko‘r qiladigan narsa bo‘lib, uning ho‘lu qurug‘i, yeyimligu ichimligi bir xil zararlidir.  
Nasha o‘simligi yaprog‘idan tayyorlanadigan narsa (nasha) ham harom bo‘lib, xamr ichgan kishi singari, uni chekkan kishiga ham had-darra uriladi. Chunki u ham «Har bir mast qiluvchi narsa xamrdir» hadisiga binoan xamrning bir turidir.  
Nasha aql va fe’l-atvorni buzib, kishini dayus, xotinchalish qilib qo‘yishi va bundan boshqa salbiy xususiyatlari bilan xamrdan battarroq bo‘lsa, xamr urish-janjal, qotillikka olib borishi bilan nashadan yomonroqdir. Biroq ikkalasi ham Allohni zikr qilishdan va namozdan to‘sadi.  
Nasha suyuq emas, quyuq narsa bo‘lgani bois, ulamolar uning pok yoki najasligi hususida uch xil fikrni bildirganlar: 1) nasha ham aroq kabi najosatdir. Sahih hukm shudir; 2) uning qurug‘i pok, suyug‘i najasdir; 3) quyug‘ining suyug‘idan farqi bor;  
Har qanday holatda ham nasha Alloh va Rasuli harom qilgan mast qiluvchi xamr safiga kiradi.  
Abu Muso roziyallohu anhu aytadilar: «Yo Rasululloh, biz Yamanda tayyorlaydigan ikki ichimlik haqida fatvo bering. Biri «bit’a» deb nomlanib, asaldan tayyorlanadi, ikkinchisi «mizar», deb atalib, zarra va arpadan tayyorlanadi», dedim. Rasululloh sollallohu alayhi vasallam juda balog‘at va fasohat bilan so‘zlar edilar. U zot sollallohu alayhi vasallam: «Namozdan chalg‘itadigan har bir mast qiluvchi narsadan qaytaraman», dedilar».  
Rasululloh sollallohu alayhi vasallam aytganlar: «Ko‘pi mast qiladigan narsaning ozginasi ham haromdir» (Ahmad, Ibn Moja, Doriqutniy rivoyati).",
'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
} 
if($text == "Aroq ichish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Rasululloh sollallohu alayhi vasallam mast qiladigan narsalarni, quyuq yoki suyuq bo‘lsin, bir-biridan ajratmaganlar (ya’ni, hammasini harom deganlar). Bundan tashqari, unni aroqqa qorib, non qilib yeydiganlar va nashani suvga ezib ichadiganlar ham bor.  
Salaf ulamolari nashani zikr qilmaganlarining sababi ularning davrida nasha iste’mol qilinmagan. Bu narsa mo‘g‘ullar Islom shaharlariga kelganlaridan so‘ng yuzaga chiqqan.  
Nasha haqida she’r ham to‘qilgan bo‘lib, uning mazmuni quyidagicha: «Johil bo‘lib nasha chekadiganlarga ayt: «Uni chekib juda xunuk umr kechirding. Kishining qadr-qiymati gavhardir, Ey johil, nima uchun uni nashaga sotding».  
Allohga qasamki, iblis nashadan shod bo‘lganidek boshqa narsadan quvonmagan. Chunki pastkash kimsalarga ziynatlab ko‘rsatgan edi, uni o‘zlariga halol qilib olishdi.  
Uni halol deb bilib chekish va ekish badbaxt uchun ikkita musibatdir.    
Bir yigit mahzun holda Abdumalik ibn Marvonning huzuriga kelib: «Ey amiral mo‘minin, men ulkan gunoh qildim, endi tavba qilsam bo‘ladimi?» dedi. «Nima gunoh qilding?» deb so‘ragan edi, «Gunohim juda ulkan», dedi. «U nima ekan? Alloh taologa tavba qil. U zot bandalarining tavbalarini qabul qiladi va kechiradi», dedi. «Ey amiral mo‘minin, men qabrlarga o‘g‘irlikka tushar edim. Men g‘aroyib ishlarni ko‘rdim», dedi yigit. «Nimalarni ko‘rding?» deb so‘ragan edi, u boshidan kechirganlarini so‘zlab berdi: «Bir kecha bir qabrni kavladim. Qarasam, mayyitning yuzi qiblaga teskari bo‘lib qolibdi. Undan qo‘rqib, endi chiqmoqchi bo‘lib turgan edim, shu payt qabrda kimningdir: «Mayyitning yuzi qiblaga teskari bo‘lib qolganini so‘ramaysanmi?» degan ovozi eshitildi. «Nima uchun teskari bo‘lib qolgan?» deb so‘ragan edim, «Chunki u namozga bee’tibor edi. Unga o‘xshaganlarning jazosi shu», dedi. So‘ng boshqa qabrni kovladim. Qarasam, mayyit to‘ng‘izga aylanib, bo‘ynidan kishanlangan, zanjirband qilingan ekan. Undan qo‘rqib, endi chiqmoqchi bo‘lib turgan edim, kimdir: «Uning qanday amal qilganini, nima uchun azoblanayotganini so‘ramaysanmi?» dedi. «Nima uchun?» deb so‘ragan edim, «U tirikligida xamr ichar edi va tavba qilmay vafot etgan», dedi. Keyin boshqa qabrni kavladim. Qarasam, mayyit olov qayish bilan yerga bog‘langan va tili gardanidan chiqib turgan ekan. Undan qo‘rqib, endi chiqmoqchi bo‘lib turgan edim: «Uning nima uchun bu ahvolga tushganini so‘ramaysanmi?» degan nido keldi. «U siydikdan saqlanmas va odamlar orasida gap tashib chaqimchilik qilib yurar edi. Unga o‘xshaganlarning jazosi shu», dedi. So‘ng yana bir qabrni kavladim. Qarasam, mayyit olovda kuyayotgan ekan. Undan qo‘qib, endi chiqmoqchi bo‘lib turgan edim, kimdir: «Uning nima uchun bu ahvolga tushganini so‘ramaysanmi?» dedi. «Nima uchun bu ahvolda?» deb so‘ragan edim, «U namozni tark qilgan edi», dedi. Keyin yana bir qabrni kovladim. Qarasam, qabr ko‘z ilg‘aydigan joygacha kengaygan, ko‘zni qamashtiradigan darajada yorug‘, mayyit esa ajoyib liboslarda, nurli so‘rida uxlab yotar edi. Uning haybati bosib, endi chiqib ketmoqchi bo‘lgan edim, kimdir: «Uning nima uchun bu qadar izzat-ikromga sazovor bo‘lganini so‘ramaysanmi?» dedi. «Nima uchun izzat-ikromga sazovor bo‘ldi?» deb so‘ragan edim, «U itoatli yigit bo‘lib, Alloh azza va jallaga itoat va ibodatda ulg‘aygan edi», dedi. Shunda Abdumalik: «Albatta bu hikoyatda osiylar uchun ibrat va itoatkor bandalar uchun bashorat bordir», dedi».  
Mazkur hikoyatda zikr qilingan aybu nuqsonlarga yo‘l qo‘yayotganlar darhol tavba qilishlari va itoatga o‘tishlari lozim. Alloh bizlarni ham, sizlarni ham itoatkor bandalaridan qilib, fosiqona ishlardan chetlashtirsin. Albatta, U marhamatli, saxovatli zotdir.    
Fuzayl ibn Iyoz o‘lim to‘shagida yotgan shogirdini ko‘rgani kelib, unga «shahodat» kalimasini talqin eta boshladi. Biroq uning tili hech aylanmas edi. Kalimani yana takrorlagan edi: «Aytmayman, men undan begonaman», dedi. Fuzayl yig‘lagan ko‘yi u yerdan chiqib ketdi. Keyin oradan bir qancha vaqt o‘tgach, tushida shogirdining do‘zaxga sudrab olib ketilayotganini ko‘rdi. «Ey bechora, nima sababli ma’rifatdan judo bo‘lding?» deb so‘ragan edi, u: «Ey ustoz, mening bir kasalim bor edi. Tabiblarga borgan edim, menga: «Har yili bir qadah xamr ichib turasan. Bo‘lmasa, kasaling tuzalmaydi», deyishdi. Har yili davolanish uchun undan ichib turar edim», deya javob berdi.  
Davolanish uchun xamr ichgan kishining holi shu bo‘lsa, ko‘ngil hushi uchun ichadiganlarning ahvoli qanday bo‘larkin?! Allohdan barchamizni afu etishini va barcha balolardan omon saqlanishini so‘raymiz.  
Bir kishidan tavba qilishiga nima sabab bo‘lganini so‘rashganida, shunday dedi: «Men qabrlarga o‘g‘irlikka tushar edim. U yerda ayrim o‘liklar qiblaga ters bo‘lib qolganini ko‘rdim. Yaqinlaridan ularning nima qilganlari haqida so‘raganimda: «Ular dunyoda xamr ichgan va tavba qilmay vafot etgan edilar», deb javob berishdi».  
Bir solih kishi aytgan ekan: «Kichkina farzandim vafot etdi, uni dafn qilganimizdan so‘ng, oradan bir qancha vaqt o‘tgach, tushimda ko‘rdim. Sochi oppoq bo‘lib oqarib ketgan edi. «Ey o‘g‘lim, seni dafn etganimda yoshgina bola eding-ku. Nega soching oqarib ketdi?» deb so‘radim. U: «Ey otajon, yonimga xamr ichgan kishi dafn qilindi. Uning kelganidan jahannam shunday oh urdiki, biron bola qolmay, barchasining sochi oqarib ketdi», deb javob berdi».  
Allohdan barchamizni afu etishini va oxiratda azobga duchor qiladigan ishlardan omon saqlashini so‘raymiz. Har bir banda yomon holatda ekanida ajali yetib do‘zaxga uloqtirilmasidan oldin (Alloh saqlasin), Alloh taologa tavba qilishi lozim.",
'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
} 
if($text == "Yolg'on qasam ichish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"YOLG’ON QASAM ICHISH 
Alloh taolo aytadi:  
«Allohga bergan ahd-paymon va qasamlarini ozgina qiymatga sotib yuboradigan kimsalar uchun oxiratda hech qanday nasiba yo‘qdir. Qiyomat kunida Alloh ularga gapirmaydi, ularga (rahmat nazari bilan) boqmaydi va ularni (gunohlaridan) poklamaydi. Ular uchun alamli azob bordir» (Oli Imron surasi, 77).  
Vohidiy (rahmatullohi alayh) aytadilar: «Mazkur oyat Payg‘ambar sollallohu alayhi vasallam huzurlariga yer talashib kelgan ikki kishi xususida nozil bo‘lgan. Da’vogarlardan biri qasam ichmoqchi bo‘lganida, Alloh bu oyatni nozil qilgan va u qasam ichishdan bosh tortib, sherigining haqqi borligiga iqror bo‘lgan edi».  
Ash’as roziyallohu anhu aytadilar: «Allohga qasamki, bu oyat men xususimda nozil bo‘lgan. Bir yahudiy bilan oramizda yer bor edi. U mening yerimni o‘ziniki deb da’vo qildi. Uni Rasululloh sollallohu alayhi vasallamning huzurlariga boshlab bordim. Rasululloh sollallohu alayhi vasallam mendan: «Daliling bormi?» deb so‘ragan edilar, «Yo‘q», dedim. Yahudiyga: «Qasam ich», degan edilar, men: «Yo Rasululloh, u agar qasam ichsa, mening molim ketadi-ku», dedim. Shunda Alloh azza va jalla: «Allohga bergan ahd-paymon va qasamlarini ozgina qiymatga sotib yuboradigan kimsalar...» deb boshlanuvchi oyatni nozil qildi» (Ahmad, Buxoriy, Muslim rivoyati).  
Buxoriy va Muslimlar rivoyat qilishgan hadisda: «Kimki musulmon kishining moli xususida nohaq qasam ichsa, Allohga yo‘liqqanida U zot undan darg‘azab bo‘ladi», deyilgan.  
Rasululloh sollallohu alayhi vasallam: «Kimki (yolg‘on) qasam ichib musulmon kishining haqini o‘ziniki qilib olsa, batahqiq, Alloh unga do‘zaxni vojib qilib, jannatni harom qiladi», dedilar. «Yo Alloh, arzimagan narsa bo‘lsa hammi?» deb so‘rashgan edi, «Butaning bir novdasi bo‘lsa ham», deb javob berdilar (Muttafaqun alayh).  
Hafs ibn Maysaraga: «Bu hadis naqadar shiddatli bo‘lmasa?!» deyishgan edi, u kishi: «Alloh taoloning kitobida: «Alloh bergan ahd-paymon va qasamlarini ozgina qiymatga sotib yuboradigan kimsalar...» degan oyat bor emasmi?» dedilar.  
Abu Zarr roziyallohu anhu aytadilar: «Rasululloh sollallohu alayhi vasallam: «Uch toifa odamga qiyomat kuni Alloh gapirmas, (rahmat) nazari bilan boqmas, ularni (gunohlaridan) poklamas va ular uchun alamli azob bo‘lur», dedilar. «Yo Rasululloh, kim ular – ziyonkor bechoralar?» degan edim, Rasululloh sollallohu alayhi vasallam bu so‘zni uch bora takrorladilar-da: «Kiyimini uzunligidan yerga sudrab yuruvchi kimsa, yolg‘on qasam bilan molini o‘tqazuvchi, minnat qiluvchi kishi», deya javob berdilar» (Ahmad, Muslim va boshqalar rivoyati).  
Abdulloh ibn Amr roziyallohu anhu aytadilar: «Payg‘ambar sollallohu alayhi vasallam: «Gunohi kabiralar – Allohga shirk keltirish, ota-onaga oq bo‘lish va yolg‘on qasam ichish», dedilar» (Buxoriy, Nasoiy, Termiziy rivoyati).  
Yolg‘on qasam o‘z sohibini bu dunyoda gunohga, u dunyoda esa do‘zaxga botiradi.",
 'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
} 
 if($text == "Yolg'on qasam ichish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Alloh azza va jalladan boshqa narsa bilan qasam ichish ham gunohi kabira hisoblanadi. Masalan, Payg‘ambar sollallohu alayhi vasallam, farishtalar, Ka’ba, osmon, suv, hayot, omonat, jon, bosh va shu kabi narsalar bilan qasam ichish mumkin emas.  
Payg‘ambar sollallohu alayhi vasallam: «Alloh sizlarni otalaringiz bilan qasam ichishdan qaytaradi. Kimki qasam ichmoqchi bo‘lsa, Alloh nomi bilan qasam ichsin yoki jim bo‘lsin», degan (Buxoriy, Muslim rivoyati).  
Boshqa bir sahih hadisda esa: «Bas, kimki qasam ichmoqchi bo‘lsa, faqat Alloh nomi bilan qasam ichsin yoki sukut saqlasin», deyilgan.  
Abdurahmon ibn Samura roziyallohu anhu aytadilar: «Rasululloh sollallohu alayhi vasallam: «Tog‘utlar bilan ham, ota-bobolaringiz bilan ham qasam ichmanglar», dedilar» (Muslim rivoyati).  
Tog‘utlar – shayton va but-sanamlar.  
Burayda roziyallohu anhu aytadilar: «Rasululloh sollallohu alayhi vasallam: «Kimda-kim omonat bilan qasam ichsa, u bizdan emas», dedilar» (Abu Dovud rivoyati).  
Rasululloh sollallohu alayhi vasallam: «Kimki qasam ichib: «Men Islomdan begonaman», desa va u agar yolg‘on gapirgan bo‘lsa ham, rost gapirgan bo‘lsa ham, aytganidekdir. Agar gapi rost bo‘lsa, u Islomga sira salomat holida qaytmaydi», dedilar (Abu Dovud, Nasoiy rivoyati).  
Ibn Umar roziyallohu anhu bir kishining: «Ka’baga qasamki», deganini eshitib qolib: «Allohdan boshqaning nomi bilan qasam ichma. Men Rasululloh sollallohu alayhi vasallamning: «Kim Allohdan boshqaning nomi bilan qasam ichsa, kufr yoki shirk keltiribdi», deganlarini eshitganman», dedilar.  
Ayrim ulamolar mazkur hadisdagi: «Kufr yoki shirk keltiribdi» jumlasini mubolag‘a deb tafsir qilishgan. Bu Payg‘ambar sollallohu alayhi vasallamning: «Riyoning ozginasi ham shirkdir» hadisi shariflariga monanddir.  
Rasululloh sollallohu alayhi vasallam: «Kimki qasam ichib turib: «Lot va Uzzoga qasamki» deb yuborsa, u darhol: «La ilaha illalloh» desin», deganlar. (Buxoriy, Muslim rivoyati).  
Ayrim sahobalar Islomga endi kirgan vaqtlarida, tillari o‘rganib qolgani uchun shunday qasam ichib yuborar edilar. Payg‘ambar sollallohu alayhi vasallam ularga o‘zlari bilmagan holda aytib yuborgan so‘zlariga kafforat bo‘lishi uchun darhol: «La ilaha illaloh», deyishni buyurar edilar. Tafviq Allohdan.",
'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
} 
if($text == "Poraxo'rlik"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"PORAXO‘RLIK 
Alloh taolo aytadi:  
«Mol-dunyolaringizni oralaringizda nohaq – harom yo‘llar bilan yemangiz! (Ya’ni, bir-biringizning haqqingizni yemang!) Va (gunoh qilayotganingizni) bilib turib, odamlarning mollaridan bir qismini gunoh – harom yo‘llar bilan yeyish uchun (mollaringizni pora qilib) hokimlarga uzatmang!» (Baqara surasi, 188).  
Ya’ni, boshqalarning haqqini sizlarga o‘zlashtirib berishlari uchun hokimlarga pora bermanglar.  
Abu Hurayra roziyallohu anhu aytadilar: «Rasululloh sollallohu alayhi vasallam hukmda pora beruvchini ham, pora oluvchini ham la’natladilar» (Termiziy, Ibn Hibbon, Hokim rivoyati).  
Yana bir rivoyatda: «O‘rtadagi kishini ham», deyilgan.  
Ummu Salama roziyallohu anho rivoyat qiladilar: «Rasululloh sollallohu alayhi vasallam aytdilar: «Bironta hukmda pora beruvchini ham, pora oluvchini ham Alloh la’natlasin» (Tabaroniy rivoyati).",
'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
} 
if($text == "Poraxo'rlik"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Ulamolar aytganlarki: «Pora beruvchining maqsadi musulmonga ozor yetkazish yoki haqi bo‘lmagan narsani qo‘lga kiritish bo‘lsa, u mal’undir. Bordi-yu, o‘zining haqqini qo‘lga kiritishi yoki o‘zidan zulmni daf qilish uchun pora bersa, u mal’un bo‘lmaydi. Hokim esa biron bir haqni bekor qiladimi yoki zulmni daf qiladimi farqi yo‘q, uning pora olishi haromdir. O‘rtasidagi kishi esa pora beruvchi kabi maqsadiga qarab baholanadi. Agar niyati yaxshi bo‘lsa, mal’un bo‘lmaydi. Bordi-yu niyati yomon bo‘lsa, u mal’undir».  
Ibn Mas’ud roziyallohu anhu aytganlar: «Hukmdagi pora kufrdir. Odamlar orasidagi esa haromdir» (Tabaroniy rivoyati).  
Abu Umoma Bohiliy roziyallohu anhu aytadilar: «Rasululloh sollallohu alayhi vasallam: «Kim bir birodari uchun vositachilik qilsa-yu, buning evaziga unga hadya berganda hadyani qabul qilsa, batahqiq, u sudxo‘rlikning katta eshiklaridan biriga yaqinlashibdi», dedilar» (Abu Dovud rivoyati).  
Ibn Mas’ud roziyallohu anhu aytadilar: «Birodaringning hojatini bilib, uni ravo qilsang-u, (buning evaziga) senga hadya berganda, qabul qilsang, bu ishing haromdir».  
Masruq (rahmatullohi alayh) Ibn Ziyod bilan gaplashib, uni zulmdan qaytardilar. Shunda zulmdan xalos bo‘lgan kishi u zotga xizmatkor hadya qilgan edi, qabul etmadilar va: «Ibn Mas’udning: «Kimki musulmondan zulmni daf etsa-yu, buning evaziga unga oz yoki ko‘p narsa bersa, u narsa haromdir», dedilar. Shunda bir kishi: «Ey Abu Abdurahmon, faqat hukmdagi porani             harom, deb o‘ylardik», degan edi, u zot roziyallohu anhu: «U kufrdir», deya javob bergandilar», dedilar.  
Allohdan barcha balo-ofatlardan sog‘-salomat saqlashini so‘raymiz.  
Imom Abu Amr Avzo’iy (rahmatullohi alayh) Bayrutda yashayotgan chog‘larida huzurlariga bir nasroniy keldi-da: «Ba’labakka (shahrining) hokimi menga zulm qildi. Unga bir maktub yozib bersangiz», deb bir ko‘za asal uzatdi. Avzo’iy (rahmatullohi alayh): «Xohlasang asalni qaytarib, maktub yozib beraman, xohlasang asalni olaman», dedilar. So‘ngra hokimga: «Bu nasroniyning yer solig‘ini kamaytir», deb maktub yozib berdilar. U asal bilan maktubni olib, hokimga uchrashdi va unga maktubni berdi. Imomning sharofati sababli hokim undan o‘ttiz dirhamni olib tashladi.",
 'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
} 
if($text == "Yolg'on gapirish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"YOLG’ON GAPIRISH 
Alloh taolo aytadi:  
«Shak-shubha yo‘qki, Alloh yolg‘onchi va kofir kimsalarni hidoyat qilmas» (Zumar surasi, 3).  
Ya’ni, Alloh yolg‘onchi va kofir kimsani hidoyatiga muvaffaq qilmaydi, haq dinga yo‘llab qo‘ymaydi.  
«Yolg‘on so‘zlarni ham faqat Allohning oyatlariga iymon keltirmaydigan kimsalargina to‘qirlar. Ana o‘shalar yolg‘onchidirlar» (Nahl surasi, 105).  
Ya’ni, Allohga va oyatlariga iymon keltirmagan kimsagina U zot sha’niga yolg‘on to‘qiydi. Chunki u azobga duchor bo‘lishidan qo‘rqmaydi. U haqiqiy yolg‘onchidir. Yolg‘on gapirish ulkan jinoyat bo‘lgani bois, mo‘min unga yaqinlashmaydi.  
«Albatta, Alloh haddan oshuvchi, yolg‘onchi kimsalarni hidoyat qilmas» (Fofir surasi, 28).  
Ya’ni, Alloh haddan oshib zalolatga botgan va U zot sha’niga yolg‘on to‘qiydigan kimsani hidoyatga, iymonga muvaffaq qilmaydi.  
Ibn Mas’ud roziyallohu anhu aytadilar: «Rasululloh sollallohu alayhi vasallam: «Rostgo‘ylikni mahkam tutinglar. Zero, rostgo‘ylik ezgulikka yo‘llaydi, ezgulik esa jannatga boshlaydi. Kishi rost gapirish va rostgo‘ylikka intilishda davom etaveradi, natijada Alloh huzurida rostgo‘y deb yoziladi. Yolg‘onchilikdan saqlaninglar. Zero, yolg‘onchilik fojirlikka (gunohkorlikka), fojirlik esa do‘zaxga boshlaydi. Banda yolg‘on gapirish va yolg‘onchilikka intilishda davom etaveradi, nihoyat Alloh huzurida yolg‘onchi deb yoziladi», dedilar» (Buxoriy, Muslim, Termiziy rivoyati).  
Abu Hurayra roziyallohu anhu aytadilar: «Rasululloh sollallohu alayhi vasallam dedilar: «Munofiqning alomati uchta: gapirsa yolg‘on gapiradi, va’da bersa, ustidan chiqmaydi, omonat qo‘yilsa, xiyonat qiladi» (Muttafaqun alayh).  
Abdulloh ibn Amr roziyallohu anhudan rivoyat qilinadi: «Rasululloh sollallohu alayhi vasallam: «Kimda to‘rt xislat bo‘lsa, u haqiqiy munofiq bo‘ladi. Kimda ulardan biri bo‘lsa, to uni tark etmagunicha unda munofiqlikning bir xislati bo‘ladi: omonat qo‘yilsa, xiyonat qiladi, gapirsa, yolg‘on gapiradi, ahd qilsa, (ahdida) turmaydi, xusumatlashsa (tortishsa), fojirlik qiladi», dedilar» (Buxoriy, Muslim rivoyati).  
Payg‘ambar sollallohu alayhi vasallamning tushlari haqidagi hadisi sharifda shunday deyilgan: «So‘ng orqasi bilan chalqancha yotgan bir kishining yoniga keldim. Tepasida temir changak ko‘targan boshqa birov turardi. Shu payt u (yotgan kimsa) yuzining bir tomoniga yaqinlashdi-da, yuzini burnini va ko‘zini ensasigacha yirtib tashladi. So‘ngra nima qilgan bo‘lsa, shuni qildi. Bu tomonidan bo‘shamay turib, narigi tomoni tuzalib qoldi. So‘ng yana u tomonga o‘tib, birinchi safar qilgan ishini qila boshladi. Men: «Subhonalloh, bu nima?» deb so‘ragan edim, «Yur, ketdik», deyishdi. Keyin ikki farishta Payg‘ambar sollallohu alayhi vasallamga buni izohlab: «Endi, yuzi ensasigacha, yuzi, burni va ko‘zi ensasigacha yirtilayotgan kishiga kelsak, u ertalab uyidan chiqib, ufqlargacha yetadigan darajada ko‘p yolg‘on gapiradigan kimsadir», deyishdi» (Buxoriy rivoyati).",
 'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
} 
if($text == "Yolg'on gapirish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Rasululloh sollallohu alayhi vasallam aytdilar: «Uch toifa odamga qiyomat kunida Alloh gapirmaydi, ularni (gunohlaridan) poklamaydi, ularga (rahmat nazari bilan) qaramaydi va ularga alamli azob bo‘ladi. (Ular): zinokor qariya, yolg‘onchi podshoh va mutakabbir kambag‘al» (Muslim, Nasoiy rivoyati).  
Rasululloh sollallohu alayhi vasallam dedilar: «Odamlarni kuldirish uchun yolg‘on gapiradigan kimsaga vayl bo‘lsin, vayl bo‘lsin, vayl bo‘lsin» (Abu Dovud, Termiziy rivoyati).  
Hadisi shariflardan birida: «Mo‘minning tabiatida xiyonatkorlik va yolg‘onchilikdan tashqari har qanday xislatga moyillik bo‘lishi mumkin», deyilgan (Bazzor, Abu Ya’lo rivoyati).  
Navos ibn Sam’on roziyallohu anhu aytadilar: «Rasululloh sollallohu alayhi vasallam: «Birodaring seni tasdiqlab deb turganida, unga yolg‘on gap aytishing katta xiyonatdir», dedilar» (Ahmad rivoyati).  
Ibn Mas’ud roziyallohu anhu aytgan ekanlar: «Banda yolg‘on gapirish va yolg‘onchilikka intilishdan to‘xtamaydi, nihoyat uning qalbida qora dog‘ paydo bo‘ladi. Borib-borib qalbi batamom qorayadi va Alloh nazdida yolg‘onchilardan deb yoziladi».  
Yolg‘on qasam ichish yolg‘on gapirishdan ham yomonroqdir.  
Alloh taolo munofiqlar haqida xabar berib bunday deydi:   
«Yana ular (o‘zlarining munofiq ekanliklarini) bilib turgan hollarida («Bizlar musulmonlarmiz» deb) yolg‘on qasam ham ichurlar» (Mujodala surasi, 14).  
Rasululloh sollallohu alayhi vasallam aytganlarki: «Uch toifa odamga qiyomat kunida Alloh gapirmaydi ularga (rahmat nazari bilan) qaramaydi, ularni (gunohlardan) poklamaydi va ularga alamli azob bo‘ladi: Sahroda ortiqcha suvi bo‘la turib uni yo‘lovchilarga bermaydigan kimsa; asrdan so‘ng aslida unday bo‘lmasa-da, o‘zi uni falon narxga olganiga ishontirish uchun Allohning nomi bilan qasam ichib matosini sotgan kimsa; amirga mol-dunyo ilinjida bay’at bergan, shuning uchun agar unga xohlagan narsasini berib tursa, ahdiga vafo qilib, bermay qo‘ysa, ahdini buzadigan kimsa» (Buxoriy, Muslim va boshqalar rivoyati).  
Tush xususidagi yolg‘on ham katta yolg‘ondir.",
 'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
} 
if($text == "Yolg'on gapirish"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"Imom Buxoriy (rahmatullohi alayh) rivoyat qilgan hadisda: «Kim ko‘rmagan tushini ko‘rdim desa, unga ikki soch tolasini ulash yuklanadi. Biroq bu ishni uddalay olmaydi», deyilgan.  
Rasululloh sollallohu alayhi vasallam: «Kishi ikki ko‘zi ko‘rmagan narsalarni ko‘rsatishi – yolg‘onlarning yolg‘onidir (eng katta uydirmadir)» dedilar (Buxoriy rivoyati).  
Ya’ni, kishi tushida hech narsa ko‘rmagan bo‘lsa-da, uni ko‘rdim, buni ko‘rdim, deyishi g‘irt yolg‘ondir.  
Musulmon kishi yaxshi-foydali so‘zlarnigina so‘zlab, bekorchi, foydasiz so‘zlardan tilini tiyishi lozim. Zero, sukut saqlash salomatlik bo‘lib, salomatlikka biron narsa teng kelmaydi. Chunki Rasululloh sollallohu alayhi vasallam: «Kimki Allohga va oxirat kuniga iymon keltirgan bo‘lsa, yaxshi gap gapirsin yoki sukut saqlasin», deganlar (Mutafaqqun alayh).  
Abu Muso roziyallohu anhu rivoyat qiladilar: «Yo Rasululloh, qaysi musulmon afzal?» deb so‘ragan edim, «Qo‘li va tilidan musulmonlar salomat bo‘lgan kishi», deya javob berdilar» (Buxoriy, Muslim va boshqalar rivoyati).  
Abu Hurayra roziyallohu anhu rivoyat qiladilar: «Bir banda e’tiborsizlik qilib bir so‘zni aytadi-da, u sababli do‘zaxga mashriq va mag‘rib orasidan uzoqroq masofaga qulaydi» (Buxoriy, Muslim rivoyati).  
Bilol ibn Horis Muzaniy roziyallohu anhudan rivoyat qilinadi: Rasululloh sollallohu alayhi vasallam: «Bir kishi Allohni rozi qiladigan bir so‘zni aytadi-da, u sababli Alloh taologa uchrashadigan kunigacha unga roziligini yozib qo‘yadi. U so‘zining bu darajaga yetishini o‘ylab ko‘rmagan bo‘ladi. Yana bir kishi Allohni g‘azablantiradigan bir so‘zni aytadi-da, u sababli Allohga uchrashadigan kunigacha unga g‘azabini yozib qo‘yadi. So‘zining bu darajaga yetishini u ham o‘ylab ko‘rmagan bo‘ladi», dedilar» (Molik, Termiziy rivoyati).  
Bu xususda sahih hadislar bisyor bo‘lib, zikr qilganlarimizning o‘zi ham kifoya qilsa, ajabmas.  
Bir kishidan: «Odam bolasining qancha aybi bor ekan?» deb so‘rashgan edi, u: «Sanab sanog‘iga yetib bo‘lmaydi. Men o‘zim sanaganman, sakkiz mingta ayb bo‘ldi. Biroq bir xislat borki, u barcha ayblarni berkitib turadi. U – tilni tiyish», deya javob berdi.  
Alloh barchamizni gunoh ishlardan chetlashtirsin, O‘zi rozi bo‘ladigan ishlarga yo‘llasin. U marhamatli va saxovatli zotdir.",
 'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
} 
if($text == "Qimor o'ynash"){
bot('sendMessage',[
'chat_id'=>$cid,
'text'=>"QIMOR O‘YNASH
Alloh taolo aytadi:  
«Ey mo‘minlar, xamr (mast qiladigan ichimlik ichish), qimor (o‘ynash), butlar (ya’ni, ularga sig‘inish) va cho‘plar (ya’ni, cho‘plar bilan folbinlik qilish) shayton amalidan bo‘lgan harom ishdir. Bas, najot topishingiz uchun ularning har biridan uzoq bo‘lingiz!» (Moida surasi, 90).  
Ya’ni, bu ishlarning barchasi, garchi shayton ularni chiroyli qilib ko‘rsatsa-da, nopok, harom ishlardir. Ulug‘ savoblarga erishishingiz uchun bu iflosliklardan uzoq bo‘linglar.  
«Aroq, qimor sababli shayton o‘rtalaringizga bug‘zu adovat solishni hamda sizlarni Allohni zikr qilishdan va namoz o‘qishdan to‘sishni istaydi, xolos! Endi to‘xtarsizlar!» (Moida surasi, 91).  
Oyat oxiridagi jumla buyruq ma’nosidagi so‘roq bo‘lib «to‘xtanglar», degan ma’noni ifodalaydi. Shuning uchun Umar roziyallohu anhu: «Ey Parvardigor, to‘xtadik», degan edilar.  
Abu Hayyon aytadilar: «Alloh taolo xamr va qimordagi ikki fasodni zikr qildi: biri – dunyoviy, ikkinchisi – diniy».  
Dunyoviy fasodi: xamr ko‘ngilsizlik va gina-kudrat keltirib chiqaradi hamda yorbirodarlar orasiga rahna soladi. Qimor o‘ynaydigan kimsa esa borib-borib hech vaqosi qolmaydi va oxiri xotini va bolalarini ham qimorga tikib yuboradi.  
Diniy fasodi: Xamr ichgan odam sarxush bo‘lib, es-hushini yo‘qotadi va Allohni zikr qilishdan chalg‘iydi. Qimor o‘ynaydigan kimsa esa, yutsa ham, yutqazsa ham Allohni zikr qilishdan chalg‘iydi.  
Qimor odamlarning haqlarini botil-nohaq yo‘l bilan yeyish hisoblanib, Alloh undan qaytargandir:  
«Mol-dunyolaringizni oralaringizda nohaq – harom yo‘llar bilan yemangiz (Ya’ni, bir-biringizning haqqingizni yemang!)» (Baqara surasi, 188).  
Rasululloh sollallohu alayhi vasallam ham: «Ayrim kishilar Allohning moliga nohaq tajovuz qiladilar. Qiyomat kunida ularga do‘zax bo‘lur», deganlar (Buxoriy rivoyati).  
Rasululloh sollallohu alayhi vasallam: «Kimki bir birodariga: «Kel, qimor o‘ynaymiz» desa, darhol sadaqa qilsin», dedilar (Buxoriy rivoyati).  
Agar «qimor o‘ynaymiz» degan so‘zning o‘zi uchun kafforat to‘lash yoki sadaqa qilish vojib bo‘lsa, qimor o‘ynashning hukmi qanday bo‘lar ekan?!  
Ulamolar, garchi o‘rtaga hech narsa tikmasalar-da, narda o‘ynash haromligiga ittifoq qilganlar. Zero, Rasululloh sollallohu alayhi vasallam: «Kimda-kim narda o‘ynasa, u go‘yoki qo‘lini cho‘chqaning go‘shti va qoniga botirgandek bo‘libdi», deganlar (Muslim, Abu Dovud, Ibn Moja rivoyati).  
Rasululloh sollallohu alayhi vasallam: «Kimki narda o‘ynasa, batahqiq, u Alloh va rasuliga osiylik qilibdi», dedilar (Molik, Hokim va boshqalar rivoyati).",
 'parse_mode'=>'html',
'reply_markup'=>$gunoh,
]);
} 
if($text == "🟢Tafsiri Hilol"){
    bot('sendMessage',[
    'chat_id'=>$cid,
    'text'=>"<b> 🟢Tafsiri Hilol</b> <i>bo'limiga xush kelibsiz Marhamat o'zingizga kerakli bo'lgan bo'limni tanlang</i>",
    'parse_mode'=>"html",
    'reply_markup'=>$tafsir,
]);
}
if($text == "Tafsiri hilol kirish"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/414",
       'caption'=>"<b> Tafsiri hilol kirish
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Tafsiri hilol kirish 2"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/448",
       'caption'=>"<b> Tafsiri hilol kirish 2
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Tafsiri hilol o'quvchilariga"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/415",
       'caption'=>"<b> Tafsiri hilol o'quvchilariga
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Movarounahrda tafsir va mufassirlar"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/455",
       'caption'=>"<b> Movarounahrda tafsir va mufassirlar
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Qur'onning mo'jizasi"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/456",
       'caption'=>"<b> Qur'onning mo'jizasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Qur'onning insonlarni ojiz qoldirishi"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/457",
       'caption'=>"<b> Qur'onning insonlarni ojiz qoldirishi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Muqaddima"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/458",
       'caption'=>"<b> Muqaddima
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Qur'onni qandoq o'qiymiz"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/459",
       'caption'=>"<b> Qur'onni qandoq o'qiymiz
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Qur'onning jamlanishi"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/461",
       'caption'=>"<b> Qur'onning jamlanishi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Qur'on tushishini boshlanishi"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/462",
       'caption'=>"<b> Qur'on tushishini boshlanishi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Mulk"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/416",
       'caption'=>"<b> Tafsiri Hilol Mulk Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Qalam"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/417",
       'caption'=>"<b> Tafsiri Hilol Qalam Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Haqqa"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/418",
       'caption'=>"<b> Tafsiri Hilol Haqqa Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Maorij"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/419",
       'caption'=>"<b> Tafsiri Hilol Maorij Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Nuh"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/421",
       'caption'=>"<b> Tafsiri Hilol Nuh Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Jinn"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/420",
       'caption'=>"<b> Tafsiri Hilol Jinn Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Muzzammil"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/422",
       'caption'=>"<b> Tafsiri Hilol Muzzammil Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Muddassir"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/467",
       'caption'=>"<b> Tafsiri Hilol Muddassir Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Qiyomat"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/423",
       'caption'=>"<b> Tafsiri Hilol Qiyomat Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Inson"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/424",
       'caption'=>"<b> Tafsiri Hilol Inson Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Mursalot"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/426",
       'caption'=>"<b> Tafsiri Hilol Mursalot Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Naba"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/425",
       'caption'=>"<b> Tafsiri Hilol Naba Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Naziat"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/468",
       'caption'=>"<b> Tafsiri Hilol Naziat Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Abasa"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/427",
       'caption'=>"<b> Tafsiri Hilol Abasa Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Takvir"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/428",
       'caption'=>"<b> Tafsiri Hilol Takvir Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Infitor"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/441",
       'caption'=>"<b> Tafsiri Hilol Infitor Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Mutaffifun"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/429",
       'caption'=>"<b> Tafsiri Hilol Mutaffifun Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Inshiqoq"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/430",
       'caption'=>"<b> Tafsiri Hilol Inshiqoq Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Buruj"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/431",
       'caption'=>"<b> Tafsiri Hilol Buruj Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Toriq"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/432",
       'caption'=>"<b> Tafsiri Hilol Toriq Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Alaa"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/433",
       'caption'=>"<b> Tafsiri Hilol Alaa Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "G'oshiya"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/434",
       'caption'=>"<b> Tafsiri Hilol G'oshiya Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Fajir"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/435",
       'caption'=>"<b> Tafsiri Hilol Fajir Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Balad"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/436",
       'caption'=>"<b> Tafsiri Hilol Balad Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Shams"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/438",
       'caption'=>"<b> Tafsiri Hilol Shams Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Lail"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/437",
       'caption'=>"<b> Tafsiri Hilol Lail Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Zuho"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/439",
       'caption'=>"<b> Tafsiri Hilol Zuho Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Sharh"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/440",
       'caption'=>"<b> Tafsiri Hilol Sharh Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Tiyn"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/442",
       'caption'=>"<b> Tafsiri Hilol Tiyn Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Alaq"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/443",
       'caption'=>"<b> Tafsiri Hilol Alaq Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Qadr"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/444",
       'caption'=>"<b> Tafsiri Hilol Qadr Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Bayyina"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/445",
       'caption'=>"<b> Tafsiri Hilol Bayyina Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Zalzala"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/445",
       'caption'=>"<b> Tafsiri Hilol Zalzala Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Adiyat"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/446",
       'caption'=>"<b> Tafsiri Hilol Adiyat Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Qoria"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/447",
       'caption'=>"<b> Tafsiri Hilol Qoria Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Takaasur"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/450",
       'caption'=>"<b> Tafsiri Hilol Takaasur Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Asr"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/451",
       'caption'=>"<b> Tafsiri Hilol Asr Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Humaza"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/453",
       'caption'=>"<b> Tafsiri Hilol Humaza Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Fil"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/452",
       'caption'=>"<b> Tafsiri Hilol Fil Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Quraysh"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/469",
       'caption'=>"<b> Tafsiri Hilol Quraysh Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Moun"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/470",
       'caption'=>"<b> Tafsiri Hilol Moun Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Kavsar"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/471",
       'caption'=>"<b> Tafsiri Hilol Kavsar Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Kofirun"){
       bot('senddocument',[
       'chat_id'=>$cid,
              'document'=>"https://t.me/TARIINISG/472",
       'caption'=>"<b> Tafsiri Hilol Kofirun Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Nosr"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/473",
       'caption'=>"<b> Tafsiri Hilol Nosr Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Masad"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/474",
       'caption'=>"<b> Tafsiri Hilol Masad Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Ixlos"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/475",
       'caption'=>"<b> Tafsiri Hilol Ixlos Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Falaq"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/476",
       'caption'=>"<b> Tafsiri Hilol Falaq Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "Nas"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/477",
       'caption'=>"<b> Tafsiri Hilol Nas Surasi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tafsir,
]);
}
if($text == "💫Payg'ambarimizning mo'jizalari"){
    bot('sendMessage',[
    'chat_id'=>$cid,
    'text'=>"<b> 💫Payg'ambarimizning mo'jizalari </b> <i>bo'limiga xush kelibsiz Marhamat o'zingizga kerakli bo'lgan bo'limni tanlang</i>",
    'parse_mode'=>"html",
    'reply_markup'=>$mojiza,
]);
}
if($text == "1-Mo'jiza"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/344",
       'caption'=>"<b> Rasululloh sollallohu alayhi vasallam mo'jizalari    
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$mojiza,
]);
}
if($text == "2-Mo'jiza"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/345",
       'caption'=>"<b>Rasululloh sollallohu alayhi vasallam mo'jizalari    


Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$mojiza,
]);
}
if($text == "3-Mo'jiza"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/346",
       'caption'=>"<b> Rasululloh sollallohu alayhi vasallam mo'jizalari    
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$mojiza,
]);
}
if($text == "4-Mo'jiza"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/347",
       'caption'=>"<b> Rasululloh sollallohu alayhi vasallam mo'jizalari    
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$mojiza,
]);
}
if($text == "5-Mo'jiza"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/348",
       'caption'=>"<b> Rasululloh sollallohu alayhi vasallam mo'jizalari
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$mojiza,
]);
}
if($text == "6-Mo'jiza"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/349",
       'caption'=>"<b> Rasululloh sollallohu alayhi vasallam mo'jizalari
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$mojiza,
]);
}
if($text == "7-Mo'jiza"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/350",
       'caption'=>"<b> Rasululloh sollallohu alayhi vasallam mo'jizalari
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$mojiza,
]);
}
if($text == "8-Mo'jiza"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/351",
       'caption'=>"<b> Rasululloh sollallohu alayhi vasallam mo'jizalari
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$mojiza,
]);
}
if($text == "9-Mo'jiza"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/352",
       'caption'=>"<b> Rasululloh sollallohu alayhi vasallam mo'jizalari
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$mojiza,
]);
}
if($text == "10-Mo'jiza"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/353",
       'caption'=>"<b> Rasululloh sollallohu alayhi vasallam mo'jizalari
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$mojiza,
]);
}
if($text == "11-Mo'jiza"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/354",
       'caption'=>"<b> Rasululloh sollallohu alayhi vasallam mo'jizalari
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$mojiza,
]);
}
if($text == "12-Mo'jiza"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/355",
       'caption'=>"<b> Rasululloh sollallohu alayhi vasallam mo'jizalari
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$mojiza,
]);
}
if($text == "13-Mo'jiza"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/356",
       'caption'=>"<b> Rasululloh sollallohu alayhi vasallam mo'jizalari
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$mojiza,
]);
}
if($text == "14-Mo'jiza"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/357",
       'caption'=>"<b> Rasululloh sollallohu alayhi vasallam mo'jizalari
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$mojiza,
]);
}
if($text == "15-Mo'jiza"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/358",
       'caption'=>"<b> Rasululloh sollallohu alayhi vasallam mo'jizalari
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$mojiza,
]);
}
if($text == "16-Mo'jiza"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/359",
       'caption'=>"<b> Rasululloh sollallohu alayhi vasallam mo'jizalari
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$mojiza,
]);
}
if($text == "17-Mo'jiza"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/406",
       'caption'=>"<b> Rasululloh sollallohu alayhi vasallam mo'jizalari
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$mojiza,
]);
}
if($text == "📝Qur'on o'qishni o'rganamiz"){
    bot('sendMessage',[
    'chat_id'=>$cid,
    'text'=>"<b> 📝Qur'on o'qishni o'rganamiz</b> <i>bo'limiga xush kelibsiz Marhamat o'zingizga kerakli bo'lgan bo'limni tanlang</i>",
    'parse_mode'=>"html",
    'reply_markup'=>$Oqish,
]);
}
if($text == "Qurʼon o‘qishni o‘rganamiz (Fotiha surasi)"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/256",
       'caption'=>"<b> Qurʼon o‘qishni o‘rganamiz (Fotiha surasi)
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Oqish,
]);
}
if($text == "Qurʼon o‘qishni o‘rganamiz (An-Nass surasi)"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/256",
       'caption'=>"<b> Qurʼon o‘qishni o‘rganamiz (An-Nass surasi)
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Oqish,
]);
}
if($text == "Qurʼon o‘qishni o‘rganamiz (Falaq surasi)"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/257",
       'caption'=>"<b> Qurʼon o‘qishni o‘rganamiz (Falaq surasi)
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Oqish,
]);
}
if($text == "Qurʼon o‘qishni o‘rganamiz (Ixlos surasi)"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/258",
       'caption'=>"<b> Qurʼon o‘qishni o‘rganamiz (Ixlos surasi)
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Oqish,
]);
}
if($text == "Qurʼon o‘qishni o‘rganamiz (Masad surasi)"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/260",
       'caption'=>"<b> Qurʼon o‘qishni o‘rganamiz (Masad surasi)
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Oqish,
]);
}
if($text == "Qurʼon o‘qishni o‘rganamiz (Nasr surasi)"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/261",
       'caption'=>"<b> Qurʼon o‘qishni o‘rganamiz (Nasr surasi)
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Oqish,
]);
}
if($text == "Qurʼon o‘qishni o‘rganamiz (Kafirun surasi)"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/262",
       'caption'=>"<b> Qurʼon o‘qishni o‘rganamiz (Kafirun surasi)
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Oqish,
]);
}
if($text == "Qurʼon o‘qishni o‘rganamiz (Kavsar surasi)"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/263",
       'caption'=>"<b> Qurʼon o‘qishni o‘rganamiz (Kavsar surasi)
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Oqish,
]);
}
if($text == "Qurʼon o‘qishni o‘rganamiz (Maaʼuun surasi)"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/264",
       'caption'=>"<b> Qurʼon o‘qishni o‘rganamiz (Maaʼuun surasi)
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Oqish,
]);
}
if($text == "Qurʼon o‘qishni o‘rganamiz (Quraysh surasi)"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/265",
       'caption'=>"<b> Qurʼon o‘qishni o‘rganamiz (Quraysh surasi)
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Oqish,
]);
}
if($text == "Qurʼon o‘qishni o‘rganamiz (Fil surasi)"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/266",
       'caption'=>"<b> Qurʼon o‘qishni o‘rganamiz (Fil surasi)
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Oqish,
]);
}
if($text == "Qurʼon o‘qishni o‘rganamiz (Humaza surasi)"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/267",
       'caption'=>"<b> Qurʼon o‘qishni o‘rganamiz (Humaza surasi)
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Oqish,
]);
}
if($text == "Qurʼon o‘qishni o‘rganamiz (Asr surasi)"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/268",
       'caption'=>"<b> Qurʼon o‘qishni o‘rganamiz (Asr surasi)
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Oqish,
]);
}
if($text == "Qurʼon o‘qishni o‘rganamiz (Takaasur surasi)"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/269",
       'caption'=>"<b> Qurʼon o‘qishni o‘rganamiz (Takaasur surasi)
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Oqish,
]);
}
if($text == "Qurʼon o‘qishni o‘rganamiz (Qori'a surasi)"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/270",
       'caption'=>"<b> Qurʼon o‘qishni o‘rganamiz (Qori'a surasi)
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Oqish,
]);
}
if($text == "Qurʼon o‘qishni o‘rganamiz (Aʼdiyat surasi)"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/271",
       'caption'=>"<b> Qurʼon o‘qishni o‘rganamiz (Aʼdiyat surasi)
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Oqish,
]);
}
if($text == "Qurʼon o‘qishni o‘rganamiz (Zalzala surasi)"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/272",
       'caption'=>"<b> Qurʼon o‘qishni o‘rganamiz (Zalzala surasi)
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Oqish,
]);
}
if($text == "Qurʼon o‘qishni o‘rganamiz (Bayyina surasi 1-5 oyatlar)"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/273",
       'caption'=>"<b> Qurʼon o‘qishni o‘rganamiz (Bayyina surasi 1-5 oyatlar)
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Oqish,
]);
}
if($text == "Qurʼon o‘qishni o‘rganamiz (Bayyina surasi 6-8 oyatlar surasi)"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/274",
       'caption'=>"<b> Qurʼon o‘qishni o‘rganamiz (Bayyina surasi 6-8 oyatlar surasi)
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Oqish,
]);
}
if($text == "Qurʼon o‘qishni o‘rganamiz (Qadr surasi)"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/275",
       'caption'=>"<b> Qurʼon o‘qishni o‘rganamiz (Qadr surasi)
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Oqish,
]);
}
if($text == "Qurʼon o‘qishni o‘rganamiz (Alaq surasi)"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/276",
       'caption'=>"<b> Qurʼon o‘qishni o‘rganamiz (Alaq surasi)
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Oqish,
]);
}
if($text == "Qurʼon o‘qishni o‘rganamiz (Tiyn surasi)"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/278",
       'caption'=>"<b> Qurʼon o‘qishni o‘rganamiz (Tiyn surasi)
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Oqish,
]);
}
if($text == "Qurʼon o‘qishni o‘rganamiz (Sharh surasi)"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/277",
       'caption'=>"<b> Qurʼon o‘qishni o‘rganamiz (Sharh surasi)
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Oqish,
]);
}
if($text == "Qurʼon o‘qishni o‘rganamiz (Zuho surasi)"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/279",
       'caption'=>"<b> Qurʼon o‘qishni o‘rganamiz (Zuho surasi)
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Oqish,
]);
}
if($text == "Qurʼon o‘qishni o‘rganamiz (Layl surasi)"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/280",
       'caption'=>"<b> Qurʼon o‘qishni o‘rganamiz (Layl surasi)
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Oqish,
]);
}
if($text == "Qurʼon o‘qishni o‘rganamiz (Shams surasi)"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/282",
       'caption'=>"<b> Qurʼon o‘qishni o‘rganamiz (Fotiha surasi)
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Oqish,
]);
}
if($text == "Qurʼon o‘qishni o‘rganamiz (Balad surasi)"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/281",
       'caption'=>"<b> Qurʼon o‘qishni o‘rganamiz (Balad surasi)
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Oqish,
]);
}
if($text == "Qurʼon o‘qishni o‘rganamiz (Fajr surasi 1-16 oyatlar surasi)"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/283",
       'caption'=>"<b> Qurʼon o‘qishni o‘rganamiz (Fajr surasi 1-16 oyatlar surasi)
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Oqish,
]);
}
if($text == "Qurʼon o‘qishni o‘rganamiz (Fajr surasi 17-30 oyatlar)"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/285",
       'caption'=>"<b> Qurʼon o‘qishni o‘rganamiz (Fajr surasi 17-30 oyatlar)
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Oqish,
]);
}
if($text == "Qurʼon o‘qishni o‘rganamiz (G'oshiya surasi)"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/284",
       'caption'=>"<b> Qurʼon o‘qishni o‘rganamiz (G'oshiya surasi)
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Oqish,
]);
}
if($text == "Qurʼon o‘qishni o‘rganamiz (A'laa surasi)"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/296",
       'caption'=>"<b> Qurʼon o‘qishni o‘rganamiz (A'laa surasi)
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Oqish,
]);
}
if($text == "Qurʼon o‘qishni o‘rganamiz (Toriq surasi)"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/286",
       'caption'=>"<b> Qurʼon o‘qishni o‘rganamiz (Toriq surasi)
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Oqish,
]);
}
if($text == "Qurʼon o‘qishni o‘rganamiz (Buruj surasi)"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/288",
       'caption'=>"<b> Qurʼon o‘qishni o‘rganamiz (Buruj surasi)
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Oqish,
]);
}
if($text == "Qurʼon o‘qishni o‘rganamiz (Inshiqoq surasi)"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/287",
       'caption'=>"<b> Qurʼon o‘qishni o‘rganamiz (Inshiqoq surasi)
     
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Oqish,
]);
}
if($text == "Qurʼon o‘qishni o‘rganamiz (Mutoffifin surasi 1-21 oyatlar)"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/289",
       'caption'=>"<b> Qurʼon o‘qishni o‘rganamiz (Mutoffifin surasi 1-21 oyatlar)
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Oqish,
]);
}
if($text == "Qurʼon o‘qishni o‘rganamiz (Mutoffifin surasi 22-36 oyatlar)"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/290",
       'caption'=>"<b> Qurʼon o‘qishni o‘rganamiz (Mutoffifin surasi 22-36 oyatlar)
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Oqish,
]);
}
if($text == "Qurʼon o‘qishni o‘rganamiz (Infitor surasi)"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/292",
       'caption'=>"<b> Qurʼon o‘qishni o‘rganamiz (Infitor surasi)
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Oqish,
]);
}
if($text == "Qurʼon o‘qishni o‘rganamiz (Takvir surasi)"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/291",
       'caption'=>"<b> Qurʼon o‘qishni o‘rganamiz (Takvir surasi)
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Oqish,
]);
}
if($text == "Qurʼon o‘qishni o‘rganamiz (Abasa surasi 1-23 oyatlar)"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/293",
       'caption'=>"<b> Qurʼon o‘qishni o‘rganamiz (Abasa surasi 1-23 oyatlar)
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Oqish,
]);
}
if($text == "Qurʼon o‘qishni o‘rganamiz (Abasa surasi 24-42 oyatlar)"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/295",
       'caption'=>"<b> Qurʼon o‘qishni o‘rganamiz (Abasa surasi 24-42 oyatlar)
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Oqish,
]);
}
if($text == "Qurʼon o‘qishni o‘rganamiz (Nozi’ot surasi 1-26 oyatlar)"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/294",
       'caption'=>"<b> Qurʼon o‘qishni o‘rganamiz (Nozi’ot surasi 1-26 oyatlar)
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Oqish,
]);
}
if($text == "📿Allohning zikri ila qalblar orom topur"){
    bot('sendMessage',[
    'chat_id'=>$cid,
    'text'=>"<b> 📿Allohning zikri ila qalblar orom topur</b> <i>bo'limiga xush kelibsiz Marhamat o'zingizga kerakli bo'lgan bo'limni tanlang</i>",
    'parse_mode'=>"html",
    'reply_markup'=>$Zikr,
]);
}
if($text == "Allohning zikri ila qalblar orom topur 1-kun"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/338",
       'caption'=>"<b> Allohning zikri ila qalblar orom topur 1-kun
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Zikr,
]);
}
if($text == "Allohning zikri ila qalblar orom topur 2-kun"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/337",
       'caption'=>"<b> Allohning zikri ila qalblar orom topur 2-kun
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Zikr,
]);
}
if($text == "Allohning zikri ila qalblar orom topur 3-kun"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/413",
       'caption'=>"<b> Allohning zikri ila qalblar orom topur 3-kun
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Zikr,
]);
}
if($text == "Allohning zikri ila qalblar orom topur 4-kun"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/334",
       'caption'=>"<b> Allohning zikri ila qalblar orom topur 4-kun
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Zikr,
]);
}
if($text == "Allohning zikri ila qalblar orom topur 5-kun"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/333",
       'caption'=>"<b> Allohning zikri ila qalblar orom topur 5-kun
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Zikr,
]);
}
if($text == "Allohning zikri ila qalblar orom topur 6-kun"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/339",
       'caption'=>"<b> Allohning zikri ila qalblar orom topur 6-kun
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Zikr,
]);
}
if($text == "Allohning zikri ila qalblar orom topur 7-kun"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/331",
       'caption'=>"<b> Allohning zikri ila qalblar orom topur 7-kun
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Zikr,
]);
}
if($text == "Allohning zikri ila qalblar orom topur 8-kun"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/330",
       'caption'=>"<b> Allohning zikri ila qalblar orom topur 8-kun
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Zikr,
]);
}
if($text == "Allohning zikri ila qalblar orom topur 9-kun"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/329",
       'caption'=>"<b> Allohning zikri ila qalblar orom topur 9-kun
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Zikr,
]);
}
if($text == "Allohning zikri ila qalblar orom topur 10-kun"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/328",
       'caption'=>"<b> Allohning zikri ila qalblar orom topur 10-kun
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Zikr,
]);
}
if($text == "Allohning zikri ila qalblar orom topur 11-kun"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/340",
       'caption'=>"<b> Allohning zikri ila qalblar orom topur 11-kun
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Zikr,
]);
}
if($text == "Allohning zikri ila qalblar orom topur 12-kun"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/410",
       'caption'=>"<b> Allohning zikri ila qalblar orom topur 12-kun
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Zikr,
]);
}
if($text == "Allohning zikri ila qalblar orom topur 13-kun"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/327",
       'caption'=>"<b> Allohning zikri ila qalblar orom topur 13-kun
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Zikr,
]);
}
if($text == "Allohning zikri ila qalblar orom topur 14-kun"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/411",
       'caption'=>"<b> Allohning zikri ila qalblar orom topur 14-kun
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Zikr,
]);
}
if($text == "Allohning zikri ila qalblar orom topur 15-kun"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/326",
       'caption'=>"<b> Allohning zikri ila qalblar orom topur 15-kun
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Zikr,
]);
}
if($text == "Allohning zikri ila qalblar orom topur 16-kun"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/325",
       'caption'=>"<b> Allohning zikri ila qalblar orom topur 16-kun
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Zikr,
]);
}
if($text == "Allohning zikri ila qalblar orom topur 17-kun"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/332",
       'caption'=>"<b> Allohning zikri ila qalblar orom topur 17-kun
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Zikr,
]);
}
if($text == "Allohning zikri ila qalblar orom topur 18-kun"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/336",
       'caption'=>"<b> Allohning zikri ila qalblar orom topur 18-kun
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Zikr,
]);
}
if($text == "Allohning zikri ila qalblar orom topur 19-kun"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/335",
       'caption'=>"<b> Allohning zikri ila qalblar orom topur 19-kun
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Zikr,
]);
}
if($text == "Allohning zikri ila qalblar orom topur 20-kun"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/324",
       'caption'=>"<b> Allohning zikri ila qalblar orom topur 20-kun
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Zikr,
]);
}
if($text == "Allohning zikri ila qalblar orom topur 21-kun"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/322",
       'caption'=>"<b> Allohning zikri ila qalblar orom topur 21-kun
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Zikr,
]);
}
if($text == "Allohning zikri ila qalblar orom topur 22-kun"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/323",
       'caption'=>"<b> Allohning zikri ila qalblar orom topur 22-kun
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Zikr,
]);
}
if($text == "Allohning zikri ila qalblar orom topur 23-kun"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/320",
       'caption'=>"<b> Allohning zikri ila qalblar orom topur 23-kun
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Zikr,
]);
}
if($text == "Allohning zikri ila qalblar orom topur 24-kun"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/321",
       'caption'=>"<b> Allohning zikri ila qalblar orom topur 24-kun
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Zikr,
]);
}
if($text == "Allohning zikri ila qalblar orom topur 25-kun"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/343",
       'caption'=>"<b> Allohning zikri ila qalblar orom topur 25-kun
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Zikr,
]);
}
if($text == "Allohning zikri ila qalblar orom topur 26-kun"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/294",
       'caption'=>"<b> Allohning zikri ila qalblar orom topur 26-kun
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Zikr,
]);
}
if($text == "Allohning zikri ila qalblar orom topur 26-kun"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/342",
       'caption'=>"<b> Allohning zikri ila qalblar orom topur 26-kun
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Zikr,
]);
}
if($text == "❔So'ragan edingiz"){
    bot('sendMessage',[
    'chat_id'=>$cid,
    'text'=>"<b> ❔So'ragan edingiz </b> <i>bo'limiga xush kelibsiz Marhamat o'zingizga kerakli bo'lgan bo'limni tanlang</i>",
    'parse_mode'=>"html",
    'reply_markup'=>$sora,
]);
}
if($text == "Suv qachon obi mustaʼmalga aylanadi"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/360",
       'caption'=>"<b> Suv qachon obi mustaʼmalga aylanadi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sora,
]);
}
if($text == "Erning ahli-ayoli oldidagi burchlari"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/361",
       'caption'=>"<b> Erning ahli-ayoli oldidagi burchlari
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sora,
]);
}
if($text == "Safarda sunnat o'qiladimi"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/362",
       'caption'=>"<b> Safarda sunnat o'qiladimi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sora,
]);
}
if($text == "Paypoqqa mas'h tortsa bo'ladimi"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/363",
       'caption'=>"<b> Paypoqqa mas'h tortsa bo'ladimi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sora,
]);
}
if($text == "Hozirgi kunda fiqhiy mazhablarga ergashish shartmi"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/364",
       'caption'=>"<b> Hozirgi kunda fiqhiy mazhablarga ergashish shartmi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sora,
]);
}
if($text == "Namozdan so'ng nima deb duo qilish kerak"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/356",
       'caption'=>"<b> Namozdan so'ng nima deb duo qilish kerak
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sora,
]);
}
if($text == "Qur'on o‘qib savobini o‘tganlarga bag‘ishlasa bo‘ladimi"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/366",
       'caption'=>"<b> Qur'on o‘qib savobini o‘tganlarga bag‘ishlasa bo‘ladimi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sora,
]);
}
if($text == "Аrab tilini yaxshi bilgan kishi Qurʼondan oʼzicha hukm chiqarsa boʼladimi"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/367",
       'caption'=>"<b> Аrab tilini yaxshi bilgan kishi Qurʼondan oʼzicha hukm chiqarsa boʼladimi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sora,
]);
}
if($text == "Qaysi holatlarda namozni buzish mumkin"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/368",
       'caption'=>"<b> Qaysi holatlarda namozni buzish mumkin
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sora,
]);
}
if($text == " Shayton va jinlarning yomonligidan qanday saqlanish mumkin"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/369",
       'caption'=>"<b>  Shayton va jinlarning yomonligidan qanday saqlanish mumkin
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sora,
]);
}
if($text == "Qazo namozlarning hukmi"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/370",
       'caption'=>"<b> Qazo namozlarning hukmi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sora,
]);
}
if($text == "Televizor ko'rish harommi"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/371",
       'caption'=>"<b> Televizor ko'rish harommi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sora,
]);
}
if($text == "Dinimizda folbinlik va fol ochirishning hukmi"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/372",
       'caption'=>"<b> Dinimizda folbinlik va fol ochirishning hukmi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sora,
]);
}
if($text == "Tog'ut nima"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/373",
       'caption'=>"<b> Tog'ut nima
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sora,
]);
}
if($text == "Hamkasbim islomni qabul qilmoqchi. U nima qilishi kerak"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/374",
       'caption'=>"<b> Hamkasbim islomni qabul qilmoqchi. U nima qilishi kerak
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sora,
]);
}
if($text == "Sajdaga borish va undan turish tartibi qanday"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/375",
       'caption'=>"<b> Sajdaga borish va undan turish tartibi qanday
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sora,
]);
}
if($text == "Janoza namozi durust bo‘lishi uchun necha kishi ishtirok etishi kerak"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/376",
       'caption'=>"<b> Janoza namozi durust bo‘lishi uchun necha kishi ishtirok etishi kerak
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sora,
]);
}
if($text == "Hayit namozini uyda o'qisa bo'ladimi"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/377",
       'caption'=>"<b> Hayit namozini uyda o'qisa bo'ladimi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sora,
]);
}
if($text == "Qalbga ozor berishning hukmi"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/378",
       'caption'=>"<b> Qalbga ozor berishning hukmi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sora,
]);
}
if($text == "Niyatda namoz rakatlarini tayin qilish shartmi"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/379",
       'caption'=>"<b> Niyatda namoz rakatlarini tayin qilish shartmi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sora,
]);
}
if($text == "Zimmasida qazo namozlari boʼlganlar sunnatlarni oʼqimaydimi"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/380",
       'caption'=>"<b> Zimmasida qazo namozlari boʼlganlar sunnatlarni oʼqimaydimi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sora,
]);
}
if($text == "Ijtimoiy tarmoqlardagi diniy kanallar ishonchlimi"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/381",
       'caption'=>"<b> Ijtimoiy tarmoqlardagi diniy kanallar ishonchlimi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sora,
]);
}
if($text == "Ashuro kuni ro'zasining fazilati"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/382",
       'caption'=>"<b> Ashuro kuni ro'zasining fazilati
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sora,
]);
}
if($text == "Musofir kishi safari davomida namozlarini avtoulovlarda oʼqib ketishiga shariatimizda nima deyilgan"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/383",
       'caption'=>"<b> Musofir kishi safari davomida namozlarini avtoulovlarda oʼqib ketishiga shariatimizda nima deyilgan
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sora,
]);
}
if($text == "Jumaning 2 rakat farzidan oldin va keyin sunnatni o'qimay turib chiqib ketishning hukmi qanday"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/384",
       'caption'=>"<b> Jumaning 2 rakat farzidan oldin va keyin sunnatni o'qimay turib chiqib ketishning hukmi qanday
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sora,
]);
}
if($text == "Dinimizda odob-ahloqning o‘rni"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/386",
       'caption'=>"<b> Dinimizda odob-ahloqning o‘rni
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sora,
]);
}
if($text == "Ichkilik va giyohvand moddalarning salbiy ta'siri"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/387",
       'caption'=>"<b> Ichkilik va giyohvand moddalarning salbiy ta'siri
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sora,
]);
}
if($text == "Zakot nisobi sharhi (1-qism)"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/388",
       'caption'=>"<b> Zakot nisobi sharhi (1-qism)
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sora,
]);
}
if($text == "Ёшлар ҳаётида ижтимоий тармоқларнинг ўрни"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/389",
       'caption'=>"<b> Ёшлар ҳаётида ижтимоий тармоқларнинг ўрни
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sora,
]);
}
if($text == "Zakot nima va uni kim beradi"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/390",
       'caption'=>"<b> Zakot nima va uni kim beradi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sora,
]);
}
if($text == "Zakot nisobi sharhi (2-qism)"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/391",
       'caption'=>"<b> Zakot nisobi sharhi (2-qism)
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sora,
]);
}
if($text == "Aslida namozni qayerida qo'l ko'tariladi"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/392",
       'caption'=>"<b> Aslida namozni qayerida qo'l ko'tariladi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sora,
]);
}
if($text == "Karantin paytida safda oraliq masofani saqlash namozni nuqsonli qiladimi"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/393",
       'caption'=>"<b> Karantin paytida safda oraliq masofani saqlash namozni nuqsonli qiladimi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sora,
]);
}
if($text == "Qo'y va echkilardan zakot qanday ado etiladi"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/394",
       'caption'=>"<b> Qo'y va echkilardan zakot qanday ado etiladi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sora,
]);
}
if($text == "Islomda oila va nikoh qanday ahamiyatga ega"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/395",
       'caption'=>"<b> Islomda oila va nikoh qanday ahamiyatga ega
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sora,
]);
}
if($text == "Yoshlar ta'lim-tarbiyasida do'stning ahamiyati"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/396",
       'caption'=>"<b> Yoshlar ta'lim-tarbiyasida do'stning ahamiyati
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sora,
]);
}
if($text == "Dorul Islomdan hijrat qilinadimi"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/399",
       'caption'=>"<b> Dorul Islomdan hijrat qilinadimi
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sora,
]);
}
if($text == "Va'da va ushr haqida"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/400",
       'caption'=>"<b> Va'da va ushr haqida
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$sora,
]);
}
if($text == "📋Payg'ambarimizning ayollari"){
    bot('sendMessage',[
    'chat_id'=>$cid,
    'text'=>"<b> 📋Payg'ambarimizning ayollari </b> <i>bo'limiga xush kelibsiz Marhamat o'zingizga kerakli bo'lgan bo'limni tanlang</i>",
    'parse_mode'=>"html",
    'reply_markup'=>$Ona,
]);
}
if($text == "Hadicha Onamiz"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/568",
       'caption'=>"<b> Hadicha Onamiz
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Ona,
]);
}
if($text == "Oisha Onamiz"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/569",
       'caption'=>"<b> Oisha Onamiz
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Ona,
]);
}
if($text == "Hafsa Onamiz"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/570",
       'caption'=>"<b> Hafsa Onamiz
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Ona,
]);
}
if($text == "Zaynab binti Jaxsh Onamiz"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/571",
       'caption'=>"<b> Zaynab binti Jaxsh Onamiz
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Ona,
]);
}
if($text == "Juvayriya Onamiz"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/572",
       'caption'=>"<b> Juvayriya Onamiz
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Ona,
]);
}
if($text == "Ummu Habiba Romla bint Abu Sufyon Onamiz"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/573",
       'caption'=>"<b> Ummu Habiba Romla bint Abu Sufyon Onamiz
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Ona,
]);
}
if($text == "Ummu Salama Hind binti abi Umayya Onamiz"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/574",
       'caption'=>"<b> Ummu Salama Hind binti abi Umayya Onamiz
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Ona,
]);
}
if($text == "Moriya kibtiya Onamiz"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/575",
       'caption'=>"<b> Moriya kibtiya Onamiz
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$Ona,
]);
}
if($text == "💦Nafsni Poklash"){
    bot('sendMessage',[
    'chat_id'=>$cid,
    'text'=>"<b> 💦Nafsni Poklash </b> <i>bo'limiga xush kelibsiz Marhamat o'zingizga kerakli bo'lgan bo'limni tanlang</i>",
    'parse_mode'=>"html",
    'reply_markup'=>$nafs,
]);
}
if($text == "Nafsni Poklash 1 dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/479",
       'caption'=>"<b> Nafsni Poklash 1 dars
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$nafs,
]);
}
if($text == "Nafsni Poklash 2 dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/480",
       'caption'=>"<b> Nafsni Poklash 2 dars
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$nafs,
]);
}
if($text == "Nafsni Poklash 3 dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/481",
       'caption'=>"<b> Nafsni Poklash 3 dars
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$nafs,
]);
}
if($text == "Nafsni Poklash 4 dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/482",
       'caption'=>"<b> Nafsni Poklash 4 dars
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$nafs,
]);
}
if($text == "Nafsni Poklash 5 dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/483",
       'caption'=>"<b> Nafsni Poklash 5 dars
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$nafs,
]);
}
if($text == "Nafsni Poklash 6 dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/484",
       'caption'=>"<b> Nafsni Poklash 6 dars
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$nafs,
]);
}
if($text == "Nafsni Poklash 7 dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/485",
       'caption'=>"<b> Nafsni Poklash 7 dars
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$nafs,
]);
}
if($text == "Nafsni Poklash 8 dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/486",
       'caption'=>"<b> Nafsni Poklash 8 dars
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$nafs,
]);
}
if($text == "Nafsni Poklash 9 dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/491",
       'caption'=>"<b> Nafsni Poklash 9 dars
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$nafs,
]);
}
if($text == "Nafsni Poklash 10 dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/487",
       'caption'=>"<b> Nafsni Poklash 10 dars
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$nafs,
]);
}
if($text == "Nafsni Poklash 11 dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/488",
       'caption'=>"<b> Nafsni Poklash 11 dars
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$nafs,
]);
}
if($text == "Nafsni Poklash 12 dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/489",
       'caption'=>"<b> Nafsni Poklash 12 dars
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$nafs,
]);
}
if($text == "Nafsni Poklash 13 dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/490",
       'caption'=>"<b> Nafsni Poklash 13 dars
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$nafs,
]);
}
if($text == "🔘Islomda Farzand Tarbiyasi"){
    bot('sendMessage',[
    'chat_id'=>$cid,
    'text'=>"<b> 🔘Islomda Farzand Tarbiyasi </b> <i>bo'limiga xush kelibsiz Marhamat o'zingizga kerakli bo'lgan bo'limni tanlang</i>",
    'parse_mode'=>"html",
    'reply_markup'=>$tarbiya,
]);
}
if($text == "Islomda Farzand Tarbiyasi 1-dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/535",
       'caption'=>"<b> Islomda Farzand Tarbiyasi 1-dars
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tarbiya,
]);
}
if($text == "Islomda Farzand Tarbiyasi 2-dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/536",
       'caption'=>"<b> Islomda Farzand Tarbiyasi 2-dars
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tarbiya,
]);
}
if($text == "Islomda Farzand Tarbiyasi 3-dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/538",
       'caption'=>"<b> Islomda Farzand Tarbiyasi 3-dars
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tarbiya,
]);
}
if($text == "Islomda Farzand Tarbiyasi 4-dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/537",
       'caption'=>"<b> Islomda Farzand Tarbiyasi 4-dars
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tarbiya,
]);
}
if($text == "Islomda Farzand Tarbiyasi 5-dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/539",
       'caption'=>"<b> Islomda Farzand Tarbiyasi 5-dars
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tarbiya,
]);
}
if($text == "Islomda Farzand Tarbiyasi 6-dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/540",
       'caption'=>"<b> Islomda Farzand Tarbiyasi 6-dars
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tarbiya,
]);
}
if($text == "Islomda Farzand Tarbiyasi 7-dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/541",
       'caption'=>"<b> Islomda Farzand Tarbiyasi 7-dars
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tarbiya,
]);
}
if($text == "Islomda Farzand Tarbiyasi 8-dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/542",
       'caption'=>"<b> Islomda Farzand Tarbiyasi 8-dars
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tarbiya,
]);
}
if($text == "Islomda Farzand Tarbiyasi 9-dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/543",
       'caption'=>"<b> Islomda Farzand Tarbiyasi 9-dars
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tarbiya,
]);
}
if($text == "Islomda Farzand Tarbiyasi 10-dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/544",
       'caption'=>"<b> Islomda Farzand Tarbiyasi 10-dars
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tarbiya,
]);
}
if($text == "Islomda Farzand Tarbiyasi 11-dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/545",
       'caption'=>"<b> Islomda Farzand Tarbiyasi 11-dars
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tarbiya,
]);
}
if($text == "Islomda Farzand Tarbiyasi 12-dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/546",
       'caption'=>"<b> Islomda Farzand Tarbiyasi 12-dars
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tarbiya,
]);
}
if($text == "Islomda Farzand Tarbiyasi 13-dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/547",
       'caption'=>"<b> Islomda Farzand Tarbiyasi 13-dars
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tarbiya,
]);
}
if($text == "Islomda Farzand Tarbiyasi 14-dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/548",
       'caption'=>"<b> Islomda Farzand Tarbiyasi 14-dars
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tarbiya,
]);
}
if($text == "Islomda Farzand Tarbiyasi 15-dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/549",
       'caption'=>"<b> Islomda Farzand Tarbiyasi 15-dars
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tarbiya,
]);
}
if($text == "Islomda Farzand Tarbiyasi 16-dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/550",
       'caption'=>"<b> Islomda Farzand Tarbiyasi 16-dars
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tarbiya,
]);
}
if($text == "Islomda Farzand Tarbiyasi 17-dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/551",
       'caption'=>"<b> Islomda Farzand Tarbiyasi 17-dars
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tarbiya,
]);
}
if($text == "Islomda Farzand Tarbiyasi 18-dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/552",
       'caption'=>"<b> Islomda Farzand Tarbiyasi 18-dars
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tarbiya,
]);
}
if($text == "Islomda Farzand Tarbiyasi 19-dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/553",
       'caption'=>"<b> Islomda Farzand Tarbiyasi 19-dars
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tarbiya,
]);
}
if($text == "Islomda Farzand Tarbiyasi 20-dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/555",
       'caption'=>"<b> Islomda Farzand Tarbiyasi 20-dars
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tarbiya,
]);
}
if($text == "Islomda Farzand Tarbiyasi 21-dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/554",
       'caption'=>"<b> Islomda Farzand Tarbiyasi 21-dars
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tarbiya,
]);
}
if($text == "Islomda Farzand Tarbiyasi 22-dars"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/TARIINISG/556",
       'caption'=>"<b> Islomda Farzand Tarbiyasi 22-dars
       
Video yoqqan Bo'lsa dostlaringizga ham ulashing!</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$tarbiya,
]);
}
if($text == "🎧Васатия – ҳаёт йўли"){
    bot('sendMessage',[
    'chat_id'=>$cid,
    'text'=>"<b> https://telegra.ph/Vasatiya--ҳayot-jўli-11-13 </b> <i> Marhamat o'zingizga kerakli bo'lgan bo'limni tanlang</i>",
    'parse_mode'=>"html",
    'reply_markup'=>$Vasat,
]);
}
if($text == "Кириш"){
      bot('sendAudio',[
      'chat_id'=>$cid,
      'audio'=>"https://t.me/SACOLJFTUHV/3",
      'parse_mode'=>'html',
]);
}
if($text == "Васатияни қандай тушунамиз?"){
      bot('sendAudio',[
      'chat_id'=>$cid,
      'audio'=>"https://t.me/SACOLJFTUHV/4",      
      'parse_mode'=>'html',
]);
}
if($text == "Васатиянинг маъноси ва таърифи"){
      bot('sendAudio',[
      'chat_id'=>$cid,
      'audio'=>"https://t.me/SACOLJFTUHV/5",      
      'parse_mode'=>'html',
]);
}
if($text == "Қуръонда васатийлик"){
      bot('sendAudio',[
      'chat_id'=>$cid,
      'audio'=>"https://t.me/SACOLJFTUHV/6",
      'parse_mode'=>'html',
]);
}
if($text == "Cуннатда васатийлик"){
      bot('sendAudio',[
      'chat_id'=>$cid,
      'audio'=>"https://t.me/SACOLJFTUHV/7",      
      'parse_mode'=>'html',
]);
}
if($text == "Васатия ва салафи солиҳлар"){
      bot('sendAudio',[
      'chat_id'=>$cid,
      'audio'=>"https://t.me/SACOLJFTUHV/8",
      'parse_mode'=>'html',
]);
}
if($text == "Уламолар ва васатийлик"){
      bot('sendAudio',[
      'chat_id'=>$cid,
      'audio'=>"https://t.me/SACOLJFTUHV/9",
      'parse_mode'=>'html',
]);
}
if($text == "Имом Ғаззолий ва васатия"){
      bot('sendAudio',[
      'chat_id'=>$cid,
      'audio'=>"https://t.me/SACOLJFTUHV/10",
      'parse_mode'=>'html',
]);
}
if($text == "Мусулмонлар васат уммат"){
      bot('sendAudio',[
      'chat_id'=>$cid,
      'audio'=>"https://t.me/SACOLJFTUHV/11",
      'parse_mode'=>'html',
]);
}
if($text == "Ақийдада васатийлик"){
      bot('sendAudio',[
      'chat_id'=>$cid,
      'audio'=>"https://t.me/SACOLJFTUHV/12",
      'parse_mode'=>'html',
]);
}
if($text == "Илоҳ ҳақидаги ақийда"){
      bot('sendAudio',[
      'chat_id'=>$cid,
      'audio'=>"https://t.me/SACOLJFTUHV/13",
      'parse_mode'=>'html',
]);
}
if($text == "Фаришталар ҳақидаги ақийда"){
      bot('sendAudio',[
      'chat_id'=>$cid,
      'audio'=>"https://t.me/SACOLJFTUHV/14",
      'parse_mode'=>'html',
]);
}
if($text == "Пайғамбарлар ҳақидаги ақийда"){
      bot('sendAudio',[
      'chat_id'=>$cid,
      'audio'=>"https://t.me/SACOLJFTUHV/15",
      'parse_mode'=>'html',
]);
}
if($text == "Жинлар ҳақидаги ақийда"){
      bot('sendAudio',[
      'chat_id'=>$cid,
      'audio'=>"https://t.me/SACOLJFTUHV/16",
      'parse_mode'=>'html',
]);
}
if($text == "Ақийдадаги васатийлик намунаси"){
      bot('sendAudio',[
      'chat_id'=>$cid,
      'audio'=>"https://t.me/SACOLJFTUHV/17",
      'parse_mode'=>'html',
]);
}
if($text == "Шариатдаги васатийлик"){
      bot('sendAudio',[
      'chat_id'=>$cid,
      'audio'=>"https://t.me/SACOLJFTUHV/18",
      'parse_mode'=>'html',
]);
}
if($text == "Ислом таклифлари ва аҳкомларидаги васатийлик"){
      bot('sendAudio',[
      'chat_id'=>$cid,
      'audio'=>"https://t.me/SACOLJFTUHV/19",
      'parse_mode'=>'html',
]);
}
if($text == "Фарз ибодатидаги васатийлик"){
      bot('sendAudio',[
      'chat_id'=>$cid,
      'audio'=>"https://t.me/SACOLJFTUHV/20",
      'parse_mode'=>'html',
]);
}
if($text == "Намоздаги  васатийлик"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/21",
'parse_mode'=>'html',

]);
}
if($text == "Закотдаги  васатийлик"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/22",
'parse_mode'=>'html',
]);
}
if($text == "Ҳаждаги  васатийлик"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/24",
'parse_mode'=>'html',
]);
}
if($text == "Нафл ибодатлардаги  васатийлик"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/23",
'parse_mode'=>'html',
]);
}
if($text == "Нафл намозидаги  васатийлик"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/25",
'parse_mode'=>'html',
]);
}
if($text == "Нафл рўзадаги  васатийлик"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/26",
'parse_mode'=>'html',
]);
}
if($text == "Нафл садақада васатийлик"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/27",
'parse_mode'=>'html',
]);
}
if($text == "Қуръон тиловатидаги васатийлик"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/28",
'parse_mode'=>'html',
]);
}
if($text == "Тасаввуфдаги васатийлик"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/29",
'parse_mode'=>'html',
]);
}
if($text == "Иқтисоддаги васатийлик"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/30",
'parse_mode'=>'html',
]);
}
if($text == "Дунё ва охиратдаги васатийлик"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/31",
'parse_mode'=>'html',
]);
}
if($text == "Халқаро алоқалардаги васатийлик"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/32",
'parse_mode'=>'html',
]);
}
if($text == "Васатийликнинг фойдалари"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/33",
'parse_mode'=>'html',
]);
}
if($text == "Васатийликдан оғишнинг оқибатлари"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/34",
'parse_mode'=>'html',
]);
}
if($text == "Динга жафочи бўлиш сабаблари"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/35",
'parse_mode'=>'html',
]);
}
if($text == "Динда ҳаддан ошиш"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/36",
'parse_mode'=>'html',
]);
}
if($text == "Қуръон ва суннат ғулув ҳақида"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/37",
'parse_mode'=>'html',
]);
}
if($text == "Cалафи солиҳлар  ғулув ҳақида"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/38",
'parse_mode'=>'html',
]);
}
if($text == "Қадимги уламолар  ғулув ҳақида"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/39",
'parse_mode'=>'html',
]);
}
if($text == "Ҳозирги уламолар  ғулув ҳақида"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/40",
'parse_mode'=>'html',
]);
}
if($text == "Абу Ҳанифанинг бағрикенглиги"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/41",
'parse_mode'=>'html',
]);
}
if($text == "Ибн Ханбалнинг бағрикенглиги"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/42",
'parse_mode'=>'html',
]);
}
if($text == "Ибн Хазмнинг бағрикенглиги"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/63",
'parse_mode'=>'html',
]);
}
if($text == "Лайс ибн Саъднинг бағрикенглиги"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/64",
'parse_mode'=>'html',
]);
}
if($text == "Ғулувнинг зарарларидан"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/65",
'parse_mode'=>'html',
]);
}
if($text == "Ғулувнинг турлари"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/66",
'parse_mode'=>'html',
]);
}
if($text == "Амалий ғулув"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/67",
'parse_mode'=>'html',
]);
}
if($text == "Эътиқодий  ғулув"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/68",
'parse_mode'=>'html',
]);
}
if($text == "Хаворижлар ва диндан отилиб чиқувчилар ҳақида"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/69",
'parse_mode'=>'html',
]);
}
if($text == "Ғулувнинг сабаблари"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/70",
'parse_mode'=>'html',
]);
}

if($text == "Замонавий ғулувнинг сабаблари"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/71",
'parse_mode'=>'html',
]);
}
if($text == "Ғулувнинг  оқибатлари"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/72",
'parse_mode'=>'html',
]);
}
if($text == "Кофирлик ҳақида фатво бериш"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/73",
'parse_mode'=>'html',
]);
}
if($text == "Куфрнинг маъноси ва таърифи"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/74",
'parse_mode'=>'html',
]);
}
if($text == "Иймон ва куфр шўъбалари аралашуви"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/75",
'parse_mode'=>'html',
]);
}
if($text == "Бировни кофир дейишнинг хатари"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/76",
'parse_mode'=>'html',
]);
}
if($text == "Ғулувчилар кимларни кофир дейдилар"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/77",
'parse_mode'=>'html',
]);
}
if($text == "Жамоатдан четланганни кофирга чиқариш"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/78",
'parse_mode'=>'html',
]);
}
if($text == "Маъсият туфайли кофирга чиқариш"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/79",
'parse_mode'=>'html',
]);
}
if($text == "Ҳижрат қилмаганни кофирга чиқариш"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/80",
'parse_mode'=>'html',
]);
}
if($text == "Тақлидга қарши ғулув"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/81",
'parse_mode'=>'html',
]);
}
if($text == "Замонавий раддия"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/82",
'parse_mode'=>'html',
]);
}
if($text == "Амал ва ўзини тутишдаги ғулув — террорчилик"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/83",
'parse_mode'=>'html',
]);
}
if($text == "Таълимни харом деб бесаводликка чақириш"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/84",
'parse_mode'=>'html',
]);
}
if($text == "Макка босқичи бидъати"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/85",
'parse_mode'=>'html',
]);
}
if($text == "Ҳукумат ишида ишламаслик"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/86",
'parse_mode'=>'html',
]);
}
if($text == "Васатийлик — ҳаёт йўли"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/87",
'parse_mode'=>'html',
]);
}
if($text == "🎧Ҳадис ва Ҳаёт 18-жузи: ТИБ ВА ДАМ"){
    bot('sendmessage',[
    'chat_id'=>$cid,
    'text'=>"<b> https://telegra.ph/Ҳadis-va-Ҳayot-18-zhuz-Tib-va-dam-kitobi-11-13 </b> <i>Marhamat O'zingizga kerakli Audio Darslarni tanlang</i>",
    'parse_mode'=>"html",
    'reply_markup'=>$Tabobat,
]);
}
if($text == "«Кириш» қисми"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/337",
'parse_mode'=>'html',
]);
}
if($text == "«Кириш» қисми 2-кисм"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/338",
'parse_mode'=>'html',
]);
}
if($text == "Тозаликка риоя қилиш"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/339",
'parse_mode'=>'html',
]);
}
if($text == "СОҒЛИҚҚА ЗАРАР EТКАЗУВЧИ ВА АТРОФНИ ИФЛОС ҚИЛУВЧИ НАРСАЛАР"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/340",
'parse_mode'=>'html',
]);
}
if($text == "БАДАНТАРБИЯ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/341",
'parse_mode'=>'html',
]);
}
if($text == "СОҒЛИҚҚА ЗАРАРЛИ НАРСАЛАРНИНГ ҲАРОМ ҚИЛИНИШИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/342",
'parse_mode'=>'html',
]);
}
if($text == "Исроф ва Кизганиш"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/343",
'parse_mode'=>'html',
]);
}
if($text == "ЖИСМНИ ТОЛИҚТИРИШДАН ҚАЙТАРИШ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/344",
'parse_mode'=>'html',
]);
}
if($text == "СОҒЛИҚНИ САҚЛАШ МАҚСАДИДА EНГИЛЛИК ВА РУХСАТЛАР БЕРИЛГАНИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/345",
'parse_mode'=>'html',
]);
}
if($text == "ХУЛOСА"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/346",
'parse_mode'=>'html',
]);
}
if($text == "ВАБОДА САБР ҚИЛИШНИНГ АЖРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/347",
'parse_mode'=>'html',
]);
}
if($text == "CЕҲР"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/348",
'parse_mode'=>'html',
]);
}
if($text == "ЗАҲАР"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/349",
'parse_mode'=>'html',
]);
}
if($text == "БЕМОР КЎРИШ СУННАТДИР"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/350",
'parse_mode'=>'html',
]);
}
if($text == "МУСИБАТДА АЙТИЛАДИГАН НАРСА"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/351",
'parse_mode'=>'html',
]);
}
if($text == "ДАВОЛАНИШ ЖОИЗЛИГИ ҲАҚИДА"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/352",
'parse_mode'=>'html',
]);
}
if($text == "ПАРҲЕЗ ДАВОНИНГ БОШИДИР"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/353",
'parse_mode'=>'html',
]);
}
if($text == "НАБАВИЙ ТИБ ҲАҚИДА"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/354",
'parse_mode'=>'html',
]);
}
if($text == "АСАЛ, ҚИЗИГАН НАРСА БОСИШ ВА ҚОН ОЛИШ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/355",
'parse_mode'=>'html',
]);
}
if($text == "ҚОН ОЛИШ ЖОЙИ ВА ЗАМОНИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/356",
'parse_mode'=>'html',
]);
}
if($text == "ҚОРА ДОНА"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/357",
'parse_mode'=>'html',
]);
}
if($text == "УВДУ ҲИНДИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/358",
'parse_mode'=>'html',
]);
}
if($text == "ОҒИЗДАН ИЧИЛАДИГАН, БУРУНДАН ТОМИЗИЛАДИГАН ВА ИЧНИ ЮРГИЗАДИГАН ДОРИЛАР"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/359",
'parse_mode'=>'html',
]);
}
if($text == "АЖВА ВА КАМЪА"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/360",
'parse_mode'=>'html',
]);
}
if($text == "ИСИТМА ВА КЎЗ ТЕККАНГА СУВ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/361",
'parse_mode'=>'html',
]);
}
if($text == "ТАЛБИЙНА ВА СУРМА"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/362",
'parse_mode'=>'html',
]);
}
if($text == "ЗАЙТУН МОЙИ ВА САНО"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/363",
'parse_mode'=>'html',
]);
}
if($text == "ТУЯНИНГ СУТИ ВА ПЕШОБИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/364",
'parse_mode'=>'html',
]);
}
if($text == "ЖАРОҲАТГА КУЛ БОСИШ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/365",
'parse_mode'=>'html',
]);
}
if($text == "СЕМИРИШ УЧУН ТАРРА ВА ҲЎЛ ХУРМО"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/366",
'parse_mode'=>'html',
]);
}
if($text == "ҲАРОМ ИЛА ДАВОЛАНИШ ЖОИЗ ЭМАС"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/367",
'parse_mode'=>'html',
]);
}
if($text == "ДАМ СОЛИШ ҲАҚИДА"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/369",
'parse_mode'=>'html',
]);
}
if($text == "ДАМ СОЛИШ КАЛИМАЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/370",
'parse_mode'=>'html',
]);
}
if($text == "ҚУРЪОН ИЛА ДАМ СОЛИШ ВА УНГА АЖР ОЛИШНИНГ ЖОИЗЛИГИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/371",
'parse_mode'=>'html',
]);
}
if($text == "ФАЛАҚ СУРАСИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/372",
'parse_mode'=>'html',
]);
}
if($text == "НАС СУРАСИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/373",
'parse_mode'=>'html',
]);
}
if($text == "КАСАЛЛИК ЮҚИШИ ВА ШУМЛАНИШ ЙЎҚ, ЭҲТИЁТ БЎЛИШ ЯХШИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/374",
'parse_mode'=>'html',
]);
}
if($text == "ЯХШИ ФОЛ ҚАНДОҚ ЯХШИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/375",
'parse_mode'=>'html',
]);
}
if($text == "КОҲИНЛИК, ЧИЗИҚ ЧИЗИШ ВА ТОШ ТАШЛАШi"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/376",
'parse_mode'=>'html',
]);
}
if($text == "АЛЛОҲ ТАОЛОГА ТАВАККУЛ АФЗАЛ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/377",
'parse_mode'=>'html',
]);
}
if($text == "ТИБ СОҲАСИДАГИ ИСЛОМ МЎЪЖИЗАСИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/378",
'parse_mode'=>'html',
]);
}
if($text == "ИСЛОМИЙ ТИБГА ЎХШАШ ТИБ БОРМИ?"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/379",
'parse_mode'=>'html',
]);
}
if($text == "ТАБИБЛАРНИ ИМТИҲОНДАН ЎТКАЗИШ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/380",
'parse_mode'=>'html',
]);
}
if($text == "МУСУЛМОНЛАРНИНГ ТИББИЙ КАШФИЁТЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/381",
'parse_mode'=>'html',
]);
}
if($text == "МУСУЛМОНЛАРНИНГ ТИББИЙ КИТОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/382",
'parse_mode'=>'html',
]);
}
if($text == "ДОРИШУНОСЛИК"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/383",
'parse_mode'=>'html',
]);
}
if($text == "🎧Ҳадис ва Ҳаёт 9-жуз Рўза китоби"){
    bot('sendMessage',[
    'chat_id'=>$cid,
    'text'=>"<b>https://telegra.ph/%D2%B2adis-va-%D2%B2ayot-9-zhuz-R%D1%9Eza-kitobi-04-30</b> <i> Marhamat ozingizga kerakli audio darslikni tanlang</i>",
    'parse_mode'=>"html",
    'reply_markup'=>$roza,
]);
}
if($text == "Рўза китоби - Кириш"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/822",
'parse_mode'=>'html',
]);
}
if($text == "Рамазон рўзасининг фарзлиги ҳақида"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/823",
'parse_mode'=>'html',
]);
}
if($text == "Рўзанинг фазилатлари ҳақида"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/824",
'parse_mode'=>'html',
]);
}
if($text == "Рўзанинг асли ва вақти баёни"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/825",
'parse_mode'=>'html',
]);
}
if($text == "Фажри содиқнинг аломати"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/826",
'parse_mode'=>'html',
]);
}
if($text == "Рўза тутишни бошлаш ҳилолни кўриш билан бўлади"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/827",
'parse_mode'=>'html',
]);
}
if($text == "Ҳилолни кўришлик бир одил киши гувоҳлиги билан ҳам"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/828",
'parse_mode'=>'html',
]);
}
if($text == "Ҳар ўлка ўзи ҳилол кўради"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/829",
'parse_mode'=>'html',
]);
}
if($text == "Ният ва рўзадорга мустаҳаб нарсалар ҳақида"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/830",
'parse_mode'=>'html',
]);
}
if($text == "Ифтор пайтидаги дуо"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/831",
'parse_mode'=>'html',
]);
}
if($text == "Тилни тийиш"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/832",
'parse_mode'=>'html',
]);
}
if($text == "Мисвок"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/833",
'parse_mode'=>'html',
]);
}
if($text == "Рамазонда Қуръон тиловати ва карамли бўлиш"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/834",
'parse_mode'=>'html',
]);
}
if($text == "Таровеҳ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/835",
'parse_mode'=>'html',
]);
}
if($text == "Таровеҳ намози адади"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/836",
'parse_mode'=>'html',
]);
}
if($text == "Маън қилинган ишлар жинсий яқинлик"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/837",
'parse_mode'=>'html',
]);
}
if($text == "Қасддан еб ичмоқ ва қаъй қилмоқ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/838",
'parse_mode'=>'html',
]);
}
if($text == "Улаб тутиш"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/839",
'parse_mode'=>'html',
]);
}
if($text == "Қучоқлаш ва ўпиш"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/840",
'parse_mode'=>'html',
]);
}
if($text == "Муболаға ила оғиз-бурун чайқаш"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/841",
'parse_mode'=>'html',
]);
}
if($text == "Рўзадорга жунублик халал бермайди"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/842",
'parse_mode'=>'html',
]);
}
if($text == "Қон олдириш, сурма қўйиш, ғусл қилиш"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/843",
'parse_mode'=>'html',
]);
}
if($text == "Рўза очишга сабаб нарсалар"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/844",
'parse_mode'=>'html',
]);
}
if($text == "Қари, ҳомиладор, беморлар"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/845",
'parse_mode'=>'html',
]);
}
if($text == "Ҳайзли, нифосли аёллар"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/846",
'parse_mode'=>'html',
]);
}
if($text == "Маййит зиммасидаги қазони ўташ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/847",
'parse_mode'=>'html',
]);
}
if($text == "Лайлатул қард ҳақида"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/848",
'parse_mode'=>'html',
]);
}
if($text == "У рамазоннинг охирги ўн кечасида"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/849",
'parse_mode'=>'html',
]);
}
if($text == "У 27-кечада экани машҳур"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/850",
'parse_mode'=>'html',
]);
}
if($text == "Рўза тутиш маън қилинган кунлар"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/851",
'parse_mode'=>'html',
]);
}
if($text == "Шаъбоннинг сўнгги ярми"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/852",
'parse_mode'=>'html',
]);
}
if($text == "Шак куни"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/853",
'parse_mode'=>'html',
]);
}
if($text == "Ёлғиз жума ёки шанба рўзаси"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/854",
'parse_mode'=>'html',
]);
}
if($text == "Нафл рўзаси ҳақида"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/855",
'parse_mode'=>'html',
]);
}
if($text == "Муҳаррам ойи рўзаси"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/856",
'parse_mode'=>'html',
]);
}
if($text == "Ошуро куни"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/857",
'parse_mode'=>'html',
]);
}
if($text == "Ошуро куни рўзасининг фазли"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/858",
'parse_mode'=>'html',
]);
}
if($text == "Ражаб рўзаси"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/859",
'parse_mode'=>'html',
]);
}
if($text == "Шаъбон рўзаси"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/860",
'parse_mode'=>'html',
]);
}
if($text == "Шаъбон ярми рўзаси"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/861",
'parse_mode'=>'html',
]);
}
if($text == "Шавволдан кун рўза тутиш"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/862",
'parse_mode'=>'html',
]);
}
if($text == "Зул-хижжанинг куни"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/863",
'parse_mode'=>'html',
]);
}
if($text == "Хожидан бошқасига арафа куни рўзаси"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/864",
'parse_mode'=>'html',
]);
}
if($text == "Ҳар ойдан кун рўза тутиш"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/865",
'parse_mode'=>'html',
]);
}
if($text == "Оқ кунлар рўзаси"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/866",
'parse_mode'=>'html',
]);
}
if($text == "Душанба ва пайшанба кунлари рўзаси"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/867",
'parse_mode'=>'html',
]);
}
if($text == "Бир кун тутиб, бир кун очиш"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/868",
'parse_mode'=>'html',
]);
}
if($text == "Доимий рўза тутиш"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/869",
'parse_mode'=>'html',
]);
}
if($text == "Нафл рўза тутувчи ўзига ўзи амир"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/870",
'parse_mode'=>'html',
]);
}
if($text == "Эътикоф ҳақида"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/871",
'parse_mode'=>'html',
]);
}
if($text == "Эътикоф ўтирувчи ҳожат учун масжиддан чиқади"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/872",
'parse_mode'=>'html',
]);
}
if($text == "Эътикоф учун рўза шартми"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/873",
'parse_mode'=>'html',
]);
}
if($text == "Рўза китоби - Хулоса"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/874",
'parse_mode'=>'html',
]);
}
if($text == "Haqida 🌙"){
    bot('sendMessage',[
    'chat_id'=>$cid,
    'text'=>"Assalomu Aleykum aziz dindoshim. Bu bot sunnat-ahli uchun yaratilkan. 

Shahidlar Bobo Jome Masjidi!
@ShahidlarBobo",
    'parse_mode'=>"html",
    'reply_markup'=>$keyseis,
]);
}
$reply = $message->reply_to_message->text;
if (!file_exists($folder.'/test.fd3')) {
  mkdir($folder);
  file_put_contents($folder.'/test.fd3', 'by ');
}

if (!file_exists($folder2.'/test.fd3')) {
  mkdir($folder2);
  file_put_contents($folder2.'/test.fd3', 'by ');
}

if (file_exists($filee)) {
  $step = file_get_contents($filee);
}


$tx = $message->text;
$name = $message->chat->first_name;
$user = $message->from->username;
$kun1 = date('z', strtotime('2 hour'));

$rpl = json_encode([
           'resize_keyboard'=>false,
            'force_reply' => true,
            'selective' => true
        ]);
        
$date = date('d-M Y',strtotime('2 hour'));
$time = date('H:i', strtotime('2 hour')); 
if($text == "⭕Taklifim Bor"){
	bot('sendmessage',[
	'chat_id'=>$cid,
	'text'=>"Assalomu Aleykum Marhamat Taklifingizni kiriting!",
	'reply_markup'=>$rpl,
		]);
		}
		if($reply=="Assalomu Aleykum Marhamat Taklifingizni kiriting!"){
			bot('sendmessage',[
			'chat_id'=>$admin,
			'text'=>"<b>Taklif keldi!</b>
      
🧒Yuboruvchi: $name

🔷Login: @$user

🔢Id raqami: <code>$cid</code>

🗒️Taklif: <i>$tx</i>

⌚Soat-<b>$time</b> Bugun-<b>$date</b>",
'parse_mode'=>"html",
]);
sleep(2);
bot('sendmessage',[
'chat_id'=>$cid,
'text'=>"*Yaxshi adminga xabar yetkazildi!*\nTaklifingiz adminlarga yoqsa 24 soat ichida siz bilan bog'lanishadi.",
'parse_mode'=>"markdown",
'reply_markup'=>$keyseis,
]);
}
    
    if($text == "❓Savolim Bor"){
	bot('sendmessage',[
	'chat_id'=>$cid,
	'text'=>"Assalomu Aleykum Marhamat Savolingizni kiriting!",
	'reply_markup'=>$rpl,
		]);
		}
		if($reply=="Assalomu Aleykum Marhamat Savolingizni kiriting!"){
			bot('sendmessage',[
			'chat_id'=>$admin,
			'text'=>"<b>Savol keldi!</b>
      
🧒Yuboruvchi: $name

🔷Login: @$user

🔢Id raqami: <code>$cid</code>

🗒️Savol: <i>$tx</i>

⌚Soat-<b>$time</b> Bugun-<b>$date</b>",
'parse_mode'=>"html",
]);
sleep(2);
bot('sendmessage',[
'chat_id'=>$cid,
'text'=>"*Yaxshi adminga xabar yetkazildi!*\nSavolingiz adminlarga yoqsa 24 soat ichida  javobini yozib yuboradilar!",
'parse_mode'=>"markdown",
'reply_markup'=>$keyseis,
]);
}
if($text == "🎧Мукаммал саодат йўли"){
    bot('sendMessage',[
    'chat_id'=>$cid,
    'text'=>"<b> https://telegra.ph/Mukammal-saodat-jўli-11-13 </b> <i> Marhamat o'zingizga kerakli bo'lgan bo'limni tanlang</i>",
    'parse_mode'=>"html",
    'reply_markup'=>$Saodat,
]);
}
if($text == "Мукаммал_саодат_йўли  Муқаддима 1"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/438",
'parse_mode'=>'html',
]);
}
if($text == "Мукаммал_саодат_йўли  Муқаддима 2"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/439",
'parse_mode'=>'html',
]);
}
if($text == "Инсон ҳақиқати"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/440",
'parse_mode'=>'html',
]);
}
if($text == "Саодат излаб"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/441",
'parse_mode'=>'html',
]);
}
if($text == "Маърифат излаб"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/442",
'parse_mode'=>'html',
]);
}
if($text == "Ақлни пешлайдиган илм"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/443",
'parse_mode'=>'html',
]);
}
if($text == "Диний маърифатнинг хусусияти"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/444",
'parse_mode'=>'html',
]);
}
if($text == "Ислом-илм динидир"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/445",
'parse_mode'=>'html',
]);
}
if($text == "Илм ислом тарафида"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/446",
'parse_mode'=>'html',
]);
}
if($text == "Исломнинг мақсадлари"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/447",
'parse_mode'=>'html',
]);
}
if($text == "Исломнинг асослари"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/448",
'parse_mode'=>'html',
]);
}
if($text == "Дин таълимотлари"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/449",
'parse_mode'=>'html',
]);
}
if($text == "Аллоҳ таолога иймон Фаришталарга иймон"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/450",
'parse_mode'=>'html',
]);
}
if($text == "Илоҳий китобларга иймон Пайғамбарларга иймон"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/451",
'parse_mode'=>'html',
]);
}
if($text == "Охират кунига иймон"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/452",
'parse_mode'=>'html',
]);
}
if($text == "Илоҳиёт"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/453",
'parse_mode'=>'html',
]);
}
if($text == "Нубувват"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/455",
'parse_mode'=>'html',
]);
}
if($text == "Ғайбиёт"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/456",
'parse_mode'=>'html',
]);
}
if($text == "Ислом шариати"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/457",
'parse_mode'=>'html',
]);
}
if($text == "Инсон ҳаётини муҳофаза қилиш"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/458",
'parse_mode'=>'html',
]);
}
if($text == "Жони бор ҳомиласини олдириб ташлаган аёл ўз боласини қотили бўлади"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/459",
'parse_mode'=>'html',
]);
}
if($text == "Ислом шариати инсон ҳаётини муҳофаза қилиш мақсадида ўзини ўзи ўлдиришни ҳаромдир"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/460",
'parse_mode'=>'html',
]);
}
if($text == "Ислом шариати инсон ҳаётини муҳофаза қилиш мақсадида ўзини ўзи ўлдиришни ҳаромдир"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/461",
'parse_mode'=>'html',
]);
}
if($text == "Ислом шариати инсон ҳаётини муҳофаза қилиш мақсадида инсонни уриш ва азоблашни ман қилган"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/462",
'parse_mode'=>'html',
]);
}
if($text == "Ислом шариати инсон ҳаётини муҳофаза қилиш мақсадида ўзини ўзи қийнашни ман қилди"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/463",
'parse_mode'=>'html',
]);
}
if($text == "Инсоннинг ақлини муҳофаза қилиш"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/464",
'parse_mode'=>'html',
]);
}
if($text == "Ислом шариати ақлни муҳофаза қилиш мақсадида, ақлга зарар етказадиган нарсаларни ҳаром қилади"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/465",
'parse_mode'=>'html',
]);
}
if($text == "Ислом шариати ақлни муҳофаза қилиш мақсадида ақлни ўстиришни фарз қилган"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/466",
'parse_mode'=>'html',
]);
}
if($text == "Ислом шариати ақлни муҳофаза қилиш мақсадида ақлни хурофот, зарарли ҳаёл ва фикрлардан озод этди"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/467",
'parse_mode'=>'html',
]);
}
if($text == "Инсоннинг динини муҳофаза қилиш"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/468",
'parse_mode'=>'html',
]);
}
if($text == "Ислом шариати динни муҳофаза қилиш мақсадида инсонларга диндорлик таянчи бўлган иймон асосларини тарғиб қилди"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/469",
'parse_mode'=>'html',
]);
}
if($text == "Ислом шариати динни муҳофаза қилиш мақсадида иймон-эътиқоднинг ақлий ва илмий-ҳужжатлар асосида бўлишини таъминлади"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/470",
'parse_mode'=>'html',
]);
}
if($text == "Ислом шариати динни муҳофаза қилиш мақсадида диндорликка чақириб, динсизликдан қайтаришни йўлга қўйди"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/471",
'parse_mode'=>'html',
]);
}
if($text == "Ислом шариати динни муҳофаза қилиш мақсадида инсонларга эътиқод ва диндорлик эркилигини берди"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/472",
'parse_mode'=>'html',
]);
}
if($text == "Ислом шариати дин муҳофаза муҳофазаси учун ватанни ҳам тарк қилишни жорий қилди"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/473",
'parse_mode'=>'html',
]);
}
if($text == "Инсоннинг наслини муҳофаза қилиш"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/474",
'parse_mode'=>'html',
]);
}
if($text == "Ислом шариати инсон наслини муҳофаза қилиш мақсадида никоҳни жорий қилди"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/475",
'parse_mode'=>'html',
]);
}
if($text == "Ислом шариати инсон наслини муҳофаза қилиш мақсадида шариатга иддани киритди"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/476",
'parse_mode'=>'html',
]);
}
if($text == "Ислом шариати инсон наслини муҳофаза қилиш мақсадида насабнинг поклигига катта аҳамият берди"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/478",
'parse_mode'=>'html',
]);
}
if($text == "Ислом шариати инсон наслини муҳофаза қилиш мақсадида яқин қариндошлар орасида никоҳни ҳаром қилди"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/479",
'parse_mode'=>'html',
]);
}
if($text == "Ислом шариати инсон наслини муҳофаза қилиш мақсадида ота-оналарга ва жамиятга ёш авлод учун жавобгар этди"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/480",
'parse_mode'=>'html',
]);
}
if($text == "Ислом шариати инсон наслини муҳофаза қилиш мақсадида наслга зарарли жинсий алоқаларни ҳаром қилди"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/481",
'parse_mode'=>'html',
]);
}
if($text == "Ислом шариати насл муҳофазасига футур етказадиган барча ишларни таъқиқлаган"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/482",
'parse_mode'=>'html',
]);
}
if($text == "Ислом инсон наслини муҳофаза қилиш мақсадида наслга зарар етказадиган жинсий алоқаларни қилганларни жазолайди"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/484",
'parse_mode'=>'html',
]);
}

if($text == "Инсоннинг мол-мулкини муҳофаза қилиш"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/485",
'parse_mode'=>'html',
]);
}
if($text == "Ислом шариати мол-мулкни муҳофаза қилиш мақсадида меҳнат қилишга, ризқни териб ейишга ундади"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/486",
'parse_mode'=>'html',
]);
}
if($text == "Инсоннинг молни муҳофаза қилиш мақсадида бировнинг молини ботил йўл билан ейишни ҳаром қилди"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/487",
'parse_mode'=>'html',
]);
}
if($text == "Инсоннинг молни муҳофаза қилиш мақсадида рибохўрликни ҳаром қилди"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/488",
'parse_mode'=>'html',
]);
}
if($text == "Ислом шариати молни муҳофаза қилиш мақсадида алдамчиликни, савдода ёлғонни ишлатишни ҳаром қилди"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/489",
'parse_mode'=>'html',
]);
}
if($text == "Ислом шариати молни муҳофаза қилиш мақсадида қиморни ҳаром қилди"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/490",
'parse_mode'=>'html',
]);
}
if($text == "Ислом шариати молни муҳофаза қилиш мақсадида нархни сунъий равишда кўтаришни ҳаром қилди"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/491",
'parse_mode'=>'html',
]);
}
if($text == "Ислом шариати молни муҳофаза қилиш мақсадида ғасбни ҳаром қилди"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/492",
'parse_mode'=>'html',
]);
}
if($text == "Ислом шариати молни муҳофаза қилиш мақсадида ғарарни ҳаром қилди"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/493",
'parse_mode'=>'html',
]);
}
if($text == "Ислом шариати молни муҳофаза қилиш мақсадида пора олишни ва беришни ҳаром қилди"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/494",
'parse_mode'=>'html',
]);
}
if($text == "Ислом шариати молни муҳофаза қилиш мақсадида исрофни ҳаром қилди"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/495",
'parse_mode'=>'html',
]);
}
if($text == "Ислом шариати молни муҳофаза қилиш мақсадида молиявий муомалаларни ёзиб боришни жорий қилди"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/496",
'parse_mode'=>'html',
]);
}
if($text == "Ислом шариати молни муҳофаза қилиш мақсадида ҳалол касбга амр қилди ва ҳаромдан мол топишни ман қилди"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/497",
'parse_mode'=>'html',
]);
}
if($text == "Манфаатлар"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/499",
'parse_mode'=>'html',
]);
}
if($text == "Манфаатлар Биринчи қисм"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/500",
'parse_mode'=>'html',
]);
}
if($text == "Манфаатлар Иккинчи қисм"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/501",
'parse_mode'=>'html',
]);
}
if($text == "Манфаатлар 3- қисм Таҳсиниёт"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/502",
'parse_mode'=>'html',
]);
}
if($text == "Масолиҳул  мурсала"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/504",
'parse_mode'=>'html',
]);
}
if($text == "Шаръий амалларнинг турлари Фарз"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/505",
'parse_mode'=>'html',
]);
}
if($text == "Шаръий амалларнинг турлари Вожиб"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/506",
'parse_mode'=>'html',
]);
}
if($text == "Шаръий амалларнинг турлари Суннат"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/507",
'parse_mode'=>'html',
]);
}
if($text == "Шаръий амалларнинг турлари Ҳаром"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/508",
'parse_mode'=>'html',
]);
}
if($text == "Шаръий амалларнинг турлари Макруҳи таҳримий"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/509",
'parse_mode'=>'html',
]);
}
if($text == "Шаръий амалларнинг турлари Макруҳи танзиҳий"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/510",
'parse_mode'=>'html',
]);
}
if($text == "Шаръий амалларнинг турлари Мубоҳ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/511",
'parse_mode'=>'html',
]);
}
if($text == "Шаръий амаллар баёни"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/512",
'parse_mode'=>'html',
]);
}
if($text == "Поклик китоби"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/513",
'parse_mode'=>'html',
]);
}
if($text == "Таҳорат"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/514",
'parse_mode'=>'html',
]);
}
if($text == "Ғусл"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/515",
'parse_mode'=>'html',
]);
}
if($text == "Сувларнинг ҳукми"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/516",
'parse_mode'=>'html',
]);
}
if($text == "Таяммумнинг ҳукми"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/517",
'parse_mode'=>'html',
]);
}
if($text == "Узрлилар"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/518",
'parse_mode'=>'html',
]);
}
if($text == "Нажаслар боби"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/519",
'parse_mode'=>'html',
]);
}
if($text == "Истинжо ва хало одоблари"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/520",
'parse_mode'=>'html',
]);
}
if($text == "Намоз китоби"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/521",
'parse_mode'=>'html',
]);
}
if($text == "Намознинг сифати"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/522",
'parse_mode'=>'html',
]);
}
if($text == "Намознинг ҳикмати"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/523",
'parse_mode'=>'html',
]);
}
if($text == "Намознинг вақтлари"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/524",
'parse_mode'=>'html',
]);
}
if($text == "Намознинг шартлари. Аврат, қибла ва ният"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/525",
'parse_mode'=>'html',
]);
}
if($text == "Жамоат ва имомат. Сутра, витр, нафл ва таровеҳ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/526",
'parse_mode'=>'html',
]);
}
if($text == "Кусуф ва хусуф. Истисқо. Қазо намозлариi"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/527",
'parse_mode'=>'html',
]);
}
if($text == "Саждаи саҳв ва тиловат саждаси"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/528",
'parse_mode'=>'html',
]);
}
if($text == "Беморнинг намози. Мусофирнинг намози. Жума намози"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/529",
'parse_mode'=>'html',
]);
}
if($text == "Икки ийд намози. Жанозалар боби. Хавф намози"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/530",
'parse_mode'=>'html',
]);
}
if($text == "Закот китоби"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/531",
'parse_mode'=>'html',
]);
}
if($text == "Рўза китобии"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/532",
'parse_mode'=>'html',
]);
}
if($text == "Ҳаж китобии"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/533",
'parse_mode'=>'html',
]);
}
if($text == "Никоҳ китоби"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/534",
'parse_mode'=>'html',
]);
}
if($text == "Талоқ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/535",
'parse_mode'=>'html',
]);
}
if($text == "Молиявий муомалалар"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/536",
'parse_mode'=>'html',
]);
}
if($text == "Савдо китоби"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/537",
'parse_mode'=>'html',
]);
}
if($text == "Турли масалалар"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/538",
'parse_mode'=>'html',
]);
}
if($text == "Бахтли ҳаёт ахлоқи"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/539",
'parse_mode'=>'html',
]);
}
if($text == "Руҳий тарбия китоби"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/540",
'parse_mode'=>'html',
]);
}
if($text == "Рўзa"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/541",
'parse_mode'=>'html',
]);
}
if($text == "Ҳaж"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/542",
'parse_mode'=>'html',
]);
}
if($text == "Қуръони Карим тиловати"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/543",
'parse_mode'=>'html',
]);
}
if($text == "Зикр"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/544",
'parse_mode'=>'html',
]);
}
if($text == "Руҳий тарбиянинг иккинчи қисми"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/545",
'parse_mode'=>'html',
]);
}
if($text == "Ҳавф ва Ражо"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/546",
'parse_mode'=>'html',
]);
}
if($text == "Тақво ва вараъ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/547",
'parse_mode'=>'html',
]);
}
if($text == "Руҳий тарбиянинг учинчи кисми"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/548",
'parse_mode'=>'html',
]);
}
if($text == "Тазктятун нафснинг самаралари"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/549",
'parse_mode'=>'html',
]);
}
if($text == "Саодатли ҳаёт соҳибининг кун тартиби"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/550",
'parse_mode'=>'html',
]);
}
if($text == "Таҳоратга доир"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/551",
'parse_mode'=>'html',
]);
}
if($text == "Турли одамлар билан муомала одоби"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/552",
'parse_mode'=>'html',
]);
}
if($text == "🎧Ҳаж китоби"){
    bot('sendmessage',[
    'chat_id'=>$cid,
    'text'=>"<b> Assalomu Aleykum </b> <i>bo'limga xush kelibsiz Marhamat O'zingizga kerakli Qismni tanlang</i>",
    'parse_mode'=>"html",
    'reply_markup'=>$Haj,
]);
}
if($text == "Ҳаж китоби"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/306",
'parse_mode'=>'html',
]);
}
if($text == "Тарихи"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/307",
'parse_mode'=>'html',
]);
}
if($text == "Умумий қоидалар, хажнинг таърифи"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/308",
'parse_mode'=>'html',
]);
}
if($text == "Ҳажга тайёргарлик"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/309",
'parse_mode'=>'html',
]);
}
if($text == "Ҳажнинг турлари"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/310",
'parse_mode'=>'html',
]);
}
if($text == "Ҳаж аҳкомлари"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/311",
'parse_mode'=>'html',
]);
}
if($text == "Арафотда туриш"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/312",
'parse_mode'=>'html',
]);
}
if($text == "Тавофи ифоза"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/313",
'parse_mode'=>'html',
]);
}
if($text == "Ҳажнинг вожиблари"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/314",
'parse_mode'=>'html',
]);
}
if($text == "Ҳажнинг суннатлари"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/315",
'parse_mode'=>'html',
]);
}
if($text == "Ҳаж сафари олдидан қилинадиган ишлар"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/316",
'parse_mode'=>'html',
]);
}
if($text == "Амаллар баёни - Эҳром"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/317",
'parse_mode'=>'html',
]);
}
if($text == "Ҳарами Шарифга кириш"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/318",
'parse_mode'=>'html',
]);
}
if($text == "Тавоф"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/319",
'parse_mode'=>'html',
]);
}
if($text == "Минода"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/320",
'parse_mode'=>'html',
]);
}
if($text == "Арофатда"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/321",
'parse_mode'=>'html',
]);
}
if($text == "Муздалифада"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/322",
'parse_mode'=>'html',
]);
}
if($text == "Тош отиш"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/323",
'parse_mode'=>'html',
]);
}
if($text == "Тавофи ифоза"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/324",
'parse_mode'=>'html',
]);
}
if($text == "Ҳайитнинг иккинчи куни"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/325",
'parse_mode'=>'html',
]);
}
if($text == "Тавофи видо"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/326",
'parse_mode'=>'html',
]);
}
if($text == "Қўшимча изоҳ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/327",
'parse_mode'=>'html',
]);
}
if($text == "Аёл кишининг хажи"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/328",
'parse_mode'=>'html',
]);
}
if($text == "Таматту ҳаж"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/329",
'parse_mode'=>'html',
]);
}
if($text == "Қирон ҳажи"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/330",
'parse_mode'=>'html',
]);
}
if($text == "Умра"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/331",
'parse_mode'=>'html',
]);
}
if($text == "Ҳаж ва Умрани бузадиган нарсалар"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/332",
'parse_mode'=>'html',
]);
}
if($text == "Бадал ҳаж"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/333",
'parse_mode'=>'html',
]);
}
if($text == "Жиноятлар"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/334",
'parse_mode'=>'html',
]);
}
if($text == "Мадинаи Мунаввара зиёрати"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/335",
'parse_mode'=>'html',
]);
}
if($text == "Сўнг сўз"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/336",
'parse_mode'=>'html',
]);
}
if($text == "🎧Сунний ақийдалар"){
    bot('sendmessage',[
    'chat_id'=>$cid,
    'text'=>"<b> 🎧Сунний ақийдалар </b> <i>bo'limga xush kelibsiz Marhamat O'zingizga kerakli Audio Darsni tanlang</i>",
    'parse_mode'=>"html",
    'reply_markup'=>$sunniy,
]);
}
if($text == "Сунний_ақийдалар 1. Муқаддима"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/554",
'parse_mode'=>'html',
]);
}
if($text == "Ақийда нима?"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/555",
'parse_mode'=>'html',
]);
}
if($text == "Ақоид илмининг таърифи"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/556",
'parse_mode'=>'html',
]);
}
if($text == "Ақоид илмининг мақсади"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/557",
'parse_mode'=>'html',
]);
}
if($text == "Ақоид илмининг мавзуси"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/558",
'parse_mode'=>'html',
]);
}
if($text == "Aқоид илмининг номлари"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/559",
'parse_mode'=>'html',
]);
}
if($text == "Aқоид илмининг тарихи"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/560",
'parse_mode'=>'html',
]);
}
if($text == "Имом Абулҳасан ал-Ашъарий"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/561",
'parse_mode'=>'html',
]);
}
if($text == "Имом Абу Мансур ал-Мотуридий"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/562",
'parse_mode'=>'html',
]);
}
if($text == "Илм нима?"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/563",
'parse_mode'=>'html',
]);
}
if($text == "Ҳис қилиш доираларидан ташқари илм"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/564",
'parse_mode'=>'html',
]);
}
if($text == "Хабарлар ва нақлларни текшириш"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/565",
'parse_mode'=>'html',
]);
}
if($text == "Оғзаки маълумотни текшириш"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/566",
'parse_mode'=>'html',
]);
}

if($text == "Ёзма маълумотни текшириш"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/567",
'parse_mode'=>'html',
]);
}
if($text == "Даъво ёки фаразни аниқлаш"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/568",
'parse_mode'=>'html',
]);
}
if($text == "Мусулмонлардан бошқаларда"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/569",
'parse_mode'=>'html',
]);
}
if($text == "Мусулмонларда"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/570",
'parse_mode'=>'html',
]);
}
if($text == "Ислом илм дини"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/571",
'parse_mode'=>'html',
]);
}
if($text == "Бошқаларда дин ва илм"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/572",
'parse_mode'=>'html',
]);
}
if($text == "Илм ислом тарафидаа"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/573",
'parse_mode'=>'html',
]);
}
if($text == "Ақийда далиллари"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/574",
'parse_mode'=>'html',
]);
}
if($text == "Қатъий ва қатъий эмас хабарлар"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/575",
'parse_mode'=>'html',
]);
}
if($text == "Ақийда ҳужжатлари бўйича хулосалар"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/576",
'parse_mode'=>'html',
]);
}
if($text == "Ақоиднинг бош мавзулари"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/577",
'parse_mode'=>'html',
]);
}
if($text == "Илоҳият Аллоҳнинг борлиги"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/578",
'parse_mode'=>'html',
]);
}
if($text == "Аллоҳнинг исмлари ва сифатлари"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/579",
'parse_mode'=>'html',
]);
}
if($text == "Аллоҳнинг сифатлари ва салафлар"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/580",
'parse_mode'=>'html',
]);
}
if($text == "Аллоҳнинг сифатлари ва халафлар"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/581",
'parse_mode'=>'html',
]);
}
if($text == "Сифатларнинг тақсими"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/582",
'parse_mode'=>'html',
]);
}
if($text == "Сифатларнинг шарҳи"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/583",
'parse_mode'=>'html',
]);
}
if($text == "Аллоҳнинг каломи масаласи ҳадис ва суннат имомлари наздида"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/584",
'parse_mode'=>'html',
]);
}
if($text == "Маънавий сифатлар"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/585",
'parse_mode'=>'html',
]);
}
if($text == "Аллоҳнинг исм ва сифатларига боғлиқ масалалар"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/586",
'parse_mode'=>'html',
]);
}
if($text == "Аллоҳ таолони нуқсонлардан поклаш"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/587",
'parse_mode'=>'html',
]);
}
if($text == "Қазо ва қадар"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/588",
'parse_mode'=>'html',
]);
}
if($text == "Сунний_ақийдаларXотима"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/589",
'parse_mode'=>'html',
]);
}
if($text == "Инсон амали масаласи"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/590",
'parse_mode'=>'html',
]);
}
if($text == "Иститоат ва унинг турлари"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/591",
'parse_mode'=>'html',
]);
}
if($text == "Савоб ва иқоб"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/592",
'parse_mode'=>'html',
]);
}
if($text == "Жаннатга кирмай қолиш амал туфайлидир"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/593",
'parse_mode'=>'html',
]);
}
if($text == "Дўзахга кирмай қолиш амал туфайли"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/594",
'parse_mode'=>'html',
]);
}
if($text == "Ибодат ва дуо"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/595",
'parse_mode'=>'html',
]);
}
if($text == "Дуо ҳақида"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/596",
'parse_mode'=>'html',
]);
}
if($text == "Дуонинг ижобат бўлиши ва ҳожатнинг раво бўлиши"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/597",
'parse_mode'=>'html',
]);
}
if($text == "Бошқаларга дуо ва савобни бағишлаш"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/598",
'parse_mode'=>'html',
]);
}
if($text == "Ўлганларга дуо қилиш ва уларга савоб аташ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/599",
'parse_mode'=>'html',
]);
}
if($text == "Садақанинг савоби етишига далил"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/600",
'parse_mode'=>'html',
]);
}
if($text == "Савобни бағишлаш ҳақида аҳли бидъатнинг мазҳаби"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/601",
'parse_mode'=>'html',
]);
}
if($text == "Эслатма"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/602",
'parse_mode'=>'html',
]);
}
if($text == "Касб ва таваккул"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/603",
'parse_mode'=>'html',
]);
}
if($text == "Ризқ масаласи"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/604",
'parse_mode'=>'html',
]);
}
if($text == "Аллоҳни кўриш масаласи"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/605",
'parse_mode'=>'html',
]);
}
if($text == "Нубувват"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/606",
'parse_mode'=>'html',
]);
}
if($text == "Ваҳий нима"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/607",
'parse_mode'=>'html',
]);
}
if($text == "Нубувват ва рисолатнинг маъноси"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/608",
'parse_mode'=>'html',
]);
}
if($text == "Набий ва Расул орасидаги фарқ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/610",
'parse_mode'=>'html',
]);
}
if($text == "Пайғамбарликни Аллоҳ беради"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/611",
'parse_mode'=>'html',
]);
}
if($text == "Анбиёлар ва Расулларга иймон"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/612",
'parse_mode'=>'html',
]);
}
if($text == "Улул азм пайғамбарлар"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/613",
'parse_mode'=>'html',
]);
}
if($text == "Пайғамбар башардир"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/614",
'parse_mode'=>'html',
]);
}
if($text == "Пайғамбарлар маъсумдирлар"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/616",
'parse_mode'=>'html',
]);
}
if($text == "Пайғамбар омонатли бўлади"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/617",
'parse_mode'=>'html',
]);
}
if($text == "Пайғамбар эр кишидан бўлади"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/618",
'parse_mode'=>'html',
]);
}
if($text == "Пайғамбарлар ўз қавми тилида юборилади"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/619",
'parse_mode'=>'html',
]);
}
if($text == "Пайғамбарларнинг бир-бирларидан фазли ҳақида"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/620",
'parse_mode'=>'html',
]);
}
if($text == "Пайғамбарларнинг вазифалари"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/621",
'parse_mode'=>'html',
]);
}
if($text == "Пайғамбарларнинг мўъжизалари"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/622",
'parse_mode'=>'html',
]);
}
if($text == "Пайғамбар алайҳиссаломнинг мўъжизалари"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/623",
'parse_mode'=>'html',
]);
}
if($text == "У зотнинг панжалари орасидан сув чиқиши"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/624",
'parse_mode'=>'html',
]);
}
if($text == "У зотнинг баракалари ила оз сувнинг кўпайиши"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/625",
'parse_mode'=>'html',
]);
}
if($text == "Таомнинг қавмга етиб ортиб қолгунча кўпайтирилиши"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/626",
'parse_mode'=>'html',
]);
}
if($text == "У зотнинг ҳузурларида таомнинг тасбеҳ айтиши"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/627",
'parse_mode'=>'html',
]);
}
if($text == "Оз хурмони кўпайтириб ҳақдорларга етказиш"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/628",
'parse_mode'=>'html',
]);
}
if($text == "Хурмо шохининг у зотга зорланиши"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/629",
'parse_mode'=>'html',
]);
}
if($text == "Дарахтнинг у зотга бўйсуниши"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/630",
'parse_mode'=>'html',
]);
}
if($text == "Муҳаммад алайҳиссалом хотамул анбиёдирлар"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/631",
'parse_mode'=>'html',
]);
}
if($text == "Муҳаммад алайҳиссаломнинг бошқа набийлардан фарқлари"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/632",
'parse_mode'=>'html',
]);
}
if($text == "Илоҳий китобларга иймон"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/633",
'parse_mode'=>'html',
]);
}
if($text == "Кавниёт"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/634",
'parse_mode'=>'html',
]);
}
if($text == "Инсон"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/635",
'parse_mode'=>'html',
]);
}
if($text == "Фаришталар"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/636",
'parse_mode'=>'html',
]);
}
if($text == "Фаришталарнинг сифатлари"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/637",
'parse_mode'=>'html',
]);
}
if($text == "Фаришталарнинг вазифалари"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/638",
'parse_mode'=>'html',
]);
}
if($text == "Жиинлар"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/639",
'parse_mode'=>'html',
]);
}
if($text == "Борлиқдаги сабабият қонуни"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/640",
'parse_mode'=>'html',
]);
}
if($text == "Ғаийбиёт"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/641",
'parse_mode'=>'html',
]);
}
if($text == "Ўлим ва унга боғлиқ нарсалар"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/642",
'parse_mode'=>'html',
]);
}
if($text == "Қабр саволи"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/643",
'parse_mode'=>'html',
]);
}
if($text == "Қиёмат аломатлари"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/644",
'parse_mode'=>'html',
]);
}
if($text == "ДОББАТУЛ АРЗ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/645",
'parse_mode'=>'html',
]);
}
if($text == "ЯЪЖУЖ ВА МАЪЖУЖ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/646",
'parse_mode'=>'html',
]);
}
if($text == "ҚУЁШНИНГ МАҒРИБДАН ЧИҚИШИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/647",
'parse_mode'=>'html',
]);
}
if($text == "ДАЖЖОЛНИНГ ЧИҚИШИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/648",
'parse_mode'=>'html',
]);
}
if($text == "ИЙСО АЛАЙҲИССАЛОМНИНГ ТУШИШЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/649",
'parse_mode'=>'html',
]);
}
if($text == "ИМОМ МАҲДИЙ РОЗИЯЛЛОҲУ АНҲУ ҲАҚЛАРИДА"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/650",
'parse_mode'=>'html',
]);
}
if($text == "Қиёматнинг кичик аломатлари"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/651",
'parse_mode'=>'html',
]);
}
if($text == "Қииёмат"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/652",
'parse_mode'=>'html',
]);
}
if($text == "Қиёмат қойим бўлишига далиллар"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/653",
'parse_mode'=>'html',
]);
}
if($text == "Қиёмат қандай қоим бўлади?"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/654",
'parse_mode'=>'html',
]);
}
if($text == "Қайта тирилиш ва ҳашр"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/655",
'parse_mode'=>'html',
]);
}
if($text == "Ҳолатнинг оғирлиги"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/656",
'parse_mode'=>'html',
]);
}
if($text == "Ҳисоб"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/657",
'parse_mode'=>'html',
]);
}
if($text == "Тарозу ва амалларни тортиш"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/658",
'parse_mode'=>'html',
]);
}
if($text == "Сирот ва ундан ўтиш"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/659",
'parse_mode'=>'html',
]);
}
if($text == "Шафоат"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/660",
'parse_mode'=>'html',
]);
}
if($text == "ҲАВЗ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/662",
'parse_mode'=>'html',
]);
}
if($text == "Жаннат ва дўзаҳ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/663",
'parse_mode'=>'html',
]);
}
if($text == "Жаннат"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/664",
'parse_mode'=>'html',
]);
}
if($text == "Дўзах"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/665",
'parse_mode'=>'html',
]);
}
if($text == "АРШ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/666",
'parse_mode'=>'html',
]);
}
if($text == "АРШ ВА КУРСИ ҲАҚИДА"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/667",
'parse_mode'=>'html',
]);
}

if($text == "КУРСИ ҲАҚДИР"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/668",
'parse_mode'=>'html',
]);
}
if($text == "ЛАВҲУЛ - МАҲФУЗ ВА ҚАЛАМ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/669",
'parse_mode'=>'html',
]);
}
if($text == "ИЙМОННИНГ ТАЪРИФИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/670",
'parse_mode'=>'html',
]);
}
if($text == "ИЙМОН БИЛАН ИСЛОМ ОРАСИДАГИ ФАРҚ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/671",
'parse_mode'=>'html',
]);
}
if($text == "ИЙМОННИНГ ЗИЁДА ВА НОҚИС БЎЛИШИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/672",
'parse_mode'=>'html',
]);
}
if($text == "ДУНЁВИЙ ИШЛАРДА ЗОҲИРИГА ҚАРАБ ҲУКМ ЧИҚАРИЛАДИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/673",
'parse_mode'=>'html',
]);
}
if($text == "МУСУЛМОННИНГ КОФИР ДЕЙИШ ҲУКМИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/674",
'parse_mode'=>'html',
]);
}
if($text == "🎧Ижтимоий одоблар"){
    bot('sendmessage',[
    'chat_id'=>$cid,
    'text'=>"<b> https://telegra.ph/Izhtimoij-odoblar-11-26 </b> <i> Marhamat O'zingizga kerakli audio darslarni tanlang</i>",
    'parse_mode'=>"html",
    'reply_markup'=>$ODob,
]);
}
if($text == "СЎЗ БОШИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/676",
'parse_mode'=>'html',
]);
}
if($text == "ОДОБНИНГ ТАЪРИФИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/677",
'parse_mode'=>'html',
]);
}
if($text == "ОДОБНИНГ АҲАМИЯТИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/678",
'parse_mode'=>'html',
]);
}
if($text == "ОДОБНИНГ МАНБАИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/679",
'parse_mode'=>'html',
]);
}
if($text == "ОДОБНИНГ ҒОЯСИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/680",
'parse_mode'=>'html',
]);
}
if($text == "ИСЛОМИЙ ОДОБЛАРНИНГ ХУСУСИЯТЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/681",
'parse_mode'=>'html',
]);
}
if($text == "ОДОБНИНГ ВАТАНИМИЗДАГИ ҲОЛАТИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/682",
'parse_mode'=>'html',
]);
}
if($text == "ИЖТИМОИЙ ОДОБЛАР ШИОРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/683",
'parse_mode'=>'html',
]);
}
if($text == "КАЛОМ ОДОБИi"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/684",
'parse_mode'=>'html',
]);
}
if($text == "ЁЛҒОН"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/685",
'parse_mode'=>'html',
]);
}
if($text == "ҒИЙБАТ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/686",
'parse_mode'=>'html',
]);
}
if($text == "ЧАҚИМЧИЛИК"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/687",
'parse_mode'=>'html',
]);
}
if($text == "БОТИЛ СЎЗГА КИРИШИШ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/688",
'parse_mode'=>'html',
]);
}
if($text == "УЯТСИЗ СЎЗЛАРНИ СЎЗЛАШ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/689",
'parse_mode'=>'html',
]);
}
if($text == "СЎКИШ ВА АЧЧИҚ-ТИЗИҚ ГАПИРИШ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/690",
'parse_mode'=>'html',
]);
}
if($text == "МАСХАРА ВА ИСТЕҲЗО"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/691",
'parse_mode'=>'html',
]);
}
if($text == "МАДДОҲЛИК"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/692",
'parse_mode'=>'html',
]);
}
if($text == "СЎЗГА ЭЪТИБОРСИЗЛИК"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/693",
'parse_mode'=>'html',
]);
}
if($text == "ИЛМСИЗ КИШИЛАРНИНГ ИЛМИЙ СУҲБАТГА АРАЛАШИШИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/694",
'parse_mode'=>'html',
]);
}
if($text == "БЕҲУДА СЎЗ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/695",
'parse_mode'=>'html',
]);
}
if($text == "КАЛОМГА ОИД ОДОБЛАР"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/696",
'parse_mode'=>'html',
]);
}
if($text == "САЛОМЛАШИШ ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/697",
'parse_mode'=>'html',
]);
}
if($text == "МАСКАН ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/698",
'parse_mode'=>'html',
]);
}
if($text == "МАСКАНДА МЎЪТАДИЛ БЎЛИШ ВА ШАРОИТНИ ЯХШИЛАШ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/699",
'parse_mode'=>'html',
]);
}
if($text == "МАСКАНДАГИ МОДДИЙ ОДОБЛАР"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/700",
'parse_mode'=>'html',
]);
}
if($text == "МАСКАНДАГИ МАЪНАВИЙ ОДОБЛАР"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/701",
'parse_mode'=>'html',
]);
}
if($text == "МАСКАН ЭГАЛАРИНИНГ ЎЗАРО ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/702",
'parse_mode'=>'html',
]);
}
if($text == "ЭР-ХОТИН ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/703",
'parse_mode'=>'html',
]);
}
if($text == "ЭРНИНГ БУРЧЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/704",
'parse_mode'=>'html',
]);
}
if($text == "ХОТИННИНГ БУРЧЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/705",
'parse_mode'=>'html',
]);
}
if($text == "ОВҚАТЛАНИШ ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/706",
'parse_mode'=>'html',
]);
}
if($text == "ТАОМЛАНИШ ҲАҚИДА ҲУКМЛАР"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/707",
'parse_mode'=>'html',
]);
}
if($text == "ТАОМ ЕЙИШ ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/708",
'parse_mode'=>'html',
]);
}
if($text == "ИЧИМЛИК ИЧИШ ҲУКМЛАРИ ВА ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/709",
'parse_mode'=>'html',
]);
}
if($text == "МЕҲМОНДОРЧИЛИК ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/710",
'parse_mode'=>'html',
]);
}
if($text == "ТЎЙ ВА МАРОСИМ ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/711",
'parse_mode'=>'html',
]);
}
if($text == "ЙИҒИН ВА МАЖЛИСЛАР ОДОБИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/712",
'parse_mode'=>'html',
]);
}
if($text == " БАЙРАМЛАР ВА ТУРЛИ ТАНТАНАЛАР ОДОБИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/713",
'parse_mode'=>'html',
]);
}
if($text == "ДИНИЙ БАЙРАМЛАРНИ НИШОНЛАШ СУННАТЛАРИ ВА РЎЗА БАЙРАМИГА ХОС ИШЛАР"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/714",
'parse_mode'=>'html',
]);
}
if($text == "ҚУРБОН БАЙРАМИГА ХОС ИШЛАР"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/715",
'parse_mode'=>'html',
]);
}
if($text == "ИККАЛА БАЙРАМДА ҲАМ БАРАВАР ҚИЛИНАДИГАН ИШЛАР"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/716",
'parse_mode'=>'html',
]);
}
if($text == "ЖУМАНИ ҲАФТА БАЙРАМИ СИФАТИДА НИШОНЛАШ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/717",
'parse_mode'=>'html',
]);
}
if($text == "МАЖОЗИЙ БАЙРАМЛАРНИ НИШОНЛАШ ҲАҚИДА"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/718",
'parse_mode'=>'html',
]);
}
if($text == "ИСРО ВА МЕЪРОЖ КЕЧАСИ ҲАҚИДА"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/719",
'parse_mode'=>'html',
]);
}
if($text == "МАВЛИД БАЙРАМИ ҲАҚИДА"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/720",
'parse_mode'=>'html',
]);
}
if($text == "ДАМ ОЛИШ ЖОЙЛАРИ ВА САЙРГОҲЛАР ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/721",
'parse_mode'=>'html',
]);
}
if($text == "ЁШЛАР ОДОБИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/722",
'parse_mode'=>'html',
]);
}
if($text == "ТУРЛИ КИШИЛАР БИЛАН МУОМАЛА ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/723",
'parse_mode'=>'html',
]);
}
if($text == "БОШҚА ДИНДАГИЛАР БИЛАН МУОМАЛА ОДОБИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/724",
'parse_mode'=>'html',
]);
}
if($text == "КИЙИНИШ ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/725",
'parse_mode'=>'html',
]);
}
if($text == "КИЙИМ ҲАҚИДА ШАРЪИЙ ҲУКМЛАР"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/726",
'parse_mode'=>'html',
]);
}
if($text == "ЛИБОСГА ОИД УМУМИЙ ҲУКМЛАР"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/727",
'parse_mode'=>'html',
]);
}
if($text == "КИЙИНИШНИНГ УМУМИЙ ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/728",
'parse_mode'=>'html',
]);
}
if($text == "ЭРКАКЛАРГА ХОС КИЙИНИШ ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/729",
'parse_mode'=>'html',
]);
}
if($text == "АЁЛЛАРНИНГ КИЙИНИШ ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/730",
'parse_mode'=>'html',
]);
}
if($text == "ШАХСИЙ ОЗОДАЛИК ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/731",
'parse_mode'=>'html',
]);
}
if($text == "БАДАН ПОКЛИГИ ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/732",
'parse_mode'=>'html',
]);
}
if($text == "ХАЛО ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/733",
'parse_mode'=>'html',
]);
}
if($text == "ФИТРАТ (СОФ ТАБИАТ) СУННАТЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/734",
'parse_mode'=>'html',
]);
}
if($text == "АТРОФ МУҲИТ ПОКЛИГИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/735",
'parse_mode'=>'html',
]);
}
if($text == "ЙЎЛ ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/736",
'parse_mode'=>'html',
]);
}
if($text == "НАҚЛИЁТ ВОСИТАЛАРИ ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/737",
'parse_mode'=>'html',
]);
}
if($text == "ЙЎЛОВЧИ ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/738",
'parse_mode'=>'html',
]);
}
if($text == "УЯЛИ ТЕЛЕФОН ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/739",
'parse_mode'=>'html',
]);
}
if($text == "УЯЛИ АЛОҚА ВОСИТАСИГА ОИД ОДОБЛАР"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/740",
'parse_mode'=>'html',
]);
}
if($text == "ЖАМОАТЧИЛИККА НИСБАТАН ОДОБЛАР"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/741",
'parse_mode'=>'html',
]);
}
if($text == "СУҲБАТДОШГА НИСБАТАН ОДОБЛАР"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/742",
'parse_mode'=>'html',
]);
}
if($text == "ИНТЕРНЕТ ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/743",
'parse_mode'=>'html',
]);
}
if($text == "ИНТЕРНЕТДАН ФОЙДАЛАНИШ ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/744",
'parse_mode'=>'html',
]);
}
if($text == "ИЖТИМОИЙ ТАРМОҚЛАРДАГИ АЛОҚА ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/745",
'parse_mode'=>'html',
]);
}
if($text == "ЭЛЕКТРОН ПОЧТА ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/746",
'parse_mode'=>'html',
]);
}
if($text == "САФАР ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/747",
'parse_mode'=>'html',
]);
}
if($text == "САФАР ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/748",
'parse_mode'=>'html',
]);
}
if($text == "МОЛ-ДУНЁ ВА БОЙЛИК ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/749",
'parse_mode'=>'html',
]);
}
if($text == "ТИЖОРАТ ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/750",
'parse_mode'=>'html',
]);
}
if($text == "МАСЖИД ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/751",
'parse_mode'=>'html',
]);
}
if($text == "МАСЖИД ҚУРИШ ВА УНИ ОБОД ҚИЛИШ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/752",
'parse_mode'=>'html',
]);
}
if($text == "МАСЖИДДАГИ ОДОБЛАР"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/753",
'parse_mode'=>'html',
]);
}
if($text == "МАСЖИДДА ЖАМОАТ НАМОЗИ ЎҚИШНИНГ АҲАМИЯТИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/754",
'parse_mode'=>'html',
]);
}
if($text == "ЖАМОАТ НАМОЗИ ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/755",
'parse_mode'=>'html',
]);
}
if($text == "ЖУМА ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/756",
'parse_mode'=>'html',
]);
}
if($text == "ҚЎШНИЧИЛИК ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/757",
'parse_mode'=>'html',
]);
}
if($text == "ҚЎШНИНИHГ ҲАҚЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/758",
'parse_mode'=>'html',
]);
}
if($text == "ҚЎШНИЛАРНИНГ МУОМАЛА ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/759",
'parse_mode'=>'html',
]);
}
if($text == "ИЛМ ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/760",
'parse_mode'=>'html',
]);
}
if($text == "ИЛМ ТАЛАБ ҚИЛИШ ФАРЗДИР"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/761",
'parse_mode'=>'html',
]);
}
if($text == "ИЛМ ТАЛАБ ҚИЛИШ ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/762",
'parse_mode'=>'html',
]);
}
if($text == "ТАЪЛИМ БЕРИШ ВА МУАЛЛИМ ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/763",
'parse_mode'=>'html',
]);
}
if($text == "СУҲБАТ ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/764",
'parse_mode'=>'html',
]);
}
if($text == "КАСБ ВА ИШ БАЖАРУВЧИ ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/765",
'parse_mode'=>'html',
]);
}
if($text == "КАСБ ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/766",
'parse_mode'=>'html',
]);
}
if($text == "БЕМОРЛИК ВА БЕМОРНИ ЗИЁРАТ ҚИЛИШ ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/767",
'parse_mode'=>'html',
]);
}
if($text == "БЕМОРНИНГ ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/768",
'parse_mode'=>'html',
]);
}
if($text == "ТАБИБНИНГ ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/769",
'parse_mode'=>'html',
]);
}
if($text == "БЕМОРНИ ЗИЁРАТ ҚИЛИШ ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/770",
'parse_mode'=>'html',
]);
}
if($text == "ЎЛИМ, ЖАНОЗА, ТАЪЗИЯ ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/771",
'parse_mode'=>'html',
]);
}
if($text == "МУҲТАЗАРГА НИСБАТАН ҚИЛИНАДИГАН ИШЛАP"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/772",
'parse_mode'=>'html',
]);
}
if($text == "ЖОН УЗИЛГАНИДАН КЕЙИН ҚИЛИНАДИГАН ИШЛАP"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/773",
'parse_mode'=>'html',
]);
}
if($text == "ЖАНОЗА ОДОБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/774",
'parse_mode'=>'html',
]);
}
if($text == "🎧Ҳадис ва Ҳаёт 35-жуз. Зикр, дуолар, истиғфор ва тавба китоби"){
    bot('sendmessage',[
    'chat_id'=>$cid,
    'text'=>"<b> https://telegra.ph/Ҳadis-va-Ҳayot-35-zhuz-Zikr-duolar-istiғfor-va-tavba-kitobi-12-09 </b> <i> Marhamat O'zingizga kerakli audio darslarni tanlang</i>",
    'parse_mode'=>"html",
    'reply_markup'=>$Zikrduo,
]);
}
if($text == "Зикр, истиғфор, тавба ва дуолар китоби"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/385",
'parse_mode'=>'html',
]);
}
if($text == "Зикр ва зокирларнинг фазли ҳақида"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/386",
'parse_mode'=>'html',
]);
}
if($text == "Аллоҳнинг гўзал исмлари"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/387",
'parse_mode'=>'html',
]);
}
if($text == "Исмул Аъзам"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/388",
'parse_mode'=>'html',
]);
}
if($text == "Тасбеҳ, ҳамд, такбир ва таҳлилнинг фазли"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/389",
'parse_mode'=>'html',
]);
}
if($text == "Тасбеҳни санаш ва тасбеҳнинг асли"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/390",
'parse_mode'=>'html',
]);
}
if($text == "Ла ҳавла вала қуввата илла биллаҳ -Жаннат калитларидан биридир"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/391",
'parse_mode'=>'html'
]);
}
if($text == "Намоздан кейинги зикрлар"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/392",
'parse_mode'=>'html',
]);
}
if($text == "Намоздан кейинги жамоий дуо"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/393",
'parse_mode'=>'html',
]);
}
if($text == "Жамоат ила дуо қилиш"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/394",
'parse_mode'=>'html',
]);
}
if($text == "Эрталаб ва кечки тасбеҳ ва зикрлар"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/395",
'parse_mode'=>'html',
]);
}
if($text == "Зикрнинг фойда ва самаралари"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/396",
'parse_mode'=>'html',
]);
}
if($text == "Зикрнинг сийғалари"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/397",
'parse_mode'=>'html',
]);
}
if($text == "Зокирнинг одоблари"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/398",
'parse_mode'=>'html',
]);
}
if($text == "Дуонинг фазли"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/399",
'parse_mode'=>'html',
]);
}
if($text == "Дуонинг одоблари"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/400",
'parse_mode'=>'html',
]);
}
if($text == "Мақбул дуо"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/401",
'parse_mode'=>'html',
]);
}
if($text == "Набий алайҳиссаломнинг умматларига қилган дуолари"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/402",
'parse_mode'=>'html',
]);
}
if($text == "Жамловчи дуолар"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/403",
'parse_mode'=>'html',
]);
}
if($text == "Паноҳ сўраш калималари"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/404",
'parse_mode'=>'html',
]);
}
if($text == "Мушкули борнинг дуоси"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/405",
'parse_mode'=>'html',
]);
}
if($text == "Сафар ва ундан қайтгандаги дуо"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/406",
'parse_mode'=>'html',
]);
}
if($text == "Видолашув дуоси"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/407",
'parse_mode'=>'html',
]);
}
if($text == "Мажлисдан туриш дуоси"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/409",
'parse_mode'=>'html',
]);
}
if($text == "Хўроз қичқирганда ва эшшак ханграганда айтиладиган қавл"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/410",
'parse_mode'=>'html',
]);
}
if($text == "Уйдан чиқиш ва унга киришдаги дуо"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/411",
'parse_mode'=>'html',
]);
}
if($text == "Ёмғир, шамол ва момақалдироқдаги дуо"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/412",
'parse_mode'=>'html',
]);
}
if($text == "Ҳар бир манзилга тушиш дуоси"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/408",
'parse_mode'=>'html',
]);
}
if($text == "Мева нишонасини кўргандаги дуо"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/413",
'parse_mode'=>'html',
]);
}
if($text == "Қўрқинч ва уйқусизликни ман қилувчи дуо"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/414",
'parse_mode'=>'html',
]);
}
if($text == "Қарзни узиш дуоси"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/415",
'parse_mode'=>'html',
]);
}
if($text == "Балога учрагандагини кўргандаги дуо"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/416",
'parse_mode'=>'html',
]);
}
if($text == "Беморнинг дуоси"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/417",
'parse_mode'=>'html',
]);
}
if($text == "Бозорга киришдаги дуо"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/418",
'parse_mode'=>'html',
]);
}
if($text == "Ёд олиш дуоси"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/419",
'parse_mode'=>'html',
]);
}

if($text == "Дуонинг одоблари"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/420",
'parse_mode'=>'html',
]);
}
if($text == "Набий алайҳиссаломга саловат"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/421",
'parse_mode'=>'html',
]);
}
if($text == "Истиғфор ва тавба ҳақида"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/423",
'parse_mode'=>'html',
]);
}
if($text == "Хулосалар"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/424",
'parse_mode'=>'html',
]);
}
if($text == "Тавба ва унинг фазли"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/425",
'parse_mode'=>'html',
]);
}
if($text == "Тавбанинг вақти"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/426",
'parse_mode'=>'html',
]);
}
if($text == "Гар бандаси исроф қилган бўлса ҳам Аллоҳ тавбасини қабул қилур"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/428",
'parse_mode'=>'html',
]);
}
if($text == "Тавба умр бўйи"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/429",
'parse_mode'=>'html',
]);
}
if($text == "Тавба қиссалари"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/430",
'parse_mode'=>'html',
]);
}
if($text == "Каъб ибн Молик розияллоҳу анҳунинг тавбаси"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/431",
'parse_mode'=>'html',
]);
}
if($text == "Иброҳим ибн Адҳамнинг тавбаси"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/432",
'parse_mode'=>'html',
]);
}
if($text == "Фузайл ибн Иёзнинг тавбаси"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/433",
'parse_mode'=>'html',
]);
}
if($text == "Маҳзунлик сафари"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/434",
'parse_mode'=>'html',
]);
}
if($text == "Куфада"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/435",
'parse_mode'=>'html',
]);
}
if($text == "Аллоҳ таолонинг раҳматининг кенглиги ҳақида"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/436",
'parse_mode'=>'html',
]);
}
if($text == "🎧Мўминнинг қалқони - муфассал рўза китоби"){
    bot('sendmessage',[
    'chat_id'=>$cid,
    'text'=>"<b> 🎧Мўминнинг қалқони - муфассал рўза китоби </b> <i>bo'limiga xush kelibsiz Marhamat O'zingizga kerakli audio darslarni tanlang</i>",
    'parse_mode'=>"html",
    'reply_markup'=>$ramazon,
]);
}
if($text == "Рўза қандай ибодат?"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/878",
'parse_mode'=>'html',
]);
}
if($text == "Сизларга рўза тутиш фарз қилинди...» (1-қисм)"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/879",
'parse_mode'=>'html',
]);
}
if($text == "Сизларга рўза тутиш фарз қилинди...» (2-қисм)"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/880",
'parse_mode'=>'html',
]);
}
if($text == "Сизларга рўза тутиш фарз қилинди...» (3-қисм)"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/881",
'parse_mode'=>'html',
]);
}
if($text == "Сизларга рўза тутиш фарз қилинди...» (4-қисм)"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/882",
'parse_mode'=>'html',
]);
}
if($text == "РЎЗАНИНГ ДАРАЖАЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/883",
'parse_mode'=>'html',
]);
}
if($text == "РЎЗАНИНГ ШАРТЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/884",
'parse_mode'=>'html',
]);
}
if($text == "РЎЗАНИНГ ТУРЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/885",
'parse_mode'=>'html',
]);
}
if($text == "РЎЗА ТУТИШ ҲАРОМ БЎЛГАН КУНЛАР"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/886",
'parse_mode'=>'html',
]);
}
if($text == "РЎЗА ТУТИШ МАКРУҲ БЎЛГАН КУНЛАР"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/887",
'parse_mode'=>'html',
]);
}
if($text == "ИХТИЁРИЙ РЎЗА"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/888",
'parse_mode'=>'html',
]);
}
if($text == "РЎЗАНИНГ НИЯТИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/889",
'parse_mode'=>'html',
]);
}
if($text == "РАМАЗОННИНГ ҲИЛОЛИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/890",
'parse_mode'=>'html',
]);
}
if($text == "САҲАРЛИК ВА ИФТОРЛИK"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/891",
'parse_mode'=>'html',
]);
}
if($text == "САҲАРЛИК ВА ИФТОРЛИК ҲАҚИДА САВОЛ-ЖАВОБЛАР"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/892",
'parse_mode'=>'html',
]);
}
if($text == "РЎЗАНИНГ МУСТАҲАБЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/893",
'parse_mode'=>'html',
]);
}
if($text == "РЎЗАНИ БУЗАДИГАН НАРСАЛАР"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/894",
'parse_mode'=>'html',
]);
}
if($text == "МАВЗУГА ОИД САВОЛ-ЖАВОБЛAР"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/895",
'parse_mode'=>'html',
]);
}
if($text == "РЎЗАНИ БУЗМАЙДИГАН НАРСАЛАР"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/896",
'parse_mode'=>'html',
]);
}
if($text == "РЎЗАНИ БУЗАДИГАН ВА БУЗМАЙДИГАН АМАЛЛАРГА ОИД САВОЛ-ЖАВОБЛАР"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/897",
'parse_mode'=>'html',
]);
}
if($text == "РЎЗАДОРГА МАКРУҲ БЎЛГАН НАРСАЛАР"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/898",
'parse_mode'=>'html',
]);
}
if($text == "РЎЗАДА МАКРУҲ БЎЛГАН НАРСАЛАРГА ОИД САВОЛ-ЖАВОБЛАР"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/899",
'parse_mode'=>'html',
]);
}
if($text == "АЁЛЛАРГА ХОС МАСАЛАЛАР"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/900",
'parse_mode'=>'html',
]);
}
if($text == "РЎЗА ТУТМАСЛИККА РУҲСАТ БЕРИЛГАНЛАР"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/901",
'parse_mode'=>'html',
]);
}
if($text == "РЎЗА ТУТМАСЛИКНИ ЁКИ ОЧИШНИ МУБОҲ ҚИЛУВЧИ ҲОЛАТЛАР"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/902",
'parse_mode'=>'html',
]);
}
if($text == "ҚАЗО ВА КАФФОРОТГА ОИД САВОЛ-ЖАВОБЛАР"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/903",
'parse_mode'=>'html',
]);
}
if($text == "ЭЪТИКОФ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/904",
'parse_mode'=>'html',
]);
}
if($text == "ЭЪТИКОФГА ОИД САВОЛ-ЖАВОБЛАР"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/905",
'parse_mode'=>'html',
]);
}
if($text == "ФИТР САДАҚАСИi"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/906",
'parse_mode'=>'html',
]);
}
if($text == "ФИТР САДАҚАСИНИНГ ВОЖИБ БЎЛИШ ШАРТЛАРИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/907",
'parse_mode'=>'html',
]);
}
if($text == "ФИТР САДАҚАСИГА ОИД САВОЛ-ЖАВОБЛАР"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/908",
'parse_mode'=>'html',
]);
}
if($text == "ФИДЯ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/909",
'parse_mode'=>'html',
]);
}
if($text == "ФИДЯГА ОИД САВОЛ-ЖАВОБЛАР"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/910",
'parse_mode'=>'html',
]);
}
if($text == "ТАРОВЕҲ НАМOЗИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/911",
'parse_mode'=>'html',
]);
}
if($text == "МАВЗУГА ОИД САВOЛ-ЖАВОБЛАР"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/912",
'parse_mode'=>'html',
]);
}
if($text == "МИНГ ОЙДАН ЯХШИРОҚ КЕЧА"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/913",
'parse_mode'=>'html',
]);
}
if($text == "НАФЛ РЎЗАЛАР ҲАҚИДАГИ ҲАДИСЛАР"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/914",
'parse_mode'=>'html',
]);
}
if($text == "НАФЛ РЎЗАГА ОИД САВОЛ-ЖАВОБЛАР"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/915",
'parse_mode'=>'html',
]);
}
if($text == "ИЙДУЛ ФИТР НАМОЗИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/916",
'parse_mode'=>'html',
]);
}
if($text == "РЎЗА ТУТИНГЛАР САЛОМАТ БЎЛАСИЗЛАР"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/917",
'parse_mode'=>'html',
]);
}
if($text == "🎧Яхшилик ва силаи раҳм"){
    bot('sendmessage',[
    'chat_id'=>$cid,
    'text'=>"<b> https://telegra.ph/Izhtimoij-odoblar-11-22 </b> <i> Marhamat O'zingizga kerakli audio darslarni tanlang</i>",
    'parse_mode'=>"html",
    'reply_markup'=>$Yaxshi,
]);
}
if($text == "Муқаддима#ЯХШИЛИК_СИЛАИ_РАҲМ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/776",
'parse_mode'=>'html',
]);
}
if($text == "Ота-онага яхшилик қилиш"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/777",
'parse_mode'=>'html',
]);
}
if($text == "Ота-онага яхшилик қилиш(02)"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/778",
'parse_mode'=>'html',
]);
}
if($text == "Отанинг ҳаққи улуғ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/779",
'parse_mode'=>'html',
]);
}
if($text == "Онанинг хизматини қилиш"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/780",
'parse_mode'=>'html',
]);
}
if($text == "ЎҒИЛ ОТАГА ИМОМ БЎЛМАЙДИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/781",
'parse_mode'=>'html',
]);
}
if($text == "ОТА-ОНАГА ЁМОН ҚАРАМАСЛИК"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/782",
'parse_mode'=>'html',
]);
}
if($text == "ОТА-ОНАНИ ТАШЛАБ ТИЖОРАТГА КЕТМАСЛИК"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/783",
'parse_mode'=>'html',
]);
}
if($text == "ОТАДАН ОЛДИН ЮРМАСЛИК"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/784",
'parse_mode'=>'html',
]);
}
if($text == "ОТА-ОНАНИ ЧИН ДИЛДАН ЯХШИ КЎРИШ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/785",
'parse_mode'=>'html',
]);
}
if($text == "ОТА-ОНАГА СИЛАИ РАҲМ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/786",
'parse_mode'=>'html',
]);
}
if($text == "ТАВБАГА КЎП ҚАЙТУВЧИЛАР"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/787",
'parse_mode'=>'html',
]);
}
if($text == "ОТА-ОНАНИ СИЛТАМАСЛИК"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/788",
'parse_mode'=>'html',
]);
}
if($text == "ОНА УЧУН ХАЖГА БОРМАСЛИК"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/789",
'parse_mode'=>'html',
]);
}
if($text == "КЕТГАНДА ВА КЕЛГАНДА САЛОМ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/790",
'parse_mode'=>'html',
]);
}
if($text == "ОТА-ОНАНИ РОЗИ ҚИЛИШ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/791",
'parse_mode'=>'html',
]);
}
if($text == "ОТА-ОНАДАН ДУО ОЛИШ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/792",
'parse_mode'=>'html',
]);
}
if($text == "МАЪСИЯТГА ИТОАТ ЭТИЛМАЙДИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/793",
'parse_mode'=>'html',
]);
}
if($text == "ХОЛА ОНА ЎРНИГА ЎТАДИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/794",
'parse_mode'=>'html',
]);
}
if($text == "АКА ОТА ЎРНИГА"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/795",
'parse_mode'=>'html',
]);
}
if($text == "ЭМИЗГАН АЁЛНИНГ ҲАҚҚИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/796",
'parse_mode'=>'html',
]);
}
if($text == "АМАКИ ОТА ЎPНИГА ЎТАДИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/797",
'parse_mode'=>'html',
]);
}
if($text == "ОТА-ОНАГА ОҚ БЎЛИШ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/798",
'parse_mode'=>'html',
]);
}
if($text == "ҚАРИНДОШГА СИЛАИ РАҲМ ҚИЛИШ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/799",
'parse_mode'=>'html',
]);
}
if($text == "ҚАРИНДОШЛИК"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/800",
'parse_mode'=>'html',
]);
}
if($text == "ФАРЗАНДГА ЯХШИЛИИК ҚИЛИШ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/801",
'parse_mode'=>'html',
]);
}
if($text == "ДЎСТЛАРГА ИКРОМ КЎРСАТИШ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/802",
'parse_mode'=>'html',
]);
}
if($text == "ҚИЗЛАР ТАРБИЯСИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/803",
'parse_mode'=>'html',
]);
}
if($text == "САДАҚАНИНГ ЭНГ АФЗАЛИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/804",
'parse_mode'=>'html',
]);
}
if($text == "ФАРЗАНДЛАРГА АДОЛАТЛИ БЎЛИШ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/805",
'parse_mode'=>'html',
]);
}
if($text == "ФАРЗАНД ТАРБИЯСИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/806",
'parse_mode'=>'html',
]);
}
if($text == "ФАРЗАНДГА МЕҲР"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/807",
'parse_mode'=>'html',
]);
}
if($text == "ҲАЛОЛ КАСБ ҚИЛИШ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/808",
'parse_mode'=>'html',
]);
}
if($text == "МЕРОС ҲАҚИДА"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/809",
'parse_mode'=>'html',
]);
}
if($text == "ҚАРИНДОШЛАРГА САДАҚА ҚИЛИШ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/810",
'parse_mode'=>'html',
]);
}
if($text == "ТАРБИЯ САДАҚАДАН АФЗАЛ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/811",
'parse_mode'=>'html',
]);
}
if($text == "АҲЛИДАН ОРТСА САДАҚА ҚИЛИШ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/812",
'parse_mode'=>'html',
]);
}
if($text == "САДАҚАНИ БИЛИБ БЕРИШ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/813",
'parse_mode'=>'html',
]);
}
if($text == "ФАРЗАНД УЧУН БАХИЛ БЎЛИШ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/814",
'parse_mode'=>'html',
]);
}
if($text == "ЗУЛМ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/815",
'parse_mode'=>'html',
]);
}
if($text == "ҚАРАМОҒИДАГИЛАРНИ ЗОЕ ҚИЛИШ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/816",
'parse_mode'=>'html',
]);
}
if($text == "ФАРЗАНД ОТА-ОНАСИНИ АМРИ-МАЪРУФ ҚИЛИШИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/818",
'parse_mode'=>'html',
]);
}
if($text == "ЭТИМНИНГ РИОЯСИ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/819",
'parse_mode'=>'html',
]);
}
if($text == "ҲАДЯ БЕРГАНГА ДУО ҚИЛИШ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/820",
'parse_mode'=>'html',
]);
}
if($text == "ҲАДЯ БЕРИШ"){
bot('sendAudio',[
'chat_id'=>$cid,
'audio'=>"https://t.me/SACOLJFTUHV/821",
'parse_mode'=>'html',
]);
}
if($text == "🎧Руҳий тарбия"){
    bot('sendMessage',[
    'chat_id'=>$cid,
    'text'=>"<b> 🎧Руҳий тарбия </b> <i> Marhamat o'zingizga kerakli audio darslikni tanlang</i>",
      'parse_mode'=>"html",
    'reply_markup'=>$ruha,
]);
}
if($text == "Руҳий тарбия"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/islomiy_kitob0/1232",
       'caption'=>"<b>00:00:00 Muqaddima 
00:34:36 Husni xulq 
01:05:45 Ilm 
01:29:25 Qalbni tozalash 
02:03:38 Namoz 
02:53:42 Zakot 
03:51:53 Ro‘za 
04:45:07 Haj 
05:36:57 Qur’on tilovati 
06:40:11 Zikr 
07:29:55 Kun tartibi 1-qism 
08:22:00 Kun tartibi 2-qism 
09:08:47 Tafakkur 
09:58:02 Murobata 
10:28:18 Nafs pokligi</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$ruha,
]);
}
if($text == "Руҳий тарбия 2"){
       bot('senddocument',[
       'chat_id'=>$cid,
       'document'=>"https://t.me/islomiy_kitob0/1233",
       'caption'=>"<b>00:00:00 Husni xulq 1-qism 
00:47:06 Husni xulq 2-qism 
01:38:11 Til ofatlari 
02:21:31 Yolg‘on 
03:12:59 G‘iybat 
03:54:26 Chaqimchilik 
04:35:56 Maddohlik 
05:37:51 Kufr 
06:18:05 Shirk 
06:59:55 Fosiqlik 
07:42:10 Bid’at 
08:44:02 Riyo 
09:30:39 Hasad</b>",
       'parse_mode'=>"html",
       'reply_markup'=>$ruha,
]);
}
if($text == "🎧Ҳикматли дунё» (1-қисм)"){
    bot('sendMessage',[
    'chat_id'=>$cid,
        'text'=>"<b> https://t.me/hikmatlidunyo0/3</b> <i>Barcha Audiolarni ushbu kanaldan olishingiz mumkin</i>",
    'parse_mode'=>"html",
    'reply_markup'=>$key1,
]);
}
if($text == "🎧Ҳикматли дунё» (2-қисм)"){
    bot('sendMessage',[
    'chat_id'=>$cid,
        'text'=>"<b> https://t.me/hikmatlidunyo0/105</b> <i>Barcha Audiolarni ushbu kanaldan olishingiz mumkin</i>",
    'parse_mode'=>"html",
    'reply_markup'=>$key1,
]);
}
if($text == "🎧Ҳикматли дунё» (3-қисм)"){
    bot('sendMessage',[
    'chat_id'=>$cid,
        'text'=>"<b> https://t.me/hikmatlidunyo0/187</b> <i>Barcha Audiolarni ushbu kanaldan olishingiz mumkin</i>",
    'parse_mode'=>"html",
    'reply_markup'=>$key1,
]);
}
if($text == "🎧Ҳикматли дунё» (4-қисм)"){
    bot('sendMessage',[
    'chat_id'=>$cid,
        'text'=>"<b> https://t.me/hikmatlidunyo0/322</b> <i>Barcha Audiolarni ushbu kanaldan olishingiz mumkin</i>",
    'parse_mode'=>"html",
    'reply_markup'=>$key1,
]);
}
if($text == "🎧Ҳикматли дунё» (5-қисм)"){
    bot('sendMessage',[
    'chat_id'=>$cid,
        'text'=>"<b> https://t.me/hikmatli_dunya/134</b> <i>Barcha Audiolarni ushbu kanaldan olishingiz mumkin</i>",
    'parse_mode'=>"html",
    'reply_markup'=>$key1,
]);
}
if($text == "🎧Ҳикматли дунё» (6-қисм)"){
    bot('sendMessage',[
    'chat_id'=>$cid,
        'text'=>"<b> https://t.me/hikmatli_dunya/137</b> <i>Barcha Audiolarni ushbu kanaldan olishingiz mumkin</i>",
    'parse_mode'=>"html",
    'reply_markup'=>$key1,
]);
}